[
    {
        "link": "https://reddit.com/r/Wordpress/comments/1ai0zdk/what_is_the_best_way_to_go_about_building_a",
        "document": "So I am new to WordPress and I've been running to YT videos to get myself to understand how to use WordPress and build a website with it as I am planning on building a website for myself a portfolio website and then also later on trying to freelance and build website for some companies I know could use a website. I have gotten to know about the basic wordpress builder which almost no one uses I am guessing and then the most popular as far as I have seen which is elementor, however I am not planning on buying the pro version and don't want to spend any extra money tbh so had to get around to using blocksy as well in order to edit the header and footer. All of these are slowly adding up in the complexities of building a website as a newbie and just wanted to know if there are any better ways you would recommend in order for me to go about building websites (might be int eh sense of plugins, etc). I would also like to know which page builder is the best and also any other plugins that would be essential to have in every website. Thank you in advance!\n\nPs. I don't know any coding or CSS so would like something that doesn't require any coding if possible."
    },
    {
        "link": "https://wordpress.com/support/five-step-website-setup",
        "document": "Whether you want to share ideas, start a business, or run a store, you can do it all on WordPress.com. No matter what type of website you create, these five steps will give you a solid foundation for your website to grow.\n\nVisit WordPress.com and click on Get Started to create your new account in a few quick steps. You’ll be asked to choose a name for your site to tell visitors what your website is about. Once you choose the perfect name, make it your Site Title in your General Settings. You can add a catchy Tagline here too!\n\nBy signing up, you already have a site address like . Go further with your very own domain, like . Register any available domain for free for the first year with any one-year or multi-year WordPress.com plan:\n\nMake a great first impression by customizing your site’s front page (known as the homepage). You can load any of these gorgeous themes and then change, add, or remove any elements to make the design your own.\n\nHere, you’ll meet “blocks” — these are the building blocks of your website. You can use blocks to add virtually anything to your pages: images, galleries, columns, videos, payment buttons, and much more.\n\nLean on the design expertise of others with block patterns — beautifully designed, ready-to-go collections of blocks you can add in just a few clicks for any kind of layout you can imagine.\n\nVisit our step-by-step guide to learn how to customize your homepage:\n\nAside from the homepage, the most common pages on a website are an About page and a Contact page. Starting from your dashboard, go to Pages → Add New Page to create a new page.\n\nYou can start with a ready-made page layout (shown in the image below) and make it your own by adding or removing any content as needed. You can also start fresh and add blocks or block patterns to create your own layout.\n\nThe menu at the top of a website contains the links readers can click to find their way around your site. You can now add the pages you created in Step 3. Get started by going to Appearance → Editor and editing the Navigation block (or Appearance → Menus for classic themes).\n\nIf you have a social media presence, your website is the perfect place to promote it. It’s common to see social media icons similar to this:\n\nYou can add these icons to your site’s menu using the Social Icons block.\n\nIf you have completed those five steps, you have a solid foundation for your website. If you are ready to share it with the world, go ahead and launch it!"
    },
    {
        "link": "https://reddit.com/r/Wordpress/comments/y0bout/a_total_newbie_to_wordpresswebsite_building",
        "document": "I want to build a website that teaches high school biology. I have absolutely zero knowledge in coding. (But I can learn it, if it's absolutely required in the end).\n\nThings that I did till now -\n• Made the visuals/structure of how every page of my website should look like in Canva\n\nNow it's so difficult to do stuff here. Like it's hard to match the visuals with my visuals, the ones I had built on canva. The themes that are present are absolutely not to my liking,(they look more like a store), whereas I want the look and feel of an education website. Any help how I can complete my website in the least possible time.\n\nI am a Canva pro, & I thought wordpress would work along similar lines!"
    },
    {
        "link": "https://wpengine.com/resources/wordpress-tips-best-practices-2020",
        "document": "7 WordPress Tips and Best Practices To Make Your Sites Shine\n\nA new year means a new opportunity to discover WordPress tips and best practices to make your best websites yet! Whether it’s taking the time to perform simple plugin updates or planning a blog redesign around the Gutenberg editor, there are quite a few ways you can focus your efforts to build your best WordPress sites in 2021!\n\nYou’re going to take on some incredible work next year, so before you get too crazy with new clients or preoccupied with projects, take the time to make your existing sites and workflow shine!\n\nHere are seven WordPress tips and best practices to think about in 2021:\n• Get to know the Gutenberg editor\n• Make sure your sites are mobile-friendly\n• Involve your clients in the design and development process\n\nThis first tip earned the number one spot on the list for a very important reason: You should keep it in mind for everything else we’re going to talk about.\n\nWhen you make changes directly to your live site, you run the risk of something causing your site to crash. And if your site is tied to your business, downtime is critical to avoid at all times, as that could mean a loss in sales.\n\nTo eliminate this unnecessary risk, you can use a test environment to update your WordPress site. For quick fixes, a staging site would work well. If you’re testing functionality or a brand new site design, we recommend a local environment. If you haven’t worked with a test environment before, Local is a free app that’ll help you get started in no time.\n\nFor the remaining best practices, we encourage you to try them in a test environment before pushing to production!\n\n2. Get to know the Gutenberg editor\n\nWordPress 5.0 was released at the end of 2018, which introduced the Gutenberg editor. Even if you’re planning to use the Classic Editor Plugin for a while (which will be supported until December 31st, 2021), it’s worth getting to know our new friend Gutenberg this year.\n\nWe recommend setting up a local WordPress site running version 5.0, so you can safely experiment with the new editor without any risk to your real site.\n\nIf you’re a content creator, try creating a new post with Gutenberg so you can see how it feels to use blocks. You may also get a few new ideas for formatting future articles!\n\nIf you’re a developer, you can import a copy of your live site into your local environment, and then update to WordPress 5.0 to do some troubleshooting. This will allow you to see how your site’s existing content reacts to Gutenberg, so you can put a plan in place to update the live site.\n\nThis WordPress tip is nothing new, but it’s so important that it’s worth including in any best practice list! Now’s the perfect time to audit your themes and plugins to make sure they’re up to date and running like they should be.\n\nWhile it may feel tedious to run through all the sites you manage just to update these things, it’s incredibly important for both site speed and security. Outdated versions may have vulnerabilities that put the site at risk, and imagine how much more time it’s going to take to fix a site with malware.\n\n4. Make sure your sites are mobile-friendly\n\nThis best practice also isn’t new, but it remains incredibly important: Your website needs to be fully responsive and mobile-friendly.\n\nIf you’re using well-maintained WordPress themes and plugins that are up to date (which, according to the last tip, you should be!), there’s a decent chance your site automatically performs pretty well on smaller screens. (Thanks, WordPress developers!)\n\nIf you’re running a custom site design, however, you might have to think a little more intentionally about making sure your site is mobile-friendly. And again, if you identify any changes you need to make, test them in a local environment or staging site first. Otherwise, site visitors might stumble across a pretty weird experience on your site while you’re in the middle of updates!\n\nThere was a point in time where SSL certificates were only considered important for certain types of sites, like eCommerce shops or online bank portals that were handling sensitive client information. Today, however, having an SSL certificate on your site is considered a best practice, even if you’re just building a personal blog.\n\nGoogle has even started flagging sites without an SSL certificate as “not secure,” which is definitely not something you want showing up on your website.\n\nIf you don’t have an SSL certificate installed, start with your WordPress hosting provider. Many will actually provide SSL certificates (a common benefit of managed WordPress hosts). WP Engine offers SSL certificates included with all plans. Learn more about secure WordPress hosting.\n\nThis tip is all about helping you have a more productive and efficient year when it comes to building sites for clients. One of the best ways to improve your workflow is to simplify the number of WordPress themes, plugins, add-ons, apps, extensions, etc. that you use.\n\nSure, there will always be new challenges to solve and unique site requirements, but do a little audit of all the tools you use. Is there any overlap? Can you simplify?\n\nFor example, when it comes to WordPress themes, do you have a single framework you always start from? Or maybe a theme company you trust? Or does every new site design require a bunch of research time to identify a brand new solution?\n\nIf you haven’t found your favorite tools yet, that’s okay. But make this the year you increase efficiency by defining your go-to options, so researching a custom solution is the exception, not the rule.\n\n7. Involve your clients in the design and development process\n\nThere’s almost nothing worse than making a ton of progress on a project, only to find out the client isn’t happy about a major part of it. This year, prioritize client feedback regularly throughout the project, to ensure everyone is always on the same page!\n\nWhen you’re onboarding a new client, take the time to get to know their business, what they like/dislike about other websites, and their goals for the year. Using a client questionnaire can help standardize that process so you don’t forget anything in the first stage of a project!\n\nOnce the project is in motion, check in with your client during different phases, including wireframes, mockups, development, etc. If you’re using Local to build the site, you can even send clients a link to the site on your machine, giving them a chance to preview a working version.\n\nBy getting feedback early on, you’ll prevent major changes down the road and keep your clients smiling!\n\nRemember, while all of these tips will be beneficial for your site and workflow, we recommend making all changes in a test environment first! Especially if you’re using Local, it’s easy to set up, quick to make changes, and even faster to push them to production."
    },
    {
        "link": "https://bluehost.com/blog/how-to-create-a-website-guide",
        "document": ""
    },
    {
        "link": "https://developers.google.com/search/docs/fundamentals/seo-starter-guide",
        "document": "Save and categorize content based on your preferences.\n\nWhen you built your website, you likely created it with your users in mind, trying to make it easy for them to find and explore your content. One of those users is a search engine, which helps people discover your content. SEO—short for search engine optimization—is about helping search engines understand your content, and helping users find your site and make a decision about whether they should visit your site through a search engine.\n\nThe Search Essentials outline the most important elements of what makes your website eligible to appear on Google Search. While there's no guarantee that any particular site will be added to Google's index, sites that follow the Search Essentials are more likely to show up in Google's search results. SEO is about taking the next step and working on improving your site's presence in Search. This guide will walk you through some of the most common and effective improvements you can do on your site.\n\nThere are no secrets here that'll automatically rank your site first in Google (sorry!). In fact some of the suggestions might not even apply to your business, but following the best practices will hopefully make it easier for search engines (not just Google) to crawl, index, and understand your content.\n\nGoogle is a fully automated search engine that uses programs called crawlers to explore the web constantly, looking for pages to add to our index. You usually don't need to do anything except publish your site on the web. In fact, the vast majority of sites listed in our results are found and added automatically as we crawl the web. If you're hungry for more, we have documentation about how Google discovers, crawls, and serves web pages.\n\nHow long until I see impact in search results?\n\nEvery change you make will take some time to be reflected on Google's end. Some changes might take effect in a few hours, others could take several months. In general, you likely want to wait a few weeks to assess whether your work had beneficial effects in Google Search results. Keep in mind that not all changes you make to your website will result in noticeable impact in search results; if you're not satisfied with your results and your business strategies allow it, try iterating with the changes and see if they make a difference.\n\nBefore you actually do anything mentioned in this section, check if Google has already found your content (maybe you don't need to do anything!). Try searching on Google for your site with the . If you see results pointing to your site, you're in the index. For example, a search for returns these results. If you don't see your site, check out the technical requirements to make sure there's nothing technically preventing your site from showing in Google Search, and then come back here.\n\nGoogle primarily finds pages through links from other pages it already crawled. In many cases, these are other websites that are linking to your pages. Other sites linking to you is something that happens naturally over time, and you can also encourage people to discover your content by promoting your site.\n\nIf you're open to a little technical challenge, you could also submit a sitemap—which is a file that contains all the URLs on your site that you care about. Some content management systems (CMS) may even do this automatically for you. However this isn't required, and you should first focus on making sure people know about your site.\n\nCheck if Google can see your page the same way a user does\n\nWhen Google crawls a page, it should ideally see the page the same way an average user does. For this, Google needs to be able to access the same resources as the user's browser. If your site is hiding important components that make up your website (like CSS and JavaScript), Google might not be able to understand your pages, which means they might not show up in search results or rank well for the terms you're targeting.\n\nIf your pages have different information depending on the user's physical location, make sure you're satisfied with the information that Google sees from its crawler's location, which is generally the US.\n\nTo check how Google sees your page, use the URL Inspection Tool in Search Console.\n\nIt might be important for you to opt out your site as a whole or sections of it from appearing in search results. For example, you might not want your posts about your new embarrassing haircut to show up in search results. Google supports various ways that lets you opt out of crawling and indexing of your URLs. If you need to block some files, directories, or even your whole site from Google Search, check out our guide about ways to prevent content from appearing in search results.\n\nWhen you're setting up or redoing your site, it can be good to organize it in a logical way because it can help search engines and users understand how your pages relate to the rest of your site. Don't drop everything and start reorganizing your site right now though: while these suggestions can be helpful long term (especially if you're working on a larger website), search engines will likely understand your pages as they are right now, regardless of how your site is organized.\n\nParts of the URL can be displayed in search results as breadcrumbs, so users can also use the URLs to understand whether a result will be useful for them.\n\nGoogle learns breadcrumbs automatically based on the words in the URL, but you can also influence them with structured data if you like a technical challenge. Try to include words in the URL that may be useful for users; for example:\n\nA URL that only contains random identifiers is less helpful for users; for example:\n\nIf you have more than a few thousand URLs on your site, how you organize your content may have effects on how Google crawls and indexes your site. Specifically, using directories (or folders) to group similar topics can help Google learn how often the URLs in individual directories change.\n\nFor example, consider the following URLs:\n\nThe content in the directory seldomly changes, however the content in the directory likely changes very often. Google can learn this information and crawl the different directories at different frequencies. To learn more about search-friendly site structures, check out our guide for ecommerce sites, for which a good URL structure is more important as they tend to be larger.\n\nSome websites show the same content under different URLs, which is called duplicate content. Search engines choose a single URL (the canonical URL) to show users, per piece of content.\n\nHaving duplicate content on your site is not a violation of our spam policies, but it can be a bad user experience and search engines might waste crawling resources on URLs that you don't even care about. If you're feeling adventurous, it's worth figuring out if you can specify a canonical version for your pages. But if you don't canonicalize your URLs yourself, Google will try to automatically do it for you.\n\nWhen working on canonicalization, try to ensure that each piece of content on your site is only accessible through one individual URL; having two pages that contain the same information about your promotions can be a confusing user experience (for example, people might wonder which is the right page, and whether there's a difference between the two).\n\nIf you have multiple pages that have the same information, try setting up a redirect from non-preferred URLs to a URL that best represents that information. If you can't redirect, use the element instead. But again, don't worry too much about this; search engines can generally figure this out for you on their own most of the time.\n\nMake your site interesting and useful\n\nCreating content that people find compelling and useful will likely influence your website's presence in search results more than any of the other suggestions in this guide. While \"compelling and useful content\" can mean different things to different people, content like this generally shares some common attributes, such as:\n• The text is easy-to-read and well organized: Write content naturally and make sure the content is well written, easy to follow, and free of spelling and grammatical mistakes. Break up long content into paragraphs and sections, and provide headings to help users navigate your pages.\n• The content is unique: When you're writing new content, don't copy others' content in part or in its entirety: create the content yourself based on what you know about the topic. Don't just rehash what others already published.\n• The content is up-to-date: Check in on previously published content and update it as needed, or even delete it if it's not relevant anymore.\n• The content is helpful, reliable, and people-first: Be sure that you're writing content that your readers will find helpful and reliable. For example, providing expert or experienced sources can help people understand your articles' expertise.\n\nThink about the words that a user might search for to find a piece of your content. Users who know a lot about the topic might use different keywords in their search queries than someone who is new to the topic. For example, some users might search for \"charcuterie\", while others might search for \"cheese board\". Anticipating these differences in search behavior and writing with your readers in mind could produce positive effects on how your site performs in search results.\n\nHowever, don't worry if you don't anticipate every variation of how someone might seek your content. Google's language matching systems are sophisticated and can understand how your page relates to many queries, even if you don't explicitly use the exact terms in them.\n\nWhile ads are a part of the internet and are meant to be seen by users, don't let them become overly distracting or prevent your users from reading your content. For example, advertisements, or interstitial pages (pages displayed before or after the content you're expecting) that make it difficult to use the website.\n\nLinks are a great way to connect your users and search engines to other parts of your site, or relevant pages on other sites. In fact, the vast majority of the new pages Google finds every day are through links, making links a crucial resource you need to consider to help your pages be discovered by Google and potentially shown in search results. Additionally, links can also add value by connecting users (and Google) to another resource that corroborates what you're writing about.\n\nLink text (also known as anchor text) is the text part of a link that you can see. This text tells users and Google something about the page you're linking to. With appropriate anchor text, users and search engines can easily understand what your linked pages contain before they visit.\n\nLink when you need to\n\nLinks can provide more context on a topic, both for users and search engines, which may help demonstrate your knowledge on a topic. However when you're linking to pages outside of your control, for example content on other sites, make sure you trust the resource you're linking to. If you can't trust the content and you still want to link to them, add a or similar annotation to the link to avoid search engines associating your site with the site you're linking to. This helps avoid potential negative consequences in your rankings in Google Search.\n\nIf you're accepting user-generated content on your site, such as forum posts or comments, make sure every link that's posted by users has a or similar annotation automatically added by your CMS. Since you're not creating the content in this case, you likely don't want your site to be blindly associated with the sites users are linking to. This can also help discourage spammers from abusing your website.\n\nInfluence how your site looks in Google Search\n\nA typical Google Search results page consists of a few different visual elements that you can influence to help users decide whether they should visit your site through those search results. In this section, we're focusing on the title link and the snippet because these are the more visually significant elements.\n\nThe title link is the headline part of the search result and it can help people decide which search result to click. There are a few sources that Google uses to generate this title link, including the words inside the element (also called the title text) and other headings on the page. This title text can also be used for the title that's shown in browsers and bookmarks.\n\nYou can influence the title links in Search by writing good titles: a good title is unique to the page, clear and concise, and accurately describes the contents of the page. For example, your title could include the name of your website or business, other bits of important information like the physical location of the business, and maybe some information about what the particular page has to offer for users. Our documentation about title links has more tips about how to create good titles and how to influence your site's search results' title links.\n\nBelow the title link, a search result typically has a description of the target page to help users decide whether they should click the search result. This is called a snippet.\n\nThe snippet is sourced from the actual content of the page the search result is linking to, thus you have complete control over the words that can be used to generate the snippet. Occasionally the snippet may be sourced from the contents of the meta description tag, which is typically a succinct, one- or two-sentence summary of the page. A good meta description is short, unique to one particular page, and includes the most relevant points of the page. Check out our tips for writing good meta descriptions for more inspiration.\n\nAdd images to your site, and optimize them\n\nMany people search visually, and images can be how people find your website for the first time. For example, if you have a recipe blog, people might find your content by searching for \"fruit tart recipes\" and browsing photos of various types of fruit tarts.\n\nAs you add images to your site, make sure that people and search engines can find and understand them.\n\nWhen you use high quality images, you give users enough context and detail to decide which image best matches what they were looking for. For example, if people are looking for \"daisies\" and come across a rogue edelweiss in search results, a higher quality image would help them distinguish the type of flower.\n\nUse images that are sharp and clear, and place them near text that's relevant to the image. The text that's near images can help Google better understand what the image is about and what it means in context to your page.\n\nFor example, if the page is reviewing yarn shops in London, then it would make sense to embed one of your photos of the yarn shop in the section that details the location, description, and review information for that yarn shop. This helps Google and users associate the image with text that provides more context to what the page is about.\n\nAlt text is a short, but descriptive piece of text that explains the relationship between the image and your content. It helps search engines understand what your image is about and the context of how your image relates to your page, so writing good alt text is quite important. You can add this to your HTML with the attribute of the element, or your CMS may have an easy way to specify a description for an image when you're uploading it to your site. Learn more about how to write good alt text, and how to add it to your images.\n\nIf your website includes pages that are primarily about individual videos, people may also be able to discover your site through video results in Google Search. Many of the best practices for images and text also apply to videos:\n• Create high-quality video content, and embed the video on a standalone page, near text that's relevant to that video.\n• Write descriptive text in the titles and description fields of a video (the title of a video is still a title, and so you can apply the best practices for writing titles here too).\n\nIf your site is particularly video-focused, then continue reading about more things you can do to optimize your videos for search engines.\n\nEffectively promoting your new content will lead to faster discovery by those who are interested in the same subject, and also by search engines. You can do this in many ways:\n• Word of mouth, and many other methods\n\nOne of the most effective and lasting ways is word of mouth: that is, people familiar with your site tell their friends about it, who in turn visit your site. This can take time, and usually you need to invest some time and effort in other practices first, such as community engagement. Our friends over at Google for Creators have excellent resources about building and engaging your audience.\n\nPutting effort into the offline promotion of your company or site can also be rewarding. For example, if you have a business site, make sure its URL is listed on your business cards, letterhead, posters, and other materials. With their permission, you could also send out recurring newsletters to your audience letting them know about new content on your website.\n\nAs with everything in life, you can overdo promoting your site and actually harm it: people may get fatigued of your promotions, and search engines may perceive some of the practices as manipulation of search results.\n\nThings we believe you shouldn't focus on\n\nAs SEO has evolved, so have the ideas and practices (and at times, misconceptions) related to it. What was considered best practice or top priority in the past may no longer be relevant or effective due to the way search engines (and the internet) have developed over time.\n\nTo help you focus on the things that are actually important when it comes to SEO, we collected some of the most common and prominent topics we've seen circulating the internet. In general, our message on these topics is that you should do what's best for your business area; we will elaborate on a few specific points here:\n\nExcessively repeating the same words over and over (even in variations) is tiring for users, and keyword stuffing is against Google's spam policies. Keywords in the domain name or URL path When picking the name of your site, do what's best for your business. Users will use this name to find you, so we recommend following general marketing best practices. From a ranking perspective, the keywords in the name of the domain (or URL path) alone have hardly any effect beyond appearing in breadcrumbs. And while still on the topic of domain names: the TLD (the domain name ending like \".com\" or \".guru\") only matters if you're targeting a specific country's users, and even then it's usually a low impact signal. For example, if you're trying to sell Dutch cheese to people searching from Switzerland, it makes some sense (both from business and SEO point of view) to use a .ch domain name. Otherwise Google Search doesn't care which TLD you're using (whether it's a .com or .org or .asia). The length of the content alone doesn't matter for ranking purposes (there's no magical word count target, minimum or maximum, though you probably want to have at least one word). If you are varying the words (writing naturally to not be repetitive), you have more chances to show up in Search simply because you are using more keywords. From a business point of view, do whatever makes sense for your business. For example, it might be easier to manage the site if it's segmented by subdirectories, but other times it might make sense to partition topics into subdomains, depending on your site's topic or industry. While PageRank uses links and is one of the fundamental algorithms at Google, there's much more to Google Search than just links. We have many ranking signals, and PageRank is just one of those. If you have some content that's accessible under multiple URLs, it's fine; don't fret about it. It's inefficient, but it's not something that will cause a manual action. Copying others' content, however, is a different story. Having your headings in semantic order is fantastic for screen readers, but from Google Search perspective, it doesn't matter if you're using them out of order. The web in general is not valid HTML, so Google Search can rarely depend on semantic meanings hidden in the HTML specification. There's also no magical, ideal amount of headings a given page should have. However, if you think it's too much, then it probably is. No, it's not.\n• Get started with Search Console: Setting up a Search Console account helps you monitor and optimize how your website performs on Google Search. Learn how to set up your account and what reports to check out first.\n• Maintain your website's SEO over time: Learn more about managing your site's presence in the long term, including more in-depth SEO tasks and scenarios, such as preparing for a site move, or managing a multi-lingual site.\n• Enhance how your site looks in Google Search results: Valid structured data on your pages also makes your pages eligible for many special features in Google Search results, including review stars, carousels, and more. Explore the gallery of search result types that your page can be eligible for.\n\nAs you embark on your SEO journey, here are some resources that can help you stay on top of changes and new resources we publish:"
    },
    {
        "link": "https://backlinko.com/hub/seo/visibility",
        "document": "Search engine visibility (also known as “search visibility” or “SEO visibility”) is the share of traffic that a website receives from its rankings in the organic search results.\n\nFor example, let’s say that you rank #3 for a specific keyword.\n\nWell, according to our Google click through rate industry study, the third result in Google gets 18.6% of all clicks.\n\nWhich means that your site’s search engine visibility for that specific keyword is 18.6%.\n\nYou can also calculate your website’s search visibility as a whole using a tool like Semrush.\n\nThis site-wide number takes all of your rankings into account. And gives you a visibility score that’s based on every single keyword that you rank for.\n\nWith that explanation out of the way, here’s how to improve your search engine visibility:\n\nIf your search engine visibility isn’t where you want it to be, it’s probably because you’re targeting keywords that are way too competitive.\n\nIn fact, this is a mistake that I made back in the day.\n\nWhen I first got started with keyword research, I’d choose keywords that got lots of searches.\n\nSo when I found a keyword with 9k searches per month I’d say: “Great! That sounds like a keyword I should target”.\n\nUnfortunately, a lot of these keywords had super high keyword difficulty scores, like this:\n\nWhich meant I had pretty much zero chance of ranking for that keyword. Even if my content was outstanding.\n\nWhich is why I recommend focusing on long tail keywords.\n\nLong tail keywords usually have low levels of competition in SERPs.\n\nThis means you have a good shot at cracking the top 3 results.\n\nFor example, a while ago I targeted the long tail keyword: “Semrush vs Ahrefs”.\n\nBecause that keyword wasn’t insanely competitive, I was able to rank in the top 3 for that term within a month or so.\n\nToday, my search engine visibility for that keyword is around 27%.\n\nGoogle now downranks sites that aren’t optimized for mobile.\n\nFortunately, it’s easy to see if Google considers your site “mobile friendly”.\n\nWebPageTest will tell you whether or not your site is properly optimized for mobile devices.\n\nAnd the higher your CTR, in general, the higher your site will rank in Google.\n\nQuestion is: How do you get more people to click on your result?\n\nWrite title tags and meta descriptions that make your result more compelling.\n\nSpecifically, you want to write title tags that grab attention… without clickbait.\n\nAnd you want your meta descriptions to sell your content.\n\nWhen you do these two things consistently, you can increase your CTR significantly.\n\nThis CTR boost can lead to higher rankings in Google. And ultimately, improved search engine visibility.\n\nThere’s no doubt about it: if you want to increase your search engine visibility, backlinks are a must.\n\nBut not just any backlinks.\n\nYou need to focus on getting links from websites in your niche.\n\nFor example, my site is about SEO.\n\nAnd if I got a backlink from a site in the fitness niche, it might help my rankings.\n\nBut a link from a website about SEO or digital marketing is going to have a MUCH bigger impact.\n\nAnd if you want to build links from other website owners in your industry, I recommend checking out this video.\n\nYou can also skim through this huge list of link building strategies.\n\nGoogle wants to rank web pages that people LOVE.\n\nHow do they know if someone is loving a specific piece of content?\n\nDwell Time is one of the many UX Signals that Google uses to figure out whether a site is a good match for a specific keyword.\n\nIn fact, our ranking factors study of 11M+ search results found that websites with high Dwell Times tended to have higher rankings vs. sites with low Dwell Times.\n\nFor example, let’s say that someone clicks on your result. And clicks back to Google 3 seconds later.\n\nThat’s a super low Dwell Time. And if enough people bounce that quickly, Google will figure out that your site isn’t giving people what they want. And they’ll probably drop you down a few spots.\n\nBut if people spend 3 minutes on your page, that tells Google a completely different story.\n\nThat tells Google that your content is a good match for that keyword. And they may rank you higher as a result.\n\nAnd one of the easiest ways to improve Dwell Time?\n\nMake your above the fold area super compelling.\n\nAfter all, that’s the first thing someone sees when they land on your site. So it’s important to grab their attention right away.\n\nFor example, check out this blog post from my site:\n\nAs soon as you land on that page, you see a handful of things that should stop you from hitting your “back” button:\n• First line of the intro visible\n\n6. Improve Pages That Are Ranking On Page 2\n\nOnly about 1% of Google users visit the second page of the search engine results.\n\nSo one of the BEST ways to improve your search engine visibility is to push your site from page 2 to page 1.\n\nNote: While Google SERPs now feature continuous scroll instead of distinct pages, the concept remains the same. Users rarely scroll past the initial set of results, making it even more important to move up from lower positions.\n\nFirst, you need to use the Google Search Console to find keywords where you rank on the second page.\n\nThen, look at one of the pages that’s stuck on page 2.\n\nAnd do what you can to improve that page’s SEO.\n\nYou can improve your content’s search intent so it’s a 1:1 match for that keyword.\n\nYou can also add more content, examples and strategies so that your content is more comprehensive.\n\nYou can even add screenshots, charts and videos to make your content more interactive.\n\nSo yeah, the possibilities here are pretty much endless.\n\nBut the overall goal is to focus your SEO efforts on that single page so it pushes over to the first page of Google.\n\nAdding Latent Semantic Indexing (LSI) keywords to your content can help Google figure out what your page is all about.\n\nAll you need to do is search for your keyword in Google Images.\n\nAnd check out the little tags that show up.\n\nThose tags are words and phrases that Google considers closely tied to that keyword.\n\nAnd when you mention those terms in your content, you’ll confirm to Google that your page is really about that keyword.\n\nInternal linking is a relatively easy SEO technique that can make a big impact on your search engine rankings.\n\nAll you need to do is find pages on your site with lots of link authority (the “Indexed Pages” report in Semrush is great for this).\n\nThen, you want to use internal links to push the link authority that those pages have over to pages that don’t have as many links.\n\nFor example, this page on my site has over 5,000 backlinks.\n\nAnd, as you can see, I internally link from that page to other key pages on my site.\n\nYour site’s technical SEO is a sneaky important part of your search engine visibility.\n\nIf Google can’t crawl and index your site, it’s going to be tough to rank. Even if you have AMAZING content and thousands of backlinks.\n\nThe thing is: it’s impossible to manually check your HTML for issues and errors.\n\nInstead, you want to use an SEO audit tool that will spot issues for you.\n\nI personally like the SEO audit feature in Semrush.\n\nBut if you’re on a budget, the free SEOptimer tool isn’t half bad.\n\nEither way, you definitely want to scan your site for technical SEO problems. And get those fixed ASAP.\n\nMoving up in the search engine rankings isn’t the only way to improve your search engine visibility.\n\nYou can also take up more “SERP Real Estate”.\n\nExpand your site’s snippet. Or rank your properties in multiple spots.\n\nFor example, check out this snippet in Google SERP:\n\nSee those links underneath meta description? Those are sitelinks.\n\nAnd they help my result take up a few more pixels of SERP real estate. Which leads to more clicks.\n\nThe easiest way to get more sitelinks is to add a table of contents section to the top of your page, like this:\n\nAnd if you want to REALLY expand your SERP real estate, try to get ranked as a Featured Snippet.\n\nA Featured Snippet takes up significantly more space than a traditional snippet. Plus, it tends to show up at the top of the page.\n\nYou can also expand your SERP real estate with multiple rankings for the same keyword.\n\nIn other words, create content on these platforms designed to rank alongside a keyword that you already rank for:\n\nFor example, check out the rankings for this keyword.\n\nAs you can see, my site ranks in the featured snippet for that term. And one of my YouTube videos is just below it.\n\nIn a perfect world you’d build backlinks directly to the page that you want to rank.\n\nBut we don’t live in a perfect world 🙂\n\nPlus, it’s tough to convince someone to link to an ecommerce product page. Or a services page. Or even a homepage.\n\nFortunately, you can still improve their search engine visibility.\n\nEven without getting backlinks that point directly to those pages.\n\nOur breakdown of 11M Google search results found that a site’s overall link authority strongly correlated with higher rankings.\n\nIn other words: getting links to ANY page helps every other page on that site rank better.\n\nI’m sure you’ve seen this firsthand.\n\nYou see a site that ranks above you. A site with HORRIBLE content. And you think: “Why do they rank above me?”.\n\nThe answer is usually that they have a higher domain authority than you do.\n\nYou can check your site’s domain authority using Semrush.\n\nJust enter your homepage into the tool. And it will tell you what your Authority Score (Semrush’s version of domain authority) is.\n\nTo be clear: there’s no “good” Domain Rating to shoot for. It really depends on your niche.\n\nFor example, in the marketing niche, most of the big players have a Domain Rating of 85-90.\n\nBut in the gardening niche, the average Domain Authority is more like 30.\n\nSo the goal here is just to get a benchmark number. And work to improve it over time.\n\nWhen you do, you’ll likely see your site’s overall search engine visibility quickly improve.\n\nThe Definitive Guide to On-Page SEO: A super through guide to on-site optimization that I keep constantly updated.\n\nHow to Write a Blog Post Guide: SEO techniques and tactics are great. But at the end of the day, the best content usually ranks #1. And this guide will show you how to write blog content that gets results.\n\nHow to Create an Effective SEO Strategy: This post will help you take a lot of the tips that I outlined here… and turn them into a comprehensive strategy."
    },
    {
        "link": "https://support.squarespace.com/hc/en-us/articles/205814568-Increasing-your-site-s-visibility-to-search-engines",
        "document": "Tips to make your site more discoverable in search results.\n\nThis guide shows you how to use Squarespace's SEO-targeting features and other tools to increase your site's visibility to search engines. For more SEO best practices, visit SEO checklist.\n\nSearch engines won't notice changes to your site instantly. Google and Bing offer search tools to help you manage your site's search presence. Whenever you make major changes to your site, you can request that a search engine re-index your content by using these services:\n\nSearch engines typically prioritize the following content from your site in this order:\n\nYou can set default title formats for the homepage, collections (like blog, products, and event pages), and collection items (like blog posts and events). These titles also appear in browser tabs and search results, so it's important to write them so they’re friendly to both humans and search bots. To learn more, visit Changing title formats for SEO and browser tabs.\n\nEvery page in your site has an SEO title and navigation title. You can edit these titles in page settings.\n• SEO titles - These appear in search results and browser tabs, and are indexed by search engines. We recommend for each page. SEO titles are a good place to promote keywords for search engines. You can also add SEO titles for individual collection items, like blog posts, products, and events.\n• Navigation titles - These create links in your navigation menus. It's best to keep these short, like \"About\" or \"Contact.\"\n\nAs you add text to your site, include words and phrases that match the search terms people use to find sites like yours. These keywords help search engines display your site as relevant to the people looking for those search terms.\n\nYour keyword strategy depends on your site and the visitors you're trying to attract, and it's important to add keywords in a clear, natural way that makes sense to humans.\n\nTo learn more, visit Adding keywords for SEO.\n\nUse heading text formatting to organize pages. Like titles, search engines typically give headings a higher priority. Clear headings that describe the content that follows make it easier for search engines to detect the major themes of your site. At the same time, they help visitors skim your page and quickly find the information they're looking for.\n\nAs a general rule, you should use headings in descending order to funnel visitors from the broadest information to the most specific. Keep in mind:\n• Ensure you're using heading sizes consistently on the page and across your site.\n• Don't use the same text for multiple headings.\n• As long as headings are structured and consistent, you can use the same type of heading multiple times on a page. Refer to the screenshot below for an example.\n• When possible, avoid using headings to create formatting effects, such as pull quotes. If you must use headings to create pull quotes, ensure your quote includes content important to the page, like keywords.\n\nHow you organize your site depends on your content, but here's one example of a well-structured page:\n\nAlt text is text associated with an image. This text displays when people hover over it, and makes your site more accessible.\n\nSearch engines use alt text to identify the content of a page, because bots can only read text. By adding alt text to images, search engines understand what the image is and they can include it in relevant searches.\n\nWhen adding alt text, ensure you follow our alt text best practices.\n\nSearch engines scan tags and categories to identify what products, blog posts, or gallery images are about. Adding tags and categories that accurately describe the item could help it appear in search results. Tags and categories also help visitors use your site, and appear in your site's search results.\n\nYou can add a blog to any Squarespace site. Blogging regularly helps search engines consider your site active. Even if you're a business and not a blogger, adding a blog page and updating it regularly with relevant content could benefit your SEO while building your brand.\n\nWhen adding blog posts, use tags and categories, and structure your posts with Heading 1 and Heading 2 formatting. Squarespace automatically gives blog post titles Heading 1 formatting on all version 7.1 sites and most version 7.0 templates.\n\nAs you write blog posts, think about your target audience and what they might be searching for to find a site like yours. Add content that would appeal to them, and optimize the posts with keywords, especially in post titles and headings.\n\nHow long it takes for a page to load may affect its ranking in search results. Whenever possible, we recommend reducing your page size for faster loading.\n\nIf you're a business with a physical location, listing your address on your site could help visitors find you in location-based services. There are many places where you can add your location:\n\nYou can add SEO descriptions for your site, individual pages, and certain collection items. These descriptions may appear below the title/link in search results, depending on the search terms used.\n\nVisitors read these descriptions to decide if they want to click the result. To make your site inviting, we recommend keeping your descriptions short, relevant, and readable.\n\nTo learn more, visit Adding site and page descriptions for SEO.\n\nWhen SSL is enabled, the custom URL starts with https. This means visitors access every page of your site with a secure connection. Search engines consider SSL important and may penalize sites that don't have it enabled.\n\nIf you're unsure if SSL is enabled for your site, check the SSL panel and confirm it's set to the Secure setting.\n\nSEO strategy falls outside of the scope of Squarespace Customer Support because search engine technology frequently changes and everyone's marketing needs are unique. Because of this, we can't guarantee results like ranking changes or listing appearance in a search engine.\n\nWhile we're unable to provide specific SEO advice through email and live chat, there are other ways you can get more SEO help:\n• Attend an expert-led SEO with your Squarespace site webinar.\n• Get advice from the community in the Squarespace Forum.\n• For hands-on help, hire a vetted SEO expert to build your site with SEO in mind."
    },
    {
        "link": "https://mtu.edu/umc/services/websites/seo",
        "document": "How do you improve the SEO of your website? Follow these five suggestions to improve your search engine optimization (SEO) and watch your website rise the ranks to the top of search engine results pages (SERPs).\n\nCreating an effective SEO strategy involves foundational practices, advanced techniques, and ongoing analysis. Below are key tactics, tips, and steps to consider when developing an SEO strategy:\n• Audit and Benchmark Current Site Performance: conduct a comprehensive site audit to identify strengths, weaknesses, and technical SEO issues such as broken links, slow page speeds, and mobile usability. Benchmark existing metrics to establish baseline traffic, keyword rankings, and conversion rates using tools like Google Analytics, Search Console, and SEO software (e.g., Ahrefs, SEMrush). Additionally, perform a content inventory to evaluate which pages perform well and identify those needing updates or consolidation.\n• Competitor Analysis: identify competitors by assessing which websites rank for your target keywords. Analyze their content, including structure, depth, and keyword usage on high-ranking pages. Use tools to discover where competitors are obtaining quality backlinks and uncover link-building opportunities. Pinpoint topics or keywords your competitors cover that you haven't addressed, and create unique content to fill those gaps.\n• Keyword Research and Intent Mapping: use a combination of keyword research tools such as Google Keyword Planner, SEMrush, Ahrefs, and AnswerThePublic to build a comprehensive keyword list. Focus on finding low-competition keywords that align with user intent and create targeted content around them. Develop topic clusters by creating pillar pages connected to detailed subtopic content to improve site structure and authority on key topics.\n\nWe believe that on-page SEO is the key to improving search engine success on Google and other search engines. Quality, authoritative, authentic content is the number one driver of your search engine rankings and there is no substitute for great content—this is especially true when doing SEO marketing. Quality content created specifically for your intended user increases site traffic, which improves your site's authority and relevance. Fine-tune your web writing skills and present yourself as an authority on the topic you are writing about. Using your SEO strategy, develop or redevelop content to improve your rankings.\n\nIdentify and target a specific keyword phrase for each authoritative content page on your website. Think about how your reader might search for that specific page with search terms like:\n• how to apply for scholarships?\n• when is the FAFSA deadline?\n• what is the difference between engineering and engineering technology?\n\nIt is very difficult for a webpage to achieve search engine rankings for multiple keyword phrases—unless those phrases are very similar. A single page may be able to rank for both \"biomedical engineering jobs\" and \"biomedical engineering careers\". Ranking for \"student affairs\" and \"dean of students\" or \"gender discrimination\" and \"violence reporting procedures\" with a single page is unlikely.\n\nIf you want to rank for multiple keywords phrases with your website, you will need to make a separate webpage for each keyword phrase you are targeting.\n\nOnce your keyword phrase is chosen for a given page, consider these questions:\n• Can I use part or all of the keyword phrase in the page URL (by using keywords in folders)?\n• Can I use part or all of the keyword phrase in the page title?\n• Can I use part or all of the keyword phrase in page headings and subheadings?\n\nAnswering yes to these questions can improve your search engine ranking. Be natural and user-friendly, though. For instance, you do not want the word \"engineering\" to show up three or more times in the URL or have the phrase Northern Lights repeated in the page title and also every heading. Readability and usability still trump search engine optimization.\n\nBeyond page URL, title, and headings, content is most influential on search engine rankings. Optimizing your content is often referred to as 'on-page SEO' or 'page optimization.' Repeat your keyword phrase several times throughout the page—once or twice in the opening and closing paragraphs, and two to four more times throughout the remaining content. Be authoritative. Strategically link to relevant sources and additional information—both within your organizations broad website and even to other websites which are useful to your end user. The content that you create is key to improving your SEO.\n\nWhen developing your content, it is especially important to lend your experiences and your expertise to your target audience. This will help your content stand out against everyone else's—including the plethora of content being created by generative artificial intelligence (AI) each day. Experiences and expertise builds credibility, engages users, and fosters long-term success. It aligns with search engines' goals of delivering high-quality, relevant information to users and can contribute to a strong online presence and improved SEO performance.\n\nDon't forget to use bold, italics, heading tags (especially an H1), and other emphasis tags to highlight these keyword phrases—but don't overdo it. You still want your language and writing style to read naturally. Never sacrifice good writing for SEO. The best pages are written for the user, not for the search engine. Read more about SEO marketing to help you find new content opportunities.\n\nYou've probably noticed that we feel pretty strongly about content. Search engines do, too. Regularly updated content is viewed as one of the best indicators of a site's relevancy, so be sure to keep it fresh. Audit your content on a set schedule (semesterly for example) and make updates as needed. Introduce new sources where appropriate, make additions and modifications, and keep your content fresh for your audience.\n\nWriting additional content, rich with keyword phrases, on your departmental news blog can also boost your search engine rankings. Blog posts can even be shorter updates about the specific topics you are targeting. Interlink your related CMS webpages and blog posts when it helps give the reader a better picture or additional information about the topic.\n\nWhen designing your website, each page contains a space between the <head> tags to insert metadata, or information about the contents of your page. If you have a CMS site originally produced by the UMC web team will have pre-populated this data for you. However, it is important for you to review and update metadata as your site changes over time.\n\nTitle metadata is responsible for the page titles displayed at the top of a browser window and as the headline within search engine results. It is the most important metadata on your page.\n\nFor those with a CMS website, the web team has developed an automated system for creating the meta title for each webpage based on your page title. This adds to the importance of using well-thought-out page titles rich with keyword phrases.\n\nDescription metadata is the textual description that a browser may use in your page search return. Think of it as your site's window display—a concise and appealing description of what is contained within, with the goal of encouraging people to enter. A good meta description will typically contain two full sentences. Search engines may not always use your meta description, but it is important to give them the option.\n\nKeyword metadata is rarely if ever used to tabulate search engine rankings. However, you should already know your keyword phrases, so it doesn't hurt to add them into your keyword metadata. You'll want to include a variety of phrases. As a general rule, try to keep it to about 3-7 phrases with each phrase consisting of 1-4 words. A great example would be \"computer science degree.\"\n\nAlways describe your image and video media using alt tags, or alternative text descriptions. They allow search engines to locate your page, which is crucial—especially for those who use text-only browsers or screen readers.\n\nWhile Google and other search engines are advanced at understanding content, we have found that implementing Schema.org markup on our webpages—especially published and modified dates—has helped our content crawl and recrawl rates and has influenced how our content shows up in SERPs.\n\nA webpage that is content-rich, authoritative, unbiased, and helps visitors learn more about what they are interested in is most likely to attract links from other websites, which improves your search engine optimization.\n\nImprove your authority and credibility by adding relevant links within the text. Instead of having \"click here\" links, try writing out the name of the destination. \"Click here\" has no search engine value beyond the attached URL, whereas \"Michigan Tech Enterprise Program\" is rich with keywords and will improve your search engine rankings as well as the ranking of the page you are linking to. Always use descriptive links by linking keywords—it not only improves search engine optimization but also adds value to your readers, including those with disabilities or who are using screen readers.\n\nUse tools such as Google Search Console, Bing Webmaster Tools, or Moz to keep track of your SEO rankings. After 4-6 months, you should begin to see an increase in your search engine impressions. Over the next few months, these impressions should translate into clicks, which you can within your SEO tools and also your web analytics.\n\nNow, you are able to optimize your content to make improvements, rise up the rankings, and serve your target audience.\n\nOff-page SEO involves actions taken outside your website to influence search engine rankings. While opinions on its importance vary within the SEO community, we believe that dedicating time and resources to creating valuable content for your target audience yields greater benefits for your business.\n\nQuality content establishes your brand as a trusted source, attracting and engaging users, and encouraging return visits and content sharing. While off-page SEO tactics may offer short-term gains, content creation fosters long-term relationships and organic growth. By focusing on relevant content creation, we have achieved better results that scale compared to relying on off-page SEO strategies.\n\nEnsure your website is mobile-responsive and offers a seamless user experience on smartphones and tablets. Remember to optimize images and other media for faster loading on mobile devices. You can test your website's mobile-friendliness using tools like Google's Lighthouse testing tool.\n\nWork with strong web developers to implement best practices for technical search engine optimization. This includes providing a fast, seamless user experience that is intuitive and high-performing. Compress images, minimize HTTP requests, and enable browser caching. Use a clean and organized URL structure that is easy for both users and search engines to navigate. Implement schema markup to enhance rich snippets and improve the visibility of your content in search results.\n\nThese are only a few of the many methods for how to improve your search engine ranking. If you want to learn more about improving SEO, we recommend the following resources:"
    },
    {
        "link": "https://highervisibility.com/seo/learn/improve-website-visibility",
        "document": ""
    }
]