[
    {
        "link": "https://fastapi.tiangolo.com/deployment",
        "document": "To deploy an application means to perform the necessary steps to make it available to the users.\n\nFor a web API, it normally involves putting it in a remote machine, with a server program that provides good performance, stability, etc, so that your users can access the application efficiently and without interruptions or problems.\n\nThis is in contrast to the development stages, where you are constantly changing the code, breaking it and fixing it, stopping and restarting the development server, etc.\n\nThere are several ways to do it depending on your specific use case and the tools that you use.\n\nYou could deploy a server yourself using a combination of tools, you could use a cloud service that does part of the work for you, or other possible options.\n\nI will show you some of the main concepts you should probably keep in mind when deploying a FastAPI application (although most of it applies to any other type of web application).\n\nYou will see more details to keep in mind and some of the techniques to do it in the next sections. ✨"
    },
    {
        "link": "https://fastapi.tiangolo.com",
        "document": "FastAPI framework, high performance, easy to learn, fast to code, ready for production\n\nFastAPI is a modern, fast (high-performance), web framework for building APIs with Python based on standard Python type hints.\n• Fast: Very high performance, on par with NodeJS and Go (thanks to Starlette and Pydantic). One of the fastest Python frameworks available.\n• Fast to code: Increase the speed to develop features by about 200% to 300%. *\n• Easy: Designed to be easy to use and learn. Less time reading docs.\n• Standards-based: Based on (and fully compatible with) the open standards for APIs: OpenAPI (previously known as Swagger) and JSON Schema.\n\n* estimation based on tests on an internal development team, building production applications.\n\n\"[...] I'm using FastAPI a ton these days. [...] I'm actually planning to use it for all of my team's ML services at Microsoft. Some of them are getting integrated into the core Windows product and some Office products.\"\n\n\"We adopted the FastAPI library to spawn a REST server that can be queried to obtain predictions. [for Ludwig]\"\n\n\"Netflix is pleased to announce the open-source release of our crisis management orchestration framework: Dispatch! [built with FastAPI]\"\n\n\"I’m over the moon excited about FastAPI. It’s so fun!\"\n\n\"Honestly, what you've built looks super solid and polished. In many ways, it's what I wanted Hug to be - it's really inspiring to see someone build that.\"\n\n\"If you're looking to learn one modern framework for building REST APIs, check out FastAPI [...] It's fast, easy to use and easy to learn [...]\"\n\n\"We've switched over to FastAPI for our APIs [...] I think you'll like it [...]\"\n\n\"If anyone is looking to build a production Python API, I would highly recommend FastAPI. It is beautifully designed, simple to use and highly scalable, it has become a key component in our API first development strategy and is driving many automations and services such as our Virtual TAC Engineer.\"\n\nIf you are building a app to be used in the terminal instead of a web API, check out Typer.\n\nTyper is FastAPI's little sibling. And it's intended to be the FastAPI of CLIs. ⌨️ 🚀\n\nFastAPI stands on the shoulders of giants:\n\nCreate and activate a virtual environment and then install FastAPI:\n\nNote: Make sure you put in quotes to ensure it works in all terminals.\n\nYou will see the JSON response as:\n\nYou already created an API that:\n• Receives HTTP requests in the paths and .\n• Both paths take operations (also known as HTTP methods).\n• The path has a path parameter that should be an .\n• The path has an optional query parameter .\n\nNow go to http://127.0.0.1:8000/docs.\n\nYou will see the automatic interactive API documentation (provided by Swagger UI):\n\nAnd now, go to http://127.0.0.1:8000/redoc.\n\nYou will see the alternative automatic documentation (provided by ReDoc):\n\nNow modify the file to receive a body from a request.\n\nDeclare the body using standard Python types, thanks to Pydantic.\n\nNow go to http://127.0.0.1:8000/docs.\n• The interactive API documentation will be automatically updated, including the new body:\n• Click on the button \"Try it out\", it allows you to fill the parameters and directly interact with the API:\n• Then click on the \"Execute\" button, the user interface will communicate with your API, send the parameters, get the results and show them on the screen:\n\nAnd now, go to http://127.0.0.1:8000/redoc.\n• The alternative documentation will also reflect the new query parameter and body:\n\nIn summary, you declare once the types of parameters, body, etc. as function parameters.\n\nYou do that with standard modern Python types.\n\nYou don't have to learn a new syntax, the methods or classes of a specific library, etc.\n\nFor example, for an :\n\nor for a more complex model:\n\n...and with that single declaration you get:\n• Validation of data:\n• Automatic and clear errors when the data is invalid.\n• of input data: coming from the network to Python data and types. Reading from:\n• of output data: converting from Python data and types to network data (as JSON):\n• ...and many more.\n\nComing back to the previous code example, FastAPI will:\n• Validate that there is an in the path for and requests.\n• Validate that the is of type for and requests.\n• If it is not, the client will see a useful, clear error.\n• Check if there is an optional query parameter named (as in ) for requests.\n• As the parameter is declared with , it is optional.\n• Without the it would be required (as is the body in the case with ).\n• For requests to , read the body as JSON:\n• Check that it has a required attribute that should be a .\n• Check that it has a required attribute that has to be a .\n• Check that it has an optional attribute , that should be a , if present.\n• All this would also work for deeply nested JSON objects.\n• Convert from and to JSON automatically.\n• Document everything with OpenAPI, that can be used by:\n\nWe just scratched the surface, but you already get the idea of how it all works.\n\nTry changing the line with:\n\n...and see how your editor will auto-complete the attributes and know their types:\n\nFor a more complete example including more features, see the Tutorial - User Guide.\n• Declaration of parameters from other different places as: headers, cookies, form fields and files.\n• How to set validation constraints as or .\n• A very powerful and easy to use system.\n• Security and authentication, including support for OAuth2 with JWT tokens and HTTP Basic auth.\n• More advanced (but equally easy) techniques for declaring deeply nested JSON models (thanks to Pydantic).\n• GraphQL integration with Strawberry and other libraries.\n• Many extra features (thanks to Starlette) as:\n\nIndependent TechEmpower benchmarks show FastAPI applications running under Uvicorn as one of the fastest Python frameworks available, only below Starlette and Uvicorn themselves (used internally by FastAPI). (*)\n\nTo understand more about it, see the section Benchmarks.\n\nWhen you install FastAPI with it comes with the group of optional dependencies:\n• - Required if you want to use the .\n• - Required if you want to use the default template configuration.\n• - Required if you want to support form , with .\n• - for the server that loads and serves your application. This includes , which includes some dependencies (e.g. ) needed for high performance serving.\n\nIf you don't want to include the optional dependencies, you can install with instead of .\n\nThere are some additional dependencies you might want to install.\n• - for extra types to be used with Pydantic.\n• - Required if you want to use .\n• - Required if you want to use .\n\nThis project is licensed under the terms of the MIT license."
    },
    {
        "link": "https://fastapi.tiangolo.com/tutorial/first-steps",
        "document": "The simplest FastAPI file could look like this:\n\nIn the output, there's a line with something like:\n\nThat line shows the URL where your app is being served, in your local machine.\n\nYou will see the JSON response as:\n\nNow go to http://127.0.0.1:8000/docs.\n\nYou will see the automatic interactive API documentation (provided by Swagger UI):\n\nAnd now, go to http://127.0.0.1:8000/redoc.\n\nYou will see the alternative automatic documentation (provided by ReDoc):\n\nFastAPI generates a \"schema\" with all your API using the OpenAPI standard for defining APIs.\n\nA \"schema\" is a definition or description of something. Not the code that implements it, but just an abstract description.\n\nIn this case, OpenAPI is a specification that dictates how to define a schema of your API.\n\nThis schema definition includes your API paths, the possible parameters they take, etc.\n\nThe term \"schema\" might also refer to the shape of some data, like a JSON content.\n\nIn that case, it would mean the JSON attributes, and data types they have, etc.\n\nOpenAPI defines an API schema for your API. And that schema includes definitions (or \"schemas\") of the data sent and received by your API using JSON Schema, the standard for JSON data schemas.\n\nIf you are curious about how the raw OpenAPI schema looks like, FastAPI automatically generates a JSON (schema) with the descriptions of all your API.\n\nYou can see it directly at: http://127.0.0.1:8000/openapi.json.\n\nIt will show a JSON starting with something like:\n\nThe OpenAPI schema is what powers the two interactive documentation systems included.\n\nAnd there are dozens of alternatives, all based on OpenAPI. You could easily add any of those alternatives to your application built with FastAPI.\n\nYou could also use it to generate code automatically, for clients that communicate with your API. For example, frontend, mobile or IoT applications.\n\nis a Python class that provides all the functionality for your API.\n\nHere the variable will be an \"instance\" of the class .\n\nThis will be the main point of interaction to create all your API.\n\n\"Path\" here refers to the last part of the URL starting from the first .\n\nSo, in a URL like:\n\n...the path would be:\n\nWhile building an API, the \"path\" is the main way to separate \"concerns\" and \"resources\".\n\n\"Operation\" here refers to one of the HTTP \"methods\".\n\n...and the more exotic ones:\n\nIn the HTTP protocol, you can communicate to each path using one (or more) of these \"methods\".\n\nWhen building APIs, you normally use these specific HTTP methods to perform a specific action.\n\nNormally you use:\n\nSo, in OpenAPI, each of the HTTP methods is called an \"operation\".\n\nWe are going to call them \"operations\" too.\n\nThe tells FastAPI that the function right below is in charge of handling requests that go to:\n\nYou can also use the other operations:\n\nAnd the more exotic ones:\n\nThis is our \"path operation function\":\n• function: is the function below the \"decorator\" (below ).\n\nIt will be called by FastAPI whenever it receives a request to the URL \" \" using a operation.\n\nIn this case, it is an function.\n\nYou could also define it as a normal function instead of :\n\nYou can return a , , singular values as , , etc.\n\nYou can also return Pydantic models (you'll see more about that later).\n\nThere are many other objects and models that will be automatically converted to JSON (including ORMs, etc). Try using your favorite ones, it's highly probable that they are already supported.\n• Run the development server using the command ."
    },
    {
        "link": "https://medium.com/@ramanbazhanau/preparing-fastapi-for-production-a-comprehensive-guide-d167e693aa2b",
        "document": "\n• What We’ll Cover in This Guide\n• Best Practices for Running FastAPI in Production\n• Benefits of Using Docker with FastAPI\n• Best Practices for Docker in Production\n\nFastAPI has quickly become one of the most popular Python web frameworks for building APIs. Its combination of speed, simplicity, and powerful features makes it an excellent choice for developers looking to create robust and efficient web applications. However, moving from development to production requires careful consideration and proper configuration to ensure your FastAPI application performs optimally and securely in a real-world environment.\n\nIn this comprehensive guide, we’ll explore the essential steps and best practices for preparing your FastAPI application for production deployment. Whether you’re a seasoned developer or just getting started with FastAPI, this article will provide you with valuable insights and practical advice to help you confidently deploy your application.\n\nFastAPI is a modern, fast (high-performance) web framework for building APIs with Python 3.6+ based on standard Python type hints. It’s designed to be easy to use, fast to code, ready for production, and suitable for building robust and scalable applications. Key features of FastAPI include:\n• Fast execution: FastAPI is one of the fastest Python frameworks available, thanks to its use of Starlette and Pydantic.\n• Easy to use: With intuitive syntax and excellent documentation, FastAPI has a gentle learning curve.\n• Built-in validation: FastAPI uses Pydantic for data validation, serialization, and documentation.\n• Python type hints: FastAPI leverages Python’s type hinting system for better code quality and IDE support.\n\nWhile FastAPI makes it easy to create APIs quickly, deploying an application to production requires additional considerations. A production environment faces real-world challenges such as high traffic, potential security threats, and the need for scalability and reliability. Proper production deployment ensures that your FastAPI application:\n• Provides a stable and reliable service to users\n• Can be easily monitored and maintained\n\nWhat We’ll Cover in This Guide\n\nIn this comprehensive guide, we’ll walk through the essential aspects of preparing your FastAPI application for production deployment. We’ll cover:\n\nBy the end of this guide, you’ll have a solid understanding of what it takes to deploy a FastAPI application in a production environment, along with practical examples and best practices to follow.\n\nWhen moving your FastAPI application from development to production, proper configuration is crucial. This section will explore the key differences between development and production configurations, and provide practical advice on setting up your FastAPI app for a production environment.\n\nIn development, you typically prioritize convenience and debugging capabilities. However, in production, the focus shifts to security, performance, and reliability. Here are some key differences:\n• Performance optimizations: Often bypassed in development, crucial in production.\n• Security features: Might be relaxed in development, must be strictly enforced in production.\n\nEnvironment variables are a crucial tool for managing configuration in production environments. They allow you to:\n• Keep sensitive information out of your codebase\n• Use different settings for different environments (dev, staging, production)\n\nHere’s an example of how to use environment variables in your FastAPI application:\n\nIn this example, we use to create a class that loads configuration from environment variables. The line allows loading variables from a file, which is useful for development but should be avoided in production (use actual environment variables instead).\n• Use a configuration management tool: Tools like Ansible, Puppet, or Chef can help manage configurations across multiple environments.\n• Implement a secrets management system: Use tools like HashiCorp Vault or AWS Secrets Manager to securely store and manage sensitive information.\n• Use different configurations for different environments: Maintain separate configuration files or environment variable sets for development, staging, and production.\n• Version your configurations: Keep your configuration files in version control, but ensure that sensitive data is not included.\n• Use a centralized configuration service: For complex, distributed systems, consider using tools like etcd or Consul for centralized configuration management.\n\nHere’s a more comprehensive example of a production-ready FastAPI configuration:\n• Caching of settings with for performance\n\nTo visualize the flow of configuration in a FastAPI application, here’s a diagram:\n\nThis setup provides a solid foundation for a production-ready FastAPI application, balancing security, performance, and flexibility.\n\nWhen it comes to running FastAPI in a production environment, choosing the right ASGI (Asynchronous Server Gateway Interface) server is crucial. In this section, we’ll explore different ASGI servers, their pros and cons, and how to run FastAPI with each of them.\n\nFastAPI, being an ASGI framework, requires an ASGI server to run. The most common options are:\n\nLet’s examine each of these options in detail.\n\nUvicorn is a lightning-fast ASGI server implementation, using uvloop and httptools for optimal performance.\n• Easy to use and configure\n• Doesn’t support HTTP/2 out of the box\n• refers to the object in your file\n\nHypercorn is another ASGI server that supports HTTP/1, HTTP/2, and WebSockets.\n• Slightly more complex to set up\n• May be slower than Uvicorn for HTTP/1.1\n\nGunicorn is a robust, production-ready server that can use Uvicorn workers to run FastAPI applications.\n\nTo run FastAPI with Gunicorn and Uvicorn workers:\n\nFor long-running production deployments, you’ll want to ensure your FastAPI application runs continuously and starts automatically if the server reboots.\n\n1. Using Systemd\n\nOn many Linux systems, you can use systemd to manage your FastAPI application as a service. Here’s an example systemd service file:\n\nSave this file as , then enable and start the service:\n\n2. Using Supervisor\n\nSupervisor is another popular tool for process management. Here’s an example configuration:\n\nSave this as , then update and start the service:\n\nBest Practices for Running FastAPI in Production\n• Use multiple workers: The number of workers should generally be 2–4 times the number of CPU cores.\n• Implement proper logging: Configure your ASGI server to log to appropriate files.\n• Use a reverse proxy: Place Nginx or Apache in front of your FastAPI application for additional features and security.\n• Monitor your application: Use tools like Prometheus and Grafana to keep track of your application’s health and performance.\n• Implement graceful shutdowns: Configure your server to handle shutdowns gracefully to prevent request interruptions.\n\nThis diagram will help visualize how all the components we’ve discussed fit together in a production environment.\n\nWhen deploying a FastAPI application to production, security should be a top priority. This section will cover essential security measures to protect your application and its users.\n\nImplementing HTTPS is crucial for encrypting data in transit and ensuring the integrity of your API.\n• Use a service like Let’s Encrypt for free certificates\n\nImplementing proper authentication and authorization is essential for protecting your API endpoints.\n\n1. JWT Authentication\n\nJSON Web Tokens (JWT) are a popular choice for API authentication. Here’s a basic example of implementing JWT authentication in FastAPI:\n\n2. CORS (Cross-Origin Resource Sharing) Setup\n\nCORS is a security mechanism that allows or restricts resources on a web page to be requested from another domain outside the domain from which the resource originated.\n\n3. Rate Limiting\n\nImplementing rate limiting helps protect your API from abuse and ensures fair usage. Here’s an example using the library:\n• Regularly update your FastAPI and other dependencies\n• Use tools like to check for known vulnerabilities\n• Use Pydantic models to define and validate request bodies\n• Use a firewall to restrict access to your server\n\nThis diagram will help visualize the multiple layers of security that protect a FastAPI application in production.\n\nOptimizing your FastAPI application for performance is crucial for handling high traffic and providing a smooth user experience. In this section, we’ll explore various techniques to enhance the performance of your FastAPI application in production.\n\nFastAPI is built on top of Starlette and leverages Python’s async capabilities. Proper use of async and await can significantly improve your application’s performance, especially for I/O-bound operations.\n\nImplementing connection pooling can significantly reduce the overhead of creating new database connections for each request.\n\nExample using SQLAlchemy with asyncpg:\n\n2. Redis Caching\n\nFor distributed systems, Redis is an excellent choice for caching:\n\nFastAPI uses Pydantic for request validation and response serialization. While this provides great benefits, it can be optimized for better performance.\n\n1. Use class in Pydantic models to optimize:\n\n2. Use parameter in route decorators to pre-compute response schemas:\n\n1. Use UvLoop: UvLoop is a fast, drop-in replacement for the asyncio event loop.\n• Log at appropriate levels to avoid unnecessary I/O\n\nThis diagram will help visualize how different performance optimization techniques work together in a FastAPI application to handle requests efficiently.\n\nProper logging and monitoring are crucial for maintaining and troubleshooting FastAPI applications in production. They help you understand your application’s behavior, identify issues quickly, and make data-driven decisions for improvements.\n\nFastAPI uses Python’s built-in logging module. Here’s how to set up logging effectively:\n\n2. Use structured logging for better parsing:\n\nTo prevent log files from growing too large and to manage them effectively:\n\n1. Use a tool like on Linux systems:\n• Set up Grafana to connect to your Prometheus data source\n• Use Filebeat to ship logs to Elasticsearch\n• Use Kibana to visualize and analyze logs\n• Request rate: Number of requests per second\n\nHere’s an example of how to track custom metrics using Prometheus:\n\nHealth checks are crucial for monitoring the status of your application:\n\nSet up alerting based on your metrics and logs:\n• Set up log-based alerts using tools like Elastic Stack’s Watcher\n\nThis diagram will help visualize the comprehensive logging and monitoring setup for a FastAPI application in production, showing how different components work together to provide insights and maintain system health.\n\nContainerizing your FastAPI application with Docker provides consistency across different environments, simplifies deployment, and enhances scalability. This section will guide you through the process of containerizing your FastAPI app and best practices for production use.\n\nBenefits of Using Docker with FastAPI\n• Consistency: Ensures the same environment across development, testing, and production.\n• Isolation: Keeps your application and its dependencies separate from the host system.\n• Portability: Easily move your application between different hosts or cloud providers.\n• Scalability: Simplifies the process of scaling your application horizontally.\n• Version Control: Allows versioning of your entire application environment.\n\nTo build and run your Docker container:\n\nFor applications that require multiple services (e.g., FastAPI, database, Redis), use Docker Compose:\n\nBest Practices for Docker in Production\n\n1. Use specific version tags for base images:\n\nInstead of , use\n\n2. Minimize the number of layers:\n\nCombine RUN commands to reduce the number of layers in your image.\n\n7. Use .dockerignore file:\n\nCreate a file to exclude unnecessary files from your Docker context:\n\n8. Implement proper logging:\n\nConfigure your application to log to stdout/stderr, which Docker can then capture.\n\n9. Use Docker secrets for sensitive information:\n\nInstead of hardcoding sensitive information in your Dockerfile or docker-compose.yml, use Docker secrets.\n\n10. Regularly update base images and dependencies:\n\nKeep your base images and Python dependencies up to date to ensure you have the latest security patches.\n\n1. Use Alpine-based images for even smaller footprints:\n\nThen in your FastAPI app:\n\nThis diagram will help visualize the containerization process and how different components interact in a Dockerized FastAPI application setup.\n\nDeploying a FastAPI application to production requires careful planning and execution. This section will explore various deployment options, CI/CD pipelines, and strategies to ensure smooth and reliable deployments.\n\nDeploying to a VPS gives you full control over the server environment.Steps:\n• Set up a VPS with a provider like DigitalOcean, Linode, or AWS EC2.\n• Transfer your application code (via Git or SCP).\n• Set up a reverse proxy (Nginx or Apache) to handle incoming requests.\n• Run your FastAPI application using a process manager like Supervisor or systemd.\n\nPaaS options like Heroku or Google App Engine can simplify deployment.Deploying to Heroku:\n\nServerless deployment can be achieved using services like AWS Lambda with API Gateway.Using AWS Lambda:\n• Use a framework like Zappa or Mangum to adapt FastAPI for serverless.\n• Configure API Gateway to route requests to your Lambda function.\n\nBlue-green deployment is a technique that reduces downtime and risk by running two identical production environments called Blue and Green.Steps:\n• Set up two identical environments (Blue and Green).\n• Route all traffic to the Blue environment.\n• Deploy new version to the Green environment.\n\nExample using Nginx for traffic routing:\n\nTo switch to Green, update the Nginx configuration and reload:\n\nRolling updates involve gradually replacing instances of the old version with the new version.Steps:\n• Deploy new version alongside the old version.\n• Gradually shift traffic to the new version.\n• If successful, complete the rollout; if not, rollback.\n\nCreating deployment scripts can automate and standardize the deployment process.\n\nThis diagram will help visualize the complex process of deploying a FastAPI application to production, including various strategies and safety mechanisms.\n\nAs your FastAPI application grows in popularity, you’ll need to implement scaling strategies to handle increased traffic and maintain performance. This section will explore various methods to scale your FastAPI application effectively.\n\nBefore diving into specific strategies, it’s important to understand the two main types of scaling:\n• Vertical Scaling (Scaling Up): Increasing the resources (CPU, RAM) of existing servers.\n• Horizontal Scaling (Scaling Out): Adding more servers to distribute the load.\n\nFastAPI, being built on asynchronous principles, is well-suited for horizontal scaling, which we’ll focus on in this section.\n\nLoad balancing is crucial for distributing incoming requests across multiple instances of your FastAPI application.\n\nHere’s an example Nginx configuration for load balancing:\n\nAs your application scales, your database can become a bottleneck. Here are some strategies to scale your database:\n• Read Replicas: Create read-only copies of your database to offload read operations.\n\nExample of connection pooling with SQLAlchemy:\n\nImplementing caching can significantly reduce the load on your application and database.\n\nFor long-running tasks, use asynchronous task queues to offload work from the main application.\n\nServerless platforms like AWS Lambda can automatically scale your application based on incoming requests.\n\nExample using Mangum to adapt FastAPI for AWS Lambda:\n\nDeploy this to AWS Lambda and configure API Gateway to route requests to your function.\n\nImplement monitoring and auto-scaling to automatically adjust resources based on traffic.\n• Create an Amazon EC2 Auto Scaling group for your FastAPI instances.\n• Set up CloudWatch alarms to monitor metrics like CPU utilization or request count.\n• Configure Auto Scaling policies to add or remove instances based on these alarms.\n\nUtilize a CDN to cache and serve static content from locations closer to users.\n\nExample using Cloudflare with FastAPI:\n• Sign up for a Cloudflare account and add your domain.\n• Auto Scaling Group: Adjusts the number of FastAPI instances based on demand.\n\nThe flow shows how requests move from clients through the CDN and load balancer to the FastAPI instances, and how the auto-scaling group and monitoring system work together to adjust resources.\n\nThis diagram shows how FastAPI instances interact with various data storage systems (cache, main database, read replicas) and how asynchronous tasks are processed using a queue and worker nodes. It also illustrates the option of using serverless functions for specific tasks.\n\nAs we conclude this comprehensive guide on preparing FastAPI for production, let’s summarize the key points and provide a set of best practices to ensure your FastAPI application is production-ready, performant, and scalable.\n• Configuration Management: Properly configure your FastAPI application for different environments using environment variables and configuration management tools.\n• ASGI Servers: Choose the right ASGI server (Uvicorn, Hypercorn, or Gunicorn with Uvicorn workers) based on your specific needs.\n• Performance Optimization: Utilize FastAPI’s async capabilities, implement caching, and optimize database queries for better performance.\n• Logging and Monitoring: Set up comprehensive logging and monitoring to gain insights into your application’s behavior and quickly identify issues.\n• Containerization: Use Docker to containerize your FastAPI application for consistency across environments and easier deployment.\n• Deployment Strategies: Implement CI/CD pipelines and use deployment strategies like blue-green deployments or rolling updates to minimize downtime.\n• Scaling: Prepare your application for scaling by implementing load balancing, database scaling strategies, and considering serverless options.\n\nTo ensure your FastAPI application is production-ready, follow this checklist:\n• Use asynchronous programming where appropriate\n• Use database migrations for schema changes\n• Set up automated backups for your database\n• Design your application to be stateless\n• Use caching services like Redis to reduce database load\n• Consider using a CDN for static assets\n• Set up alerts for critical errors and performance issues\n• Use structured logging for easier parsing and analysis\n• Use infrastructure as code (IaC) for managing your infrastructure\n\nPreparing a FastAPI application for production is a multifaceted process that requires attention to various aspects of software development and operations. By following the practices and strategies outlined in this guide, you can create a robust, scalable, and maintainable FastAPI application that performs well under real-world conditions.\n\nRemember that production readiness is an ongoing process. Continuously monitor your application, stay updated with the latest best practices and security recommendations, and be prepared to adapt your infrastructure and codebase as your application grows and evolves.\n\nLastly, leverage the FastAPI community and ecosystem. Stay engaged with the community forums, contribute to open-source projects, and don’t hesitate to seek help when faced with challenges. The collective knowledge and experience of the community can be an invaluable resource as you navigate the complexities of running FastAPI in production."
    },
    {
        "link": "https://fastapi.tiangolo.com/tutorial/metadata",
        "document": "You can customize several metadata configurations in your FastAPI application.\n\nYou can set the following fields that are used in the OpenAPI specification and the automatic API docs UIs:\n\nYou can set them as follows:\n\nWith this configuration, the automatic API docs would look like:\n\nSince OpenAPI 3.1.0 and FastAPI 0.99.0, you can also set the with an instead of a .\n\nYou can also add additional metadata for the different tags used to group your path operations with the parameter .\n\nIt takes a list containing one dictionary for each tag.\n\nEach dictionary can contain:\n• (required): a with the same tag name you use in the parameter in your path operations and s.\n• : a with a short description for the tag. It can have Markdown and will be shown in the docs UI.\n• : a describing external documentation with:\n• : a with a short description for the external docs.\n• (required): a with the URL for the external documentation.\n\nLet's try that in an example with tags for and .\n\nCreate metadata for your tags and pass it to the parameter:\n\nNotice that you can use Markdown inside of the descriptions, for example \"login\" will be shown in bold (login) and \"fancy\" will be shown in italics (fancy).\n\nUse the parameter with your path operations (and s) to assign them to different tags:\n\nNow, if you check the docs, they will show all the additional metadata:\n\nThe order of each tag metadata dictionary also defines the order shown in the docs UI.\n\nFor example, even though would go after in alphabetical order, it is shown before them, because we added their metadata as the first dictionary in the list.\n\nBy default, the OpenAPI schema is served at .\n\nBut you can configure it with the parameter .\n\nFor example, to set it to be served at :\n\nIf you want to disable the OpenAPI schema completely you can set , that will also disable the documentation user interfaces that use it.\n\nYou can configure the two documentation user interfaces included:\n• Swagger UI: served at .\n• You can set its URL with the parameter .\n• You can disable it by setting .\n• ReDoc: served at .\n• You can set its URL with the parameter .\n• You can disable it by setting .\n\nFor example, to set Swagger UI to be served at and disable ReDoc:"
    },
    {
        "link": "https://medium.com/cloud-native-daily/path-based-routing-with-nginx-reverse-proxy-for-multiple-applications-in-a-vm-53838169540c",
        "document": "Path-Based Routing with Nginx Reverse Proxy for Multiple Applications in a VM\n\nWhen hosting multiple applications within a virtual machine (VM), efficiently routing incoming requests to the appropriate application based on the requested path becomes essential. Nginx, a powerful web server and reverse proxy, allows us to achieve this with path-based routing. In this blog, we will explore how to use Nginx as a reverse proxy to route requests to different applications running inside a VM on different ports.\n\nBefore getting started, ensure that you have the following:\n• Multiple applications running on different ports within the VM.\n\nTo enable path-based routing with Nginx, we need to configure Nginx to listen on a specific port and forward requests to the corresponding application based on the requested path.\n\nOpen the Nginx configuration directory( ) and run the following command to create new files.\n\nThis will create a new file where our nginx configuration will be added. Note: You may need to add sudo if you get a permission denied error for the commands\n\nAdd the following configuration Blocks inside the app1.example.com by running and paste the following configuration.\n\nIn the above example, we configure two blocks to handle different paths ( and ) and forward the requests to the corresponding applications running on different ports ( and ).\n\nBefore proceeding, ensure that the Nginx configuration is valid. Run the following command:\n\nIf the configuration is valid, restart or reload the Nginx service to apply the changes:\n\nStep 3: Update DNS (if not configured to IP ADDRESS)\n\nTo test the implementation, update your DNS records from your DNS providers(ex. GoDaddy, CloudFlare etc.) to add a A record for the domains to map to the server IP address.\n\nNow you can access the applications through Nginx using the configured paths:\n\nEnsure that the applications are running on the specified ports within the VM.\n\nYou can also use NGINX reverse proxy for domain/sub-domain based routing.\n\nConclusion: In this blog post, we have explored how to use Nginx as a reverse proxy to achieve path-based routing for multiple applications running inside a VM on different ports. By configuring Nginx to listen on a specific port and forwarding requests to the corresponding applications based on the requested path, we can efficiently route traffic to the appropriate destinations.\n\nRemember to adapt the configuration to match your specific applications and paths. Nginx’s reverse proxy capabilities provide a flexible and powerful solution for managing multiple applications and enhancing overall performance within a VM."
    },
    {
        "link": "https://stackoverflow.com/questions/68196179/how-to-create-reverse-proxy-for-multiple-websites-in-nginx",
        "document": "I have many different technologies serving APIs and sites on my local machine. I want to be able to see them via human-readable names, rather than ports.\n\nFor example, I have:\n\nAnd this list goes on.\n\nRemembering all these ports is not possible of course. Thus I thought to setup a reverse proxy for them:\n\nI know I have to add these host headers to file. I also read about how to configure nginx as a reverse proxy for one domain.\n\nI don't know how to do it for many sites. And only as a reverse proxy, not as a server."
    },
    {
        "link": "https://docs.nginx.com/nginx/admin-guide/web-server/reverse-proxy",
        "document": "This article describes the basic configuration of a proxy server. You will learn how to pass a request from NGINX to proxied servers over different protocols, modify client request headers that are sent to the proxied server, and configure buffering of responses coming from the proxied servers.\n\nProxying is typically used to distribute the load among several servers, seamlessly show content from different websites, or pass requests for processing to application servers over protocols other than HTTP.\n\nWhen NGINX proxies a request, it sends the request to a specified proxied server, fetches the response, and sends it back to the client. It is possible to proxy requests to an HTTP server (another NGINX server or any other server) or a non-HTTP server (which can run an application developed with a specific framework, such as PHP or Python) using a specified protocol. Supported protocols include FastCGI, uwsgi, SCGI, and memcached.\n\nTo pass a request to an HTTP proxied server, the proxy_pass directive is specified inside a location. For example:\n\nThis example configuration results in passing all requests processed in this location to the proxied server at the specified address. This address can be specified as a domain name or an IP address. The address may also include a port:\n\nNote that in the first example above, the address of the proxied server is followed by a URI, . If the URI is specified along with the address, it replaces the part of the request URI that matches the location parameter. For example, here the request with the URI will be proxied to . If the address is specified without a URI, or it is not possible to determine the part of URI to be replaced, the full request URI is passed (possibly, modified).\n\nTo pass a request to a non-HTTP proxied server, the appropriate directive should be used:\n\nNote that in these cases, the rules for specifying addresses may be different. You may also need to pass additional parameters to the server (see the reference documentation for more detail).\n\nThe proxy_pass directive can also point to a named group of servers. In this case, requests are distributed among the servers in the group according to the specified method.\n\nBy default, NGINX redefines two header fields in proxied requests, “Host” and “Connection”, and eliminates the header fields whose values are empty strings. “Host” is set to the variable, and “Connection” is set to .\n\nTo change these setting, as well as modify other header fields, use the proxy_set_header directive. This directive can be specified in a location or higher. It can also be specified in a particular server context or in the http block. For example:\n\nIn this configuration the “Host” field is set to the $host variable.\n\nTo prevent a header field from being passed to the proxied server, set it to an empty string as follows:\n\nBy default NGINX buffers responses from proxied servers. A response is stored in the internal buffers and is not sent to the client until the whole response is received. Buffering helps to optimize performance with slow clients, which can waste proxied server time if the response is passed from NGINX to the client synchronously. However, when buffering is enabled NGINX allows the proxied server to process responses quickly, while NGINX stores the responses for as much time as the clients need to download them.\n\nThe directive that is responsible for enabling and disabling buffering is proxy_buffering. By default it is set to and buffering is enabled.\n\nThe proxy_buffers directive controls the size and the number of buffers allocated for a request. The first part of the response from a proxied server is stored in a separate buffer, the size of which is set with the proxy_buffer_size directive. This part usually contains a comparatively small response header and can be made smaller than the buffers for the rest of the response.\n\nIn the following example, the default number of buffers is increased and the size of the buffer for the first portion of the response is made smaller than the default.\n\nIf buffering is disabled, the response is sent to the client synchronously while it is receiving it from the proxied server. This behavior may be desirable for fast interactive clients that need to start receiving the response as soon as possible.\n\nTo disable buffering in a specific location, place the proxy_buffering directive in the location with the parameter, as follows:\n\nIn this case NGINX uses only the buffer configured by proxy_buffer_size to store the current part of a response.\n\nA common use of a reverse proxy is to provide load balancing. Learn how to improve power, performance, and focus on your apps with rapid deployment in the free Five Reasons to Choose a Software Load Balancer ebook.\n\nIf your proxy server has several network interfaces, sometimes you might need to choose a particular source IP address for connecting to a proxied server or an upstream. This may be useful if a proxied server behind NGINX is configured to accept connections from particular IP networks or IP address ranges.\n\nSpecify the proxy_bind directive and the IP address of the necessary network interface:\n\nThe IP address can be also specified with a variable. For example, the variable passes the IP address of the network interface that accepted the request:"
    },
    {
        "link": "https://medium.ktechhub.com/setting-up-an-api-gateway-using-nginx-to-route-traffic-to-multiple-microservices-f926e7ba5ce0",
        "document": "​When working with microservices, having a centralized API gateway is crucial for efficient routing, load balancing, security, and monitoring. In this guide, we will explore how to set up an NGINX-based API gateway to route requests from to specific services like , , , and . We’ll cover every step in detail, including SSL setup with Let’s Encrypt, path-based routing, and advanced optimizations.\n\nWhen building a distributed architecture, microservices are often deployed on separate domains or endpoints. Without a centralized API gateway, clients would need to know each service’s endpoint, which can lead to complex configurations and security issues. An API gateway solves these problems by acting as a reverse proxy that handles the following:\n• Routing: Redirect requests based on path or domain to the correct service."
    },
    {
        "link": "https://stackoverflow.com/questions/37820013/nginx-routing-to-several-restful-endpoints",
        "document": "I would like to use Nginx as the HTTP proxy server.\n\nOn the backend, we have 3 different applications written in Java exposing a RESTful API each. Every application has their own prefix on the API.\n\nOn the frontend, we have a SPA page making requests to those URI's.\n\nIs there a way to tell Nginx to route the HTTP request depending on the URI prefix?"
    },
    {
        "link": "https://docs.konghq.com/gateway/latest/get-started/services-and-routes",
        "document": "Kong Gateway administrators work with an object model to define their desired traffic management policies. Two important objects in that model are services and routes. Services and routes are configured in a coordinated manner to define the routing path that requests and responses will take through the system.\n\nThe high level overview below shows requests arriving at routes and being forwarded to services, with responses taking the opposite pathway:\n\nIn Kong Gateway, a service is an abstraction of an existing upstream application. Services can store collections of objects like plugin configurations, and policies, and they can be associated with routes.\n\nWhen defining a service, the administrator provides a name and the upstream application connection information. The connection details can be provided in the field as a single string, or by providing individual values for , , , and individually.\n\nServices have a one-to-many relationship with upstream applications, which allows administrators to create sophisticated traffic management behaviors.\n\nA route is a path to a resource within an upstream application. Routes are added to services to allow access to the underlying application. In Kong Gateway, routes typically map to endpoints that are exposed through the Kong Gateway application. Routes can also define rules that match requests to associated services. Because of this, one route can reference multiple endpoints. A basic route should have a name, path or paths, and reference an existing service.\n\nYou can also configure routes with:\n• Protocols: The protocol used to communicate with the upstream application.\n• Headers: Lists of values that are expected in the header of a request\n• Tags: Optional set of strings to group routes with\n\nSee Routes for a description of how Kong Gateway routes requests.\n\nThe following tutorial walks through managing and testing services and routes using the Kong Gateway Admin API. Kong Gateway also offers other options for configuration management including Kong Konnect and decK.\n\nIn this section of the tutorial, you will complete the following steps:\n• Create a service pointing to the httpbin API, which provides testing facilities for HTTP requests and responses.\n• Define a route by providing a URL path that will be available to clients on the running Kong Gateway.\n• Use the new httpbin service to echo a test request, helping you understand how Kong Gateway proxies API requests.\n\nThis chapter is part of the Get Started with Kong series. For the best experience, it is recommended that you follow the series from the beginning.\n\nThe introduction, Get Kong, includes tool prerequisites and instructions for running a local Kong Gateway.\n\nIf you haven’t completed the Get Kong step already, complete that before proceeding.\n• To add a new service, send a request to Kong Gateway’s Admin API route: This request instructs Kong Gateway to create a new service mapped to the upstream URL . In our example, the request body contained two strings:\n• : The name of the service\n• : An argument that populates the , , and attributes of the service If your request was successful, you will see a response header from Kong Gateway confirming that your service was created and the response body will be similar to: Fields that are not explicitly provided in the create request are automatically given a default value based on the current Kong Gateway configuration.\n• When you create a service, Kong Gateway assigns it a unique as shown in the response above. The field, or the name provided when creating the service, can be used to identify the service in subsequent requests. This is the service URL and takes the form of . To view the current state of a service, make a request to the service URL. A successful request will contain the current configuration of your service in the response body and will look something like the following snippet:\n• Existing service configurations can be updated dynamically by sending a request to the service URL. To dynamically set the service retries from to , send this request: The response body contains the full service configuration including the updated value:\n• You can list all current services by sending a request to the base URL.\n\nThe Admin API documentation provides the full service update specification.\n\nYou can also view the configuration for your services in the Kong Manager UI by navigating to the following URL in your browser:\n• Kong Manager Enterprise: http://localhost:8002/default/services, where is the workspace name.\n• Routes define how requests are proxied by Kong Gateway. You can create a route associated with a specific service by sending a request to the service URL. Configure a new route on the path to direct traffic to the service created earlier: If the route was successfully created, the API returns a response code and a response body like this:\n• Like services, when you create a route, Kong Gateway assigns it a unique as shown in the response above. The field, or the name provided when creating the route, can be used to identify the route in subsequent requests. The route URL can take either of the following forms:\n• None /services/{service name or id}/routes/{route name or id} To view the current state of the route, make a request to the route URL: The response body contains the current configuration of your route:\n• Like services, routes can be updated dynamically by sending a request to the route URL. Tags are an optional set of strings that can be associated with the route for grouping and filtering. You can assign tags by sending a request to the services endpoint and specifying a route. Update the route by assigning it a tag with the value : The above example used the service and route fields for the route URL. If the tag was successfully applied, the response body will contain the following JSON value:\n• The Admin API also supports the listing of all routes currently configured: This request returns an HTTP status code and a JSON response body object array with all of the routes configured on this Kong Gateway instance. Your response should look like the following:\n\nThe Admin API documentation has the full specification for managing route objects.\n\nYou can also view the configuration for your routes in the Kong Manager UI by navigating to the following URL in your browser: http://localhost:8002/default/routes\n\nKong is an API Gateway, it takes requests from clients and routes them to the appropriate upstream application based on a the current configuration. Using the service and route that was previously configured, you can now access using .\n\nBy default, Kong Gateway’s Admin API listens for administrative requests on port , this is sometimes referred to as the control plane. Clients use port to make data requests, and this is often referred to as the data plane.\n\nHttpbin provides an resource which will echo back to clients information about requests made to it. Proxy a request through Kong Gateway to the resource:\n\nYou should see a response similar to the following:"
    },
    {
        "link": "https://apipark.com/techblog/en/how-to-optimize-your-microservices-with-kong-api-gateway-a-step-by-step-guide-2",
        "document": ""
    },
    {
        "link": "https://konghq.com/blog/learning-center/why-microservices-need-api-gateway",
        "document": "Why Do Microservices Need an API Gateway?\n\nHow an API gateway and Microservices Work Together An API gateway acts as a reverse proxy, sitting between client applications and the backend microservices. It provides a single entry point and hides the complexities of services in the backend. The gateway handles routing requests to the appropriate services, aggregating data from multiple services, and applying policies consistently across all microservices.\n• Routing - Forwards requests to the appropriate microservice based on URL, content, business rules By handling these cross-cutting concerns, an API gateway simplifies building individual microservices to focus on core business capabilities.\n\nThe decentralized nature of microservices means there are many more moving parts to manage. Instead of a single application, development teams must now track dozens or hundreds of separate microservices. This explosion of services exponentially increases the complexity of dependencies, networking, deployment topologies, data flows, and failure domains to model and optimize. Additionally, microservices teams tend to have higher degrees of organizational independence and move at different paces. However, their output still needs to harmonize collectively for a smooth end-user experience. Without careful coordination, poor visibility between teams can quickly lead to conflicts, technical debt, and solution sprawl. API gateways create a structural paradigm to tame this complexity. They provide standardization and governance across all microservices regardless of the implementation technology. Gateways handle cross-cutting capabilities that would otherwise need duplication across services, such as security, traffic controls, and failure handling strategies. Instead of this logic existing in a fragmented way, gateways centralize it consistently.\n\nClient applications can no longer rely on a single hostname or IP address to access essential application services. Microservices may deploy to ephemeral containers or serverless functions spread across multiple internal networks and cloud providers. However, callers should not have to lookup locations for each backend service through complex service discovery mechanisms. API gateways solve this problem by providing a unified domain name to consolidate access to all internal microservices. Teams can migrate services to different regions, clouds, or containers without affecting the caller experience. The gateway handles routing to the appropriate location dynamically while presenting a single entry point. Similarly, microservices built in different programming languages can each expose their own unique protocols. But requiring client apps to integrate varied APIs creates expensive coupling that hinders agility. Gateways placed in front of microservices can handle protocol translations such that callers only need to use a single standardized protocol like GraphQL or REST.\n\nThe expansive surface area of numerous microservices exposes far more internal assets to potential compromise. Attack vectors multiply as more ports open to integrate various services, protocols, and diagnostic tools. Unprotected traffic between microservices likewise increases threats from unauthorized access or injection attacks. API gateways implement a key API security paradigm by funneling all inbound integration through a single intermediary. This consolidated entry point is easier to comprehensively fortify against protocol and application-level exploits using authentication, access controls, threat intelligence, and WAF capabilities. Gateways can also encrypt inter-service traffic flows to secure critical communication channels inside a microservice mesh.\n\nMicroservices promise more agile delivery of new capabilities through independently developable units aligned to business domains. However, teams still face cross-cutting operational concerns like security, traffic management, and failure handling that divert focus from coding differentiating business logic. API gateways promote velocity by providing these functionalities out of the box as reusable services. Developers avoid reinventing non-core modules and can dedicate more strategic attention to mission-critical code. Enterprises can consolidate scarce skills like security architects onto gateway administration rather than fragmented duplication across microservices teams."
    },
    {
        "link": "https://medium.com/codex/how-to-implement-kong-api-gateway-for-solving-microservices-challenges-725d426b0647",
        "document": "How to Implement Kong API Gateway for Solving Microservices Challenges\n\nIn a microservices architecture, managing multiple independent services can introduce new complexities, such as ensuring secure communication between services, handling scalability, and maintaining comprehensive monitoring.\n\nAn API gateway like Kong offers a streamlined way to manage these challenges, providing robust capabilities for securing, routing, and optimizing microservice communication.\n\nThis article will provide a step-by-step guide on setting up Kong API Gateway to help streamline and manage microservices, making it easier for organizations to scale and maintain their applications.\n\nUnderstanding Kong API Gateway and Its Benefits for Microservices\n\nKong API Gateway is an open-source API gateway that serves as a centralized access point for microservices. Built on top of NGINX, it’s known for its high performance and low latency, making it an excellent choice for managing microservices traffic. Here are some benefits of using Kong in microservices:\n• Centralized Access Control and Security: Kong allows centralized control over authentication, authorization, and security, reducing the risks associated with decentralized service interactions.\n• Load Balancing and Scaling: Kong enables efficient traffic management, balancing loads across microservices to ensure high availability and performance.\n• Improved Observability and Monitoring: With plugins that integrate with monitoring tools, Kong facilitates comprehensive tracking and analysis.\n• Developer Productivity: By simplifying the management of API policies and authentication, developers can focus on core features rather than security and routing.\n\nMicroservices come with their own set of challenges that Kong API Gateway can help mitigate. Key issues include:\n• Service Communication and Data Flow: Routing traffic between multiple services requires efficient load balancing and a reliable access control layer.\n• Secure and Scalable Endpoints: As the number of microservices increases, it becomes essential to secure APIs at scale.\n• Monitoring and Performance Maintenance: Without centralized monitoring, tracking service health, load, and latency can become complex, reducing overall reliability.\n\nBefore setting up Kong, ensure you have Docker installed and basic knowledge of networking. Kong offers multiple installation methods, including Docker, which is recommended for initial testing, and Kubernetes for production environments.\n\nTo start, you can install Kong on Docker with the following commands:\n• Set Up the Network and Database: Create a Docker network and a PostgreSQL database for Kong’s data storage:\n\nAfter the setup, Kong should be accessible via the Admin API at , allowing you to configure services and routes.\n\nWith Kong up and running, you can begin configuring services, routes, and plugins.\n\nTo route requests to a specific microservice, define a service and create a route for it using the Kong Admin API:\n\nReplace with the actual URL of your microservice.\n\nThis command sets up a route that will forward requests to to the specified service.\n\nKong offers various plugins that enhance security and control over microservices. Common plugins include authentication (e.g., JWT) and rate limiting to prevent abuse.\n\nThis enables JSON Web Token (JWT) authentication on the specified service, allowing secure access to API endpoints.\n\nThis sets a rate limit, allowing only five requests per minute to the service, helping control traffic and prevent overloading.\n\nOnce Kong is configured, test the API endpoint to ensure it functions as expected. For monitoring, Kong can integrate with popular tools like Prometheus and Grafana, allowing you to track performance metrics like request rate, latency, and errors.\n\nTo test the configured route, you can send a request to the API Gateway:\n\nThis should route your request to the underlying microservice, where any applied plugins (e.g., rate limiting, JWT) will also be active.\n\nFor production environments, a few optimizations will improve Kong’s performance and reliability:\n• Security Best Practices: Configure SSL/TLS to secure API communications, use strong authentication, and apply role-based access controls.\n• Scaling with Kubernetes: For larger deployments, using Kubernetes to manage Kong as a service mesh or ingress controller can provide seamless scaling.\n• Distributed Monitoring: Integrate with monitoring tools to track metrics and quickly identify bottlenecks or failures.\n\nThese steps allow for greater resilience and reliability, particularly when dealing with large-scale microservice architectures.\n\nKong API Gateway simplifies the management of microservices by centralizing API traffic control, enforcing security policies, and providing insights into service health. By following these steps to install, configure, and optimize Kong, you’ll be better equipped to address the challenges of microservices architecture while ensuring scalability and high availability."
    },
    {
        "link": "https://medium.com/@far3ns/kong-the-microservice-api-gateway-526c4ca0cfa6",
        "document": "But for sure, kong is template engine that will help accelerate development time and it is support configurable plugins. And communities support development and make it stable. And no need to reinvent the wheel.\n\nA lot of authentication plugin that we could choose from Basic authentication, JWT, LDAP until the most used — Oauth2.\n\nSecurity plugin that additional security layers such as ACL, CORS, Dynamic SSL, IP Restriction.\n\nTraffic control plugin is a very useful for limited cost such as rate limiting, request size limiting, response rate limiting and others.\n\nAnalytics and monitoring plugin that visualise, inspect and monitor API traffic such as Prometheus, data dog and Runscope.\n\nTransformation plugin that transform request and responses on the fly such as Request Transformer, Response Transformer.\n\nLogging plugin that log request and response data using the best transport for your infrastructure: TCP, UDP, HTTP, StatsD, Syslog and others.\n\nSo, now in this article we would try basic how to setup and use KONG. To do so, it is required to have basic:\n\nKong is available to install in multiple operating environments. For the easiest installation, we use docker, and for this tutorial is required to have basic knowledge docker. Please follow the basic tutorial installation and using docker.\n\nFirst — Create a docker network — this network will be use for kong and our API server\n\nSecond — Start database for Kong — there is two option database : Postgres or Cassandra. For know we use postgres.\n\nFourth — Start the Kong, when the migrations have run and your database is ready, start a kong container.\n\nThe respond would be:\n\nNow Kong is up and ready to be used. The next thing is prepare the API server that contain service routes and can be accessed as REST API use to be.\n\nNow prepare the API server, for this tutorial we are going to use node.js as API server.\n\nTo make it simple, please clone the code from GitHub faren-NodeJS-API-KONG.\n\nAnd it should contain like this in terminal:\n\nLet’s build docker image and run it, by execute instruction below:"
    }
]