[
    {
        "link": "https://woocommerce.com/posts/customize-product-pages",
        "document": "To effectively showcase your goods online, you’ll need product pages that are visually appealing and easy to navigate. The default WooCommerce template offers the essentials, but you might be looking for additional features to accommodate the unique needs of your online store and match your style.\n\nWith built-in customization tools like the block editor and Site Editor, WordPress enables you to make significant changes to your WooCommerce product pages without extensive development expertise. Plus, you can get specific design features and added functionality with different WooCommerce extensions. Or, if you’re a more experienced WordPress user, you can modify your WooCommerce product pages using custom code.\n\nIn this post, we’ll look at the default WooCommerce product page and talk about why you might want to customize it. Then, we’ll show you three different ways you can start customizing WooCommerce product page templates.\n\nWhen you install it on your WordPress website, the WooCommerce plugin instantly creates a Shop page where you can list all your products. If a visitor clicks on any item in your catalog, they’ll be taken to the corresponding product page. The layout of this page will largely depend on your theme, but it will contain some essential information about the product.\n\nYou can add or edit this information by navigating to the Products tab in your WordPress dashboard, locating your item, and selecting Edit Product. Alternatively, you can click on Add New to create a new product.\n\nStart by adding a product title and product description. On the right, you can attach a product image.\n\nIf you scroll down to the section, you’ll see that you can create simple products, grouped products, variable products, or affiliate products. Here, you can also configure shipping settings, attributes, linked products (for cross-sells), and more.\n\nOn this page, you can also choose a category for your product and add tags. These features enable customers to navigate your product catalog with greater ease.\n\nWhen you’re finished configuring a product, hit the Update button. Here’s what a default product page might look like on the front end:\n\nAs you can see, this WooCommerce product page comes with the essentials for selling your goods online. Note that the template you see on the front end of your site will be the same for all products.\n\nSo, why should you customize the WooCommerce product page if it works just fine?\n\nWell, perhaps you don’t need to at all.\n\nIf you prefer a minimalist design and only want essential features to sell your products, you might not need to make any changes. There’s certainly nothing that says you customize WooCommerce product pages and the default options have worked just fine for thousands of successful store owners.\n\nThat said, the default WooCommerce product page design can be limiting. For example, there’s no option to add other types of media, like video files or variation swatches.\n\nThis simplicity might work for some online stores. But others will want additional features to help increase sales.\n\nWith this in mind, you should customize your WooCommerce product page if you’d like to:\n• Offer more options for customers. Depending on your product and online store type, you might need to provide more options for customers. For instance, you could include add-ons like gift wrapping, product customization for one-of-a-kind items, or product bundling for convenience. You might even want to offer wholesale pricing for certain buyers.\n• Provide more information about your product. When you give customers all the necessary information, it may be easier for them to make a decision (and a purchase). You can add a product FAQ tab, variation swatches, 360 images, videos, etc.\n• Support your visual brand. By adding unique design features to your product page, you can further enhance your branding. Ideally, your product page should match your brand personality and appeal to your target audience.\n\nAll of these extras can contribute to a winning product page design and increase your average order value (AOV).\n\nNow, let’s look at three ways you can customize your WooCommerce product page!\n\nThe great thing about WordPress is that its native features are very beginner-friendly. Thanks to the Site Editor, you don’t need to know how to code in order to create stunning custom product pages in WooCommerce.\n\nWith the Site Editor, you’re able to customize your online shop using blocks. WooCommerce even has its own set of blocks, which include elements for displaying filters, search bars, best selling products, and more.\n\nThe Site Editor works in a very similar way to the block editor. But while the latter is used for pages and blog posts, the Site Editor enables you to customize global elements like your header, footer, and the WooCommerce product page template.\n\nNote that you can only use the Site Editor with a block theme. If you’re still using a classic theme, you’ll need to refer to method three in this guide.\n\nAlso, the content for each individual product page can only be modified by going to the Products tab and opening the item in the back-end editor (as shown earlier). What we’re about to do is customize the page components and style of your WooCommerce product page.\n\nTo get started, go to Appearance → Editor and click on Templates.\n\nScroll down to the WooCommerce section and select the Single Product template.\n\nThen, click on the pencil icon to open the template in the editor.\n\nAt first, you’ll see that the template is grayed out.\n\nClick on the template area and you’ll be prompted to transform the template into blocks. Hit the Transform into blocks button to proceed.\n\nNow you can edit your WooCommerce product page using blocks.\n\nIn case you’re not familiar with WordPress blocks or the Site Editor, here are a few useful ways you can tweak this page:\n\nTo adjust the page layout, click on a larger block and select the parent block.\n\nYour horizontal menu should then display arrows that enable you to move that part of the page left or right.\n\nYou’re also able to move blocks or groups of blocks up and down.\n\nAdditionally, if you want to add a block, just hover over the area where you’d like to insert it, and click on the plus symbol.\n\nIf you want to modify the layout, adding blocks for columns or groups makes the most sense.\n\nYou can also make global changes to the template layout by selecting it and then opening your block settings.\n\nUnder Layout, you’ll have the option to change the justification and position of the design. You can even transform it into a “sticky” element — which means it won’t disappear when visitors scroll down the page.\n\nWhen you’re happy with your modifications, hit the Save button at the top of your screen.\n\nWhen you customize fonts and colors on your product page, you can make sure the design aligns with your visual brand.\n\nTo modify colors in the Site Editor, choose the element you’d like to edit and open your block settings on the right.\n\nThe elements you can change will depend on the block, but typically you can modify the text, background, and link colors.\n\nBy default, you can choose from your theme’s default colors.\n\nIf you click on the area that says No color selected, you’ll get a color picker.\n\nHere, you can drag your mouse around to select a color. The Site Editor will even let you know if you’ve picked a poor color contrast.\n\nYou can also input specific HEX, HSL, or RGB color codes. This is ideal as it enables you to match your exact company colors.\n\nIn the Typography tab, you can change the size of text to small, medium, large, etc.\n\nTo access more font settings, click on the three dots next to .\n\nYou have tons of options here. Just click to select them and add them to your Typography menu.\n\nYou can always deselect these settings if you decide you don’t need them.\n\nWant to add elements to the product page? The Site Editor makes that possible.\n\nFor instance, when you’re running a site-wide sale, you could add a banner block to the top of your template.\n\nOr if you want to make navigation easier for customers, you might add a search block to the page.\n\nIt’s a good idea to familiarize yourself with the available WordPress blocks and WooCommerce blocks, so you can see what options you have.\n\nAs you’ve seen, there are several ways to customize the WooCommerce product page template in the Site Editor. The changes you make will be reflected on all your WooCommerce product pages.\n\nBut in certain cases, you might want a template that’s only used for a specific product type or category. For instance, you might want a totally unique product page for a new item you’re launching. Or, you might want to create a sale page for a certain product category around the holidays.\n\nTo create multiple templates for different purposes, go to Appearance → Editor → Templates. Then, click on the plus symbol to add a new template and choose Single item: Product.\n\nThis lets you create a new product page template, but for one item. Select your desired product from the menu to launch the Site Editor.\n\nBy default, you’ll be prompted to use a pre-existing pattern. Your first choice should be your general product page template.\n\nUsing a pre-existing pattern can help fast-track the design process. But you can always skip this step if you prefer to start from scratch.\n\nNow, if you return to the Templates screen and hit the plus symbol again to add a new template, you’ll see an option to select Category (product_cat).\n\nThis template will be for a specific category, like accessories, clothing, or decor.\n\nSimply choose your category and start building your template. The steps are the same as with the Single item: Product option.\n\nAs you’ve seen, when you’re using a block theme, the Site Editor enables you to customize your WooCommerce product page template in different ways, without touching a line of code.\n\nStill, it doesn’t give you the ability to extend the functionality of the page. Fortunately, there are plenty of WooCommerce extensions that help you do this, even if you’re a beginner without technical skills.\n\nIn this section, we’ll look at some tools that enable you to modify your product page with new features. To make things easier, we’ve organized these extensions into three use cases: for creating advanced products, optimizing WooCommerce product pages, and increasing sales.\n\nIf your online WooCommerce store offers bespoke products or advanced product variations, you might want a WooCommerce extension to facilitate the sale of these items. Below, we’ll explore a few top-notch options.\n\nWooCommerce enables you to create variable products by default, but the settings for these items can be a bit limited.\n\nIf you offer lots of goods in different styles, colors, or sizes, you might consider using the Advanced Product Variation extension. This helps you display product variations more effectively, so customers will get a better sense of your selection.\n\nFor example, it lets you set global attributes to create variation swatches. These swatches can showcase different colors, images, videos, and text, creating effective product displays.\n\nAdditionally, the extension allows you to customize your variation galleries and create tables to clearly show the available options.\n\nIf you sell one-of-a-kind products like custom T-shirts or mugs, you’ll need a tool like Product Designer for WooCommerce. This extension adds a “Customize Product” button to your page.\n\nYour customers will be able to add images, clip art, shapes, and templates to your products. And they’ll even be able to add them to their carts directly from the design page. It also creates print-ready files, which can help facilitate the production of custom goods.\n\nComposite Products is a powerful extension that’s perfect for online stores that process complex orders. It helps customers configure a product with multiple parts, streamlining the workflow to be as user-friendly as possible.\n\nFor instance, a skate shop may allow customers to build their own board in four steps, customizing everything to their specific preferences. Advanced sorting, filtering, and conditional logic make it easy for shoppers to find what they’re looking for.\n\nThe great thing about Composite Products is that it has built-in support for product bundles. That means when customers create their unique product, they’ll be able to pull from all the available items in your catalog.\n\nSome custom products require more resources, like additional fabric or wood. Without the right tools, creating a product page for these items can be logistically challenging.\n\nThe traditional way to sell this type of product would be to get in touch with customers with a quote. But this can drastically slow down the sales process. In fact, one of the main reasons that shoppers abandon carts is that they can’t calculate the total cost of the order upfront.\n\nThat’s where the Price by Formula Calculator for WooCommerce extension comes in handy. With this tool, you can add fields with formulas and rules to calculate the final price of a product. This can accommodate unique measurements like length, volume, and more.\n\nIf you have a large inventory, you might be interested in offering your items at wholesale prices. The Wholesale for WooCommerce extension gives you everything you need to get started.\n\nYou can create and manage multiple wholesale user roles and set up role-based pricing. It also comes with a drag-and-drop registration form builder, so you can create a wholesale application.\n\nAdditionally, you’ll get the option to hide wholesale products and prices from regular customers. You’ll even get a wholesale dashboard that displays reports on sales, refunds, orders, and more. This way, you can see how your WooCommerce wholesale business is progressing.\n\nHaving the minimum functionality you need to sell your products is essential. But if you want to create high-converting product pages, you may need to spice things up.\n\nHere are some extensions that can help improve your WooCommerce product pages.\n\nWhen customers are shopping for big ticket items like appliances or furniture, they’ll likely want to get as much detail about the product as possible before heading to the checkout page.\n\nWhile comprehensive product specifications, static photos, and videos can go a long way, offering a 360º image can help bring your products to life.\n\nIf you have the time to photograph your products from every angle, 360º Image for WooCommerce can help you create this useful visual effect. This extension is highly user-friendly and fully responsive.\n\nIt also comes with navigation controls and offers full screen mode, so your customers can get a good look at your product.\n\nA long and complicated checkout process is another one of the main reasons customers abandon carts. So, you might want to streamline the process using WooCommerce One Page Checkout.\n\nAs the name suggests, this extension lets you build a custom product page that guides shoppers directly to purchase. They can add or remove items to their cart and complete payment without ever waiting for a new page to load.\n\nThis tool is ideal for sites with fewer products or targeted landing pages associated with marketing campaigns.\n\nGood product descriptions can help increase sales. What’s more, product-based search engine optimization (SEO) is crucial for every ecommerce store. You can use your product descriptions as organic opportunities to incorporate keywords to help your site perform better in search results.\n\nThat said, if you provide your customers with too much information, you can overwhelm them. Therefore, you might want to utilize product tabs to present product information in a more organized way.\n\nWooCommerce Tab Manager can help you do this. It lets you customize your core tabs and re-order the default tab layout. You can even use it to create global tabs, third-party tabs, or unique tabs for specific products.\n\nNow, here are some tools that will help you increase your WooCommerce sales using both traditional and more subtle marketing methods.\n\nCreating a sense of urgency can help boost conversions. One great way to do this is by running flash sales.\n\nSale Flash Pro adds this functionality to your WooCommerce product page along with customizable ways to highlight these sales on your site — including a display of the original vs. sale price to make items look even more attractive.\n\nAround 40 percent of online shoppers say that their user experience would be better if retailers offered wishlists. With a number that high, every online store should have added this functionality on their priority checklist.\n\nWooCommerce Wishlists gives your customers full privacy control and the ability to create unlimited wishlists. They don’t even have to worry about registering on your website, since they can save their wishlist as a guest.\n\nUpselling and cross-selling strategies are crucial if you want to boost your overall revenue. Recommending relevant products is one of the most effective ways to do this.\n\nWith the Product Recommendations extension, you’re able to automatically offer intelligent suggestions to your customers. For instance, the tool can display related products in the same category or items that are frequently bought together.\n\nIt can even generate automatic recommendations based on the shoppers’ recently viewed history. Useful reports can also help you identify your most effective recommendation strategies.\n\nProduct add-ons offer another subtle way to increase your AOV. This can be especially useful for smaller boutiques or online stores that are able to provide a high level of personalization to their orders.\n\nThe Product Add-Ons extension helps you do this in just a few simple steps. You can incorporate these add-ons using dropdowns, text boxes, checkboxes, sample images, and more.\n\nWhen you’re using this tool, you can apply product add-ons globally or to individual products. Plus, the extension is compatible with other popular tools like WooCommerce Subscriptions and WooCommerce Bookings.\n\nAs long as you have a handful of items in the catalog of your online store, you can probably benefit from offering product bundles. Although WooCommerce doesn’t come with this feature by default, you can use the Product Bundles extension to get it.\n\nThis tool enables you to bundle both simple and variable WooCommerce products. You can even recommend optional items and offer bulk quantity discounts. Plus, you’re able to customize the appearance of your bundles and bundled items.\n\nIt’s also worth noting that the extension is compatible with both physical and virtual goods. That means it could also work for products like online courses and subscriptions.\n\nYou can also modify your product page using custom code. This method is particularly useful if you’re using a classic theme and therefore don’t have access to the Site Editor.\n\nNote that tinkering directly with your website’s theme files is a delicate process. If you don’t have the technical expertise, you could end up damaging your site and causing downtime.\n\nWith this in mind, you’ll want to be sure to back up your WooCommerce store before you proceed. It might also be best to use a staging site to experiment with your customizations.\n\nThen, once you’re ready to make your changes live, make sure to use a WordPress child theme. This way, your customizations won’t be lost with any updates to your parent theme.\n\nNow, here are some ways you can modify your WooCommerce product page using custom code.\n\nIf you want to customize the style of your WooCommerce product page using code, CSS is your best option. It enables you to modify things like colors, fonts, links, and more.\n\nThere are a few ways you can do this. Let’s take a look at them.\n\nTo add CSS to your product page using the Site Editor, go to Appearance → Editor → Styles → Additional CSS.\n\nYou can place your code in the Additional CSS box.\n\nFor instance, if you want to modify the color of a product title, you could use a code snippet like this:\n\nOr, if you’d like to change the font size you can use this CSS snippet:\n\nJust make sure to Publish your changes.\n\nOf course, these are just a few simple examples, but the opportunities are endless. If you’re interested in learning more, you can check out the WordPress documentation on CSS.\n\nIf your theme doesn’t support full site editing, you’ll have to add your CSS code in the Customizer. To do this, go to Appearance → Customize → Additional CSS.\n\nCSS will function the same way here as it does in the Site Editor.\n\nThe last location where you can add CSS to WordPress is in your theme’s file. Again, you’ll want to work with your child theme to ensure that your modifications aren’t lost in updates.\n\nBy default, your file should be selected. If it isn’t, simply select it on the right hand side of the screen under the Theme Files menu.\n\nThen, you can add any CSS to the very bottom of the file. You’ll just need to update it when you’re finished.\n\nCSS is great for changing the appearance of WordPress, but it can’t help you add functionality to your WooCommerce product pages.\n\nTo do that manually with code, you’ll need to use PHP. You can add PHP code to your child theme’s file or using a plugin like Code Snippets.\n\nHere are a few options you might want to try if you’re an experienced WordPress user or developer:\n\nFor users who prefer modifying elements of WooCommerce manually, you’re able to use WooCommerce hooks. These PHP code snippets enable you to carry out “actions” and “filters” to modify your WooCommerce product page.\n\nHere’s an example of a useful action:\n\nWhen you implement this hook, you’ll be able to add shortcodes to your product excerpts.\n\nMeanwhile, if you wanted to display product attribute archive links, you could use this code snippet:\n\nWooCommerce hooks also give you lots of useful filter functions to edit product data. For instance, you can reorder product tabs with this snippet:\n\nOr, you could add a custom tab:\n\nFor more information on using these functions, check out this complete list of WooCommerce hooks.\n\nWhen you’re working with PHP code for WooCommerce, another option is to create a global custom product page template from scratch. Keep in mind that this method won’t work for block themes.\n\nTo begin, you’ll need to name your new file and write an opening PHP comment at the top, stating the template’s name:\n\nIn this scenario, you might want to replace “Example Template” with “Global Custom Product Page Template” or something similar.\n\nThis template will be modeled after the default WooCommerce product page. Then, you can modify it as you wish using web hooks.\n\nCustomizing your WooCommerce product page can help you effectively showcase your offerings. It also enables you to offer more options to customers and create a unique experience that engages your audience. As we have seen, there are several ways to edit this page.\n\nIf you have a block theme, you can use the Site Editor to modify the appearance of the global template. To add more functionality, you can install WooCommerce extensions. If you’re an experienced WordPress user, you may want to use CSS or PHP, but this can be a delicate process.\n\nAre you ready to customize WooCommerce product pages to drive more conversions? With WooCommerce extensions you can add everything from product bundles to flash sale features — all without touching a line of code!"
    },
    {
        "link": "https://stackoverflow.com/questions/47379965/add-custom-tax-value-at-woocommerce-checkout",
        "document": "I want to add custom % value at woocommerce checkout page, but I want to show it only for Swiss country and hide it for others. Now I have the right code working for that, but the problems is that Im not able to show it when user choose switzerland. Here is a code so please help me see what Im doing wrong here\n\nIm sure Im doing wrong inside here:\n\nthanks for help"
    },
    {
        "link": "https://woocommerce.com/document/setting-up-taxes-in-woocommerce",
        "document": "Setting up taxes in WooCommerce is one of the first tasks you’ll want to complete when setting up a store. In this guide we look at available options for how to set up taxes in WooCommerce, how to access them, and what the WooCommerce tax settings do.\n• How to configure specific tax setups in WooCommerce\n\nThe video below offers a 2-minute guided tour of the WooCommerce tax settings that will acquaint you with the essentials of what this document covers in detail.\n\nThis documentation is meant to help with setting up tax rates in the WooCommerce settings and how the platform handles taxes/VAT/GST based on these settings, but not when or what to charge. We’re not tax professionals, our advice is how to use our software. For specific advice when it comes to what or when to charge tax/VAT/GST etc… We recommend consulting with a tax professional or an accountant on what may be your best options. Each business is unique, and there’s no way we can cover every possibility.\n\nTo configure taxes in WooCommerce you first need to enable the Tax settings tab by following the steps below:\n• Scroll down and select the Enable Taxes and Tax Calculations checkbox.\n• Scroll to the bottom of the page and click Save changes.\n\nOnce enabled, access the WooCommerce tax settings in the Tax tab by going to WooCommerce > Settings > Tax.\n\nYour choices for these options depend on the tax jurisdiction your store is located in. Check with your accountant to ensure your tax configuration is suitable for your store. Continue below to get acquainted with each setting, or click here for a how-to guide outlining steps to configure common tax scenarios.\n\nThe Prices entered with tax option is perhaps the most important setting when you manage taxes in your store. It determines how you enter your product prices. There are 2 options to select from:\n• Yes, I will enter prices inclusive of tax – enter all product prices including your store’s base tax rate.\n• No, I will enter prices exclusive of tax – you should then enter product prices without tax.\n\nFor example, let’s say want a product to cost £9.99 including taxes, your store is UK-based and the tax rate is 20%.\n• If you select Yes, I will enter prices inclusive of tax, you would enter £9.99 as the total product price. WooCommere will work backwards from that total and calculate that it includes the base product price of £8.325 and the tax of £1.665 to display, automatically rounded.\n• If you select No, I will enter prices exclusive of tax but want the same total price, you would enter £8.325 as the product price. WooCommerce then adds 20% on top and offers the same rounded price of £9.99.\n\nLearn more about how taxes are calculated in WooCommerce and refer to the Rounding section below for how this tax setting might be affected by other settings.\n\nUse the Calculate tax based on setting to tell WooCommerce which address to use for tax calculations. There are 3 options to choose from:\n\nOptions 1 and 2 require customers to enter the respective address.\n\nIf Option 3 is selected, the taxes are always calculated based on your store’s location regardless of the customer’s address.\n\nThe Shipping tax class setting draws from tax classes. It is used to indicate how WooCommerce should calculate tax on the cost of shipping. Each tax class in your shop appears as an option here. This setting always has at least the following options:\n\nThe setting defaults to the first option, Shipping tax class based on cart items. In this case, shipping tax is inherited from the tax class assigned to the product or products being shipped.\n\nFor example, if a product, like baby clothes, has been assigned a reduced tax class, then the tax rate from that class would also apply to the shipping charge. If your jurisdiction treats shipping differently, assign a specific tax class to this setting to use that for shipping instead.\n\nIn cases where there are multiple products with different tax rates in the order, the shipping tax is applied as follows:\n• If an order contains a product with the Standard rate tax class, it is used for shipping regardless of being the highest or not.\n• If the order does not contain a product with the Standard rate tax class, then the first rate found in the Additional tax classes section is used.\n\nIf you don’t use the Standard rate tax class on your products, and if you need the highest tax rate from other tax classes to apply to shipping, then you should make sure your highest tax rate is listed first in the Additional tax class section. Here is a detailed example of how to achieve that.\n\nEnable the Rounding tax at subtotal level, instead of per line setting to calculate rounding at the subtotal level instead of on a per line basis.\n\nIn certain circumstances this could lead to slight variances. Confirm if this is required for your store by consulting your accountant or check your tax jurisdiction.\n\nOff-by-one rounding errors are not affected by this setting. These can result if a series of 3 other tax display settings are not all set to either including tax or excluding tax. The series consist of\n\nWhen these 3 settings are mixed it can lead to the calculated price having more decimal precision than allowed to be displayed by the store, causing prices to be rounded in unexpected ways.\n\nIf any of the 3 tax display settings in the series differ, a warning banner is displayed to notify the user when the tax display settings are mismatched and in conflict. Clicking on Use recommended settings changes all the settings to be the same as the one set for Prices entered with tax.\n\nThe default Standard rates is sufficient for most cases, but if you sell goods that require different tax classes, you can add them here. Add one tax class per line. Remove or add additional classes as required, but note that the Standard rates class can’t be removed.\n\nAfter clicking Save changes, your added tax classes will appear as subtabs at the top of the page. From there you can click on each to add and manage the tax rates within that class.\n\nThe Display prices in store setting determines how prices are displayed throughout your stop/catalog. Choose from Including tax or Excluding tax.\n\nRefer to the Rounding section for how this setting might be affected by other settings.\n\nThe Display prices during cart and checkout setting determines how prices are displayed in your cart and during checkout. Choose from Including Tax or Excluding Tax.\n\nRefer to the Rounding section for how this setting might be affected by other settings.\n\nThe Price display suffix setting allows you to add any text after product prices and, optionally, show how much tax is included or the prices without tax. You can use the following dynamic place holders and add text around it:\n\nFor example, using in this field will display as “Price incl. tax: $59.74” in your store. This is a way to add the tax-inclusive price in small print to a store where the prices are configured to exclude tax, or vice versa.\n\nPrice suffixes are not shown by default when first viewing a variable product. They do, however, appear once a variation has been selected.\n\nThe Display tax total setting determines if multiple taxes are displayed as one total during checkout or if they’re displayed as an itemized list of taxes.\n\nThis setting, when set to Itemized, can also be useful to show the tax rate name on the cart and checkout pages, especially when only one tax rate per location is used and the name needs to be updated according to the location. In the image below is an example tax rate to illustrate. Note how the tax name is set to My Tax Name.\n\nThe tax appears as the English default Taxes when the Display tax totals is set to As a single total.\n\nHowever, the tax appears by the name given in the tax rate setup, My Tax Name, when we change the Display tax totals to Itemized.\n\nCreate a custom translation instead to change the default text (Taxes in English) without using the above setting.\n\nIf your settings are greyed out, you may notice an extra Automated taxes setting, which is set to Enable automated tax. If that is the case, most of this document won’t apply, as your taxes are automatically managed by an additional plugin.\n\nTo make this document more relevant, change the Automated taxes setting to Disable automated taxes (and click Save changes) to return the normal functionality of core WooCommerce tax settings.\n\nThe Automated taxes setting is added by an additional extension, in this case WooCommerce Tax. Refer to the WooCommerce Tax Documentation for how it works.\n\nTax classes are displayed as subtabs at the top of the Tax settings screen. Click on a tax class to view its tax rates table which is where you define the tax rates to apply to your customers.\n\nEach tax rate row has the following attributes:\n• Country Code – specify a 2-digit country code that the rate applies to or leave the asteriks (wildcard *) to apply to all countries. All country abbreviations are in the WooCommerce code, viewable here on Github.\n• State Code – specify a 2-digit state code that the rate applies to, for example “CA” for California, in the U.S or leave the wildcard * to apply to all states. All state/province abbreviations are in the WooCommerce code, viewable here on Github.\n• Postcode / Zip – enter postcodes that the rate applies to. Separate multiple values with a semicolon (;), use the wildcard * to match all postcodes, prefix letters or numbers to the wildcard * to apply to only certain postcodes (e.g. PE* would match all postcodes starting with PE, or 90210* would work in the U.S. for ZIP+4 postcodes), and use numeric ranges to include everything between a start and end (e.g. 2000…3000).\n• City – semicolon separated list of cities the rate applies to, or use the wildcard * to apply to all cities. If a city is specified, the customer would have to enter it exactly for a match. E.g. a rule for “Cape Town” will not match if a customer enters “Capetown”.\n• Rate % – enter the tax rate, for example 20 for a tax rate of 20%.\n• Tax name – give your tax a name, e.g. “VAT”.\n• Priority – assign a priority to the tax rate. Only the 1st rate that matches per priority will be used. Specify a different priority per rate to define multiple tax rates for a single area. 1 is the highest priority, and will be considered before 2, which will be considered before 3, etc. Here’s a detailed practical example.\n• Compound – check this box if this rate is compound (applied on top of all prior taxes).\n• Shipping – enabled by default and signifies that the tax rate also applies to shipping.\n\nFor How-to guides for configuring specific tax setups please see Configuring Specific Tax Setups in WooCommerce.\n\nTax rates can be entered manually by following the steps below:\n• Enter a value as required and explained above, for each column in each row.\n\nTax rates can also be exported to or imported from Comma-separated Value (CSV) files. Find the Import CSV and Export CSV buttons to the bottom-right of a tax rate table.\n\nTo create a tax rate CSV file from which to import rates, we suggest manually entering a rule first, and then doing a CSV export. It will generate a tax rule CSV file that contains the 10 columns that need to be present for a tax rate import to work, serving as a template for changes or additions. The columns are\n\nWe’ve provided a sample tax rate CSV below that you can download and use to import for the United States based on state tax only. Leave Tax class blank for standard rates. This should not be used for production/live purposes, as tax rates frequently change. Double-check any rate for accuracy before using.\n\nIncorrect rates should be deleted by following the steps below:\n• Go to WooCommerce > Settings > Tax and click on the appropriate tax class subtab (e.g. Standard rates, Reduced rates, etc.)\n• Select lines in the tax class rate table by clicking on them. Hold the SHIFT key or the CMD/CTRL key to select consecutive or specific rows respectively. Selected rows are highlighted yellow as pictured below.\n• Click the Remove Selected Rows button to delete the highlighted row(s).\n• Click Save changes to finalize the action.\n\nTo delete all tax rates at once (maybe because you have an extensive list to redo or perhaps you just want to start fresh) go to WooCommerce > Status > Tools > Delete WooCommerce Tax Rates and click the Delete tax rates button. This action cannot be undone.\n\nTax reports can be found in WooCommerce > Analytics > Taxes. The reports are further detailed in the WooCommerce Analytics Taxes Report Documentation.\n\nDo you still have questions and need assistance?\n• If you’re looking to extend the core functionality shown here, we recommend reviewing available extensions in the WooCommerce Marketplace.\n• Need ongoing advanced support or a customization built for WooCommerce? Hire a Woo Agency Partner.\n• Are you a developer building your own WooCommerce integration or extension? Check our Developer Resources.\n\nIf you weren’t able to find the information you need, please use the feedback thumbs below to let us know."
    },
    {
        "link": "https://stackoverflow.com/questions/48216892/woocommerce-set-tax-to-different-custom-value-for-each-product-calculated-by-pr",
        "document": "I am trying to set a custom tax value for each product in Woocommerce which calculates as follows:\n\nBecause Woocommerce doesn't offer a field for the cost of a product I installed the Cost of Goods - Woocommerce extension which allows to add this information to each product.\n\nThen I went ahead to look for the function that calculates the taxes and found the hook 'woocommerce_calc_tax' where I guess I have to hook into in order to change the calculated tax:\n\nBut since the hook offers only five parameter - none of which represents costs of a product. I have no idea how to pass the cost of a product to a function that hooks into this hook.\n\nSo my question is, how to pass the cost of a product (from Cost of Goods plugin) to this hook to use in a custom calculation of tax as described above.\n\nOr is there a different way to do this?"
    },
    {
        "link": "https://studiowombat.com/blog/woocommerce-customize-product-page",
        "document": "A WooCommerce customized product page has a variety of benefits. Beyond merely standing out, these pages become uniquely tailored to the specific requirements of your website, customers, and product lines. As a result, this customization contributes to an enhanced User Experience (UX) as well.\n\nFor WordPress users, plugins are the best way to add this functionality to your website.\n\nThis tutorial will show you how to customize your WooCommerce product pages,talk about why this is so important, and show you how the Advanced Product Fields for WooCommerce plugin can help.\n\nGood design is valuable for all aspects of your e-commerce store. It can help to establish brand identity, differentiate from competitors, and create a memorable shopping experience that increases both conversions and repeat purchases. Of course, you also get to showcase your products and highlight key features using customization.\n\nA WooCommerce product page typically includes several key components to effectively showcase and sell a product. These components are:\n• Product title: A clear and descriptive title for the product.\n• Product images: High-quality images that display the product from various angles. The ability to zoom in on these images is often included.\n• Price information: Clearly displayed price of the product. If there are special offers or discounts, these should be highlighted.\n• Product description: Detailed information about the product, including features, specifications, and benefits.\n• Add to cart button: A prominent button that allows customers to add the product to their shopping cart.\n• Variation options: If the product comes in different sizes, colors, or other variations, options to select these variations should be available.\n• Quantity selector: An option for the customer to choose the quantity of the product they wish to purchase.\n• Product reviews: Customer reviews and ratings for the product, which can help in building trust and providing social proof.\n• Related products: Suggestions for other products that are similar or complementary to the one being viewed. This can help in cross-selling.\n• Stock status: Information on the availability of the product, such as “In Stock” or “Out of Stock.”\n• Shipping and return information: Details about shipping methods, costs, and return policies.\n• Custom tabs or sections: Additional information like FAQs, size guides, or brand stories, depending on the type of product.\n\nThese components work together to provide a comprehensive and user-friendly experience for potential buyers, helping them make informed decisions about their purchases.\n\nCustomizing WooCommerce product pages is important for several reasons, all of which contribute to enhancing the user experience, strengthening brand identity, and ultimately boosting sales and customer loyalty. Here are some key reasons why customization is vital:\n• Enhanced user experience: Customizing product pages to match your specific audience’s needs and preferences can significantly improve their shopping experience. Clear, informative, and visually appealing pages make it easier for customers to find the information they need, understand the product, and make a purchasing decision.\n• Increased conversion rates: A well-customized product page that highlights the unique selling points of a product, provides detailed information, and has an intuitive layout is more likely to convert visitors into buyers.\n• Differentiation from competitors: In a crowded online marketplace, having a unique and customized product page can help your products stand out from those of your competitors, offering a competitive edge.\n• Improved SEO: Customized product pages that are optimized for search engines can rank higher in search results, increasing visibility and driving more organic traffic to your site.\n• Showcasing product benefits effectively: Every product is unique, and customization allows you to highlight specific features and benefits that appeal to your target audience, using custom images, videos, infographics, or customer testimonials.\n• Encouraging specific actions: Customized product pages can be designed to encourage specific customer actions, such as signing up for newsletters, sharing on social media, or exploring related products, thereby increasing engagement and potential sales.\n• Gathering customer insights: Customized pages can include elements that help gather customer feedback and insights, like custom forms, surveys, reviews, or questionnaires, which can be invaluable for future business strategies.\n\nIn summary, customizing WooCommerce product pages is a strategic approach to enhance user experience, strengthen brand identity, and drive sales, all of which are crucial for the success of an online store.\n\nIn this section, we’ll explore three key methods to customize your WooCommerce product pages, each suited to different needs and skill levels, including:\n\nCustomizing product pages using the default options in WooCommerce is a straightforward process that doesn’t require extensive technical skills. Here’s a brief overview:\n• WooCommerce settings: Start by exploring the WooCommerce settings in your WordPress dashboard. These settings allow you to adjust basic aspects like currency, product dimensions, and inventory management.\n• Customizing display options: WooCommerce lets you customize how products are displayed. You can set the number of products per row, per page, and choose the default product sorting order.\n• Product data settings: When you add or edit a product, WooCommerce provides various options to customize product data. This includes setting the product type, price, inventory status, shipping details, linked products for upselling and cross-selling, and more.\n• Product shortcodes: WooCommerce comes with a range of shortcodes that can be used to insert products or product categories into pages and posts. This is a simple way to create custom product displays without needing to code.\n• Customizer for visual edits: The WordPress Customizer allows you to make visual changes to your WooCommerce pages, like adjusting colors, fonts, and layout of elements. The extent of these changes depends on your theme’s compatibility with WooCommerce.\n• Widgets: WooCommerce provides widgets for product search, product categories, featured products, and more. These can be added to your site’s sidebar or footer for additional customization.\n\nUsing these default WooCommerce options allows for significant customization of your product pages without needing to delve into coding or using additional plugins. However, the level of customization is somewhat dependent on the flexibility of your WordPress theme.\n\nIf you’re looking for more advanced ways to customize your product page, you could use custom coding. This is discussed in the next point about custom coding.\n\nCustom coding offers a high level of flexibility and precision in customizing your WooCommerce product pages. For those familiar with HTML, CSS, and PHP, this method provides complete control over the appearance and functionality of your online store. Here’s a brief overview of how you can use custom code to customize your product pages:\n\nUsing WooCommerce hooks to customize a product page involves adding custom code to your theme’s functions.php file or a custom plugin. These hooks allow you to modify or add new content at specific points in the WooCommerce template. Here’s how to do it:\n• Identify the hook you need:\n• WooCommerce provides numerous hooks that you can use to customize your product pages, including action and filter hooks.\n• Action hooks let you insert extra content at specific points, while filter hooks allow you to modify data like altering text or HTML output.\n• Create a custom function:\n• Write a PHP function that performs the customization you want, such as adding custom text or displaying additional product information.\n• Add the function to functions.php:\n• Open your theme’s functions.php file, preferably in a child theme to avoid losing changes when updating.\n• Add your custom function to this file.\n• Hook your function to WooCommerce:\n• Use or to hook your custom function to the appropriate place in the WooCommerce template.\n• For example, adds a custom message above the product summary.\n• Test your changes:\n• Visit your product page to ensure the changes appear correctly.\n• Check compatibility across different devices and browsers.\n\nExample of using a hook\n\nLet’s say you want to add custom content before the product summary on the single product page. You can achieve this by using the woocommerce_single_product_summary hook:\n\nRemember, always back up your site before making changes and refer to the WooCommerce documentation for a list of hooks and their locations to understand where your customizations will appear.\n\nUsing hooks (actions & filters) is great to add or change minor things within the WooCommerce templates, but what if you want to replace the templates with your own HTML?\n\nCreating a custom template in WooCommerce involves several steps and requires some knowledge of HTML, CSS, and PHP. Here’s a streamlined process:\n• Set up a child theme: It’s important to create a child theme for your WordPress site to ensure your customizations aren’t lost during updates.\n• Copy the default template file: Find the default WooCommerce product page template file, usually located in in the WooCommerce plugin directory. Copy this file.\n• Paste the template file into your child theme: Move the copied file into your child theme’s directory, ideally in a folder named woocommerce.\n• Edit the template file: Open the copied file in your child theme and start customizing. You can change HTML structures, add new CSS classes, or modify the PHP code.\n\nExample: To override the admin order notification, copy: to\n\nTo maintain the integrity of your website during updates, it’s recommended to use a child theme. This ensures that your custom code remains intact even when the main theme is updated In your WordPress themes directory, create a new folder for your child theme (e.g., ).\n\nInside the child theme folder, create a style.css file with the following information:\n\nWhile custom coding provides excellent control, it requires a solid understanding of web development languages and WordPress/WooCommerce structure.\n\nThat’s why it’s alwasy better to use plugins to help you achieve your goals.\n\nPlugins offer a user-friendly and efficient way to customize your WooCommerce product pages, especially for those who may not be comfortable with coding. Numerous plugins cater specifically to WooCommerce customization, providing a range of features to enhance the appearance and functionality of your product pages. Here’s why plugins are a popular choice:\n• Ease of use: Most plugins come with intuitive interfaces, making customization accessible to users with varying levels of technical expertise.\n• Diverse functionality: Plugins often offer a wide array of features, including custom fields, advanced product variations, and conditional logic. This allows you to personalize your product pages according to your specific needs.\n• Compatibility: Reputable plugins are designed to work seamlessly with WooCommerce and other essential plugins, ensuring a harmonious integration into your e-commerce ecosystem.\n• Configuration: Plugins that offer product configuration allows shoppers to customize their purchases – making it a more unique UX for every shopper. Along with this, plugins that offer live previews to products improve user-accessibility.\n\nSelecting the right plugin: Advanced Product Fields for WooCommerce\n\nWhen it comes to customizing your WooCommerce product pages with precision and flexibility, choosing the right plugin is so important. With plugins like Advanced Product Fields for WooCommerce, you can easily customize your WooCommerce product pages. The plugin enables you to create a personalized and interactive shopping experience, without the need for any coding or technical knowledge.\n\nHere’s a quick overview of what Advanced Product Fields for WooCommerce gives you out of the box:\n• There are plenty of ways to enhance your product pages without code. For instance, you can add various selection options, such as checkboxes, radio buttons, dropdown menus, and more.\n• With conditional logic, you can set up rules and conditions for specific fields, and use dynamic display options to show or hide them based on customer selections.\n• The plugin will also let you set up advanced pricing structures. You’re able to create dynamic pricing based on quantity ranges, add price modifiers for specific options, or set up custom pricing formulas.\n• If you need to add extra custom fields to your product pages, you can do so. This lets you collect additional information during the purchasing process.\n\nWhile there’s a free version of Advanced Product Fields for WooCommerce, the premium version offers more. A single-site license begins from just $69 per year, which gives you almost all of the available functionality.\n\nHow to customize your WooCommerce product pages with Advanced Product Fields for WooCommerce\n\nFollow these steps to enhance your online store’s customization:\n\nWith Advanced Product Fields, you can customize your product pages with additional product options through swatches, file upload functionality, and a choice of 16 input field types, such as text boxes, dropdown lists, checkboxes, radio buttons, file uploads, and more.\n\nTo do this, take the following steps on the product page you want to customize after setting up the plugin:\n• Access the custom fields tab: In the Product Data metabox of your product page, click on the Custom Fields tab.\n• Create your first field: Click on Add your first field to start creating your product configuration fields. A new field will appear, where you can select the type of field you want to create. You can create as many customization options as you like. For instance, if you sell custom bikes, you could provide options for different bicycle frame sizes, colors, wheel types, etc.\n• Add image swatches: Implement image swatches to let customers easily select options like frame size, color, and wheel type.\n• Configure conditional display: By default, all fields you add will be visible. You can set up conditional logic so that specific fields become visible based on the customer’s customization choices.\n\nOne of the best features of the Advanced Product Fields for WooCommerce plugin is its conditional logic functionality. This lets you show or hide product options based on previous user selections. It’s a powerful way to create interactive and dynamic customization.\n\nFor instance, consider an online store that sells customizable sofas in different sizes (small, medium, and large) and upholstery options (such as leather or velvet). Conditional logic can help you hide or show specific product customization options based on a variant.\n\nTo set up conditional logic for your fields, take the following steps:\n• Navigate to Product Fields: Go to WooCommerce → Product Fields in your dashboard and select the field group assigned to your laptop product.\n• Configure conditional logic:\n• Scroll down to your first variation field within the group.\n• In the Conditionals section of this field, use the drop-down menus to establish your conditional logic.\n• Apply logic to other variations: Repeat the process for other variations.\n• Set conditions for display: Check the ‘Conditions’ metabox on the main product field group page to specify when these conditional logic rules should apply. You can tailor this according to your store’s specific needs.\n\nYou should also have flexibility with your pricing, as well as your variation selections. Advanced Product Fields for WooCommerce provides dynamic pricing to help solve this challenge. In fact, over one fifth of businesses uses this type of pricing to maximize sales. You can adjust the final product price using formulas or ‘lookup tables’.\n\nTo do so, take the following steps:\n• Create your field: For versatile pricing strategies like donations or ‘name your price’, configure a field and set its Type to Number. This allows you to set minimum and maximum values, and adjust pricing based on various factors.\n• Set pricing settings: Enable the Adjust Pricing setting, select the pricing type and add a value.\n\n\n\nYou can choose between many different pricing types, each with their unique strengths. You can even go as far as create complex formula-based pricing.\n\nThis level of flexibility allows businesses to implement various pricing strategies and cater to customer preferences effectively.\n\nElsewhere on the blog, we have a full guide on how to add different pricing models to your store using Advanced Product Fields for WooCommerce. It’s essential reading if you need to personalize and customize your product pricing.\n\nAchieve an optimal and visually great WooCommerce product page with these best practices:\n\nEnsure a consistent and user-friendly experience across various devices, including desktops, tablets, and mobile phones. Responsive design is key to accommodating the diverse ways customers access your online store.\n\n2. Importance of color and typography in branding\n\nAlign your product pages with your brand identity by carefully selecting colors and typography. Maintain a cohesive look and feel that resonates with your brand, enhancing brand recognition and creating a memorable shopping experience.\n\nRegularly evaluate the performance of your product pages and gather feedback from customers. Stay proactive in making improvements based on user interactions, emerging trends, and evolving customer preferences to ensure your online store remains competitive and customer-centric.\n\nCompatibility and integration with WordPress themes and plugins\n\nWordPress often uses many ‘moving parts’ in the design of an entire website. As such, you’ll need to understand that compatibility and integration between your theme, plugins, WooCommerce, page builders, and more is crucial to succeed. High-quality solutions make for fewer headaches over the long term.\n\nWithout this compatibility, you’ll erode the optimal conversion rates you’re expecting. At the least, you’ll cause design issues that can turn off customers. In the worst case, your store will be unusable, especially if a plugin or component goes offline or breaks. However, Advanced Product Fields for WooCommerce is a quality plugin you can rely on.\n\nThis is, in part, due to how it integrates with other WordPress plugins and services. For instance, the plugin works in a seamless way with popular page builders such as Divi, Beaver Builder, and Elementor.\n\nUsing a page builder gives you greater control over the design and layout of your product pages. What’s more, page builders can create visually stunning and unique shopping experiences that stand out from the competition. This is all without the need for coding.\n\nAdvanced Product Fields for WooCommerce has a long list of plugins and services it integrates with, apart from page builders. It officially integrates with some other valuable plugins:\n\nYou’ll also find some themes work in the best possible way with the plugin. For instance, Flatsome, Astra, and WoodMart all have official integrations with Advanced Product Fields for WooCommerce. However, regardless of your choice of themes and plugins, you shouldn’t see any compatibility issues – rock solid stability is one of the core foundations of Advanced Product Fields for WooCommerce.\n\nTake action: use WooCommerce to customize your product page today\n\nCustomizing your WooCommerce product pages is a crucial step towards creating a unique and personalized shopping experience that boosts sales and customer satisfaction. As such, you have a lot of scope to achieve this in WordPress. However, we think a plugin offers the best balance between functionality and usability.\n\nAdvanced Product Fields for WooCommerce stands out as a powerful tool to customize your product pages. You can customize product options themselves, utilize conditional logic, implement advanced pricing structures, add extra fields, support multi-variations and currencies, and more.\n\nYou can jump on board with a single-site license for Advanced Product Fields for WooCommerce, starting from $69 per year."
    },
    {
        "link": "https://woocommerce.com/document/setting-up-taxes-in-woocommerce",
        "document": "Setting up taxes in WooCommerce is one of the first tasks you’ll want to complete when setting up a store. In this guide we look at available options for how to set up taxes in WooCommerce, how to access them, and what the WooCommerce tax settings do.\n• How to configure specific tax setups in WooCommerce\n\nThe video below offers a 2-minute guided tour of the WooCommerce tax settings that will acquaint you with the essentials of what this document covers in detail.\n\nThis documentation is meant to help with setting up tax rates in the WooCommerce settings and how the platform handles taxes/VAT/GST based on these settings, but not when or what to charge. We’re not tax professionals, our advice is how to use our software. For specific advice when it comes to what or when to charge tax/VAT/GST etc… We recommend consulting with a tax professional or an accountant on what may be your best options. Each business is unique, and there’s no way we can cover every possibility.\n\nTo configure taxes in WooCommerce you first need to enable the Tax settings tab by following the steps below:\n• Scroll down and select the Enable Taxes and Tax Calculations checkbox.\n• Scroll to the bottom of the page and click Save changes.\n\nOnce enabled, access the WooCommerce tax settings in the Tax tab by going to WooCommerce > Settings > Tax.\n\nYour choices for these options depend on the tax jurisdiction your store is located in. Check with your accountant to ensure your tax configuration is suitable for your store. Continue below to get acquainted with each setting, or click here for a how-to guide outlining steps to configure common tax scenarios.\n\nThe Prices entered with tax option is perhaps the most important setting when you manage taxes in your store. It determines how you enter your product prices. There are 2 options to select from:\n• Yes, I will enter prices inclusive of tax – enter all product prices including your store’s base tax rate.\n• No, I will enter prices exclusive of tax – you should then enter product prices without tax.\n\nFor example, let’s say want a product to cost £9.99 including taxes, your store is UK-based and the tax rate is 20%.\n• If you select Yes, I will enter prices inclusive of tax, you would enter £9.99 as the total product price. WooCommere will work backwards from that total and calculate that it includes the base product price of £8.325 and the tax of £1.665 to display, automatically rounded.\n• If you select No, I will enter prices exclusive of tax but want the same total price, you would enter £8.325 as the product price. WooCommerce then adds 20% on top and offers the same rounded price of £9.99.\n\nLearn more about how taxes are calculated in WooCommerce and refer to the Rounding section below for how this tax setting might be affected by other settings.\n\nUse the Calculate tax based on setting to tell WooCommerce which address to use for tax calculations. There are 3 options to choose from:\n\nOptions 1 and 2 require customers to enter the respective address.\n\nIf Option 3 is selected, the taxes are always calculated based on your store’s location regardless of the customer’s address.\n\nThe Shipping tax class setting draws from tax classes. It is used to indicate how WooCommerce should calculate tax on the cost of shipping. Each tax class in your shop appears as an option here. This setting always has at least the following options:\n\nThe setting defaults to the first option, Shipping tax class based on cart items. In this case, shipping tax is inherited from the tax class assigned to the product or products being shipped.\n\nFor example, if a product, like baby clothes, has been assigned a reduced tax class, then the tax rate from that class would also apply to the shipping charge. If your jurisdiction treats shipping differently, assign a specific tax class to this setting to use that for shipping instead.\n\nIn cases where there are multiple products with different tax rates in the order, the shipping tax is applied as follows:\n• If an order contains a product with the Standard rate tax class, it is used for shipping regardless of being the highest or not.\n• If the order does not contain a product with the Standard rate tax class, then the first rate found in the Additional tax classes section is used.\n\nIf you don’t use the Standard rate tax class on your products, and if you need the highest tax rate from other tax classes to apply to shipping, then you should make sure your highest tax rate is listed first in the Additional tax class section. Here is a detailed example of how to achieve that.\n\nEnable the Rounding tax at subtotal level, instead of per line setting to calculate rounding at the subtotal level instead of on a per line basis.\n\nIn certain circumstances this could lead to slight variances. Confirm if this is required for your store by consulting your accountant or check your tax jurisdiction.\n\nOff-by-one rounding errors are not affected by this setting. These can result if a series of 3 other tax display settings are not all set to either including tax or excluding tax. The series consist of\n\nWhen these 3 settings are mixed it can lead to the calculated price having more decimal precision than allowed to be displayed by the store, causing prices to be rounded in unexpected ways.\n\nIf any of the 3 tax display settings in the series differ, a warning banner is displayed to notify the user when the tax display settings are mismatched and in conflict. Clicking on Use recommended settings changes all the settings to be the same as the one set for Prices entered with tax.\n\nThe default Standard rates is sufficient for most cases, but if you sell goods that require different tax classes, you can add them here. Add one tax class per line. Remove or add additional classes as required, but note that the Standard rates class can’t be removed.\n\nAfter clicking Save changes, your added tax classes will appear as subtabs at the top of the page. From there you can click on each to add and manage the tax rates within that class.\n\nThe Display prices in store setting determines how prices are displayed throughout your stop/catalog. Choose from Including tax or Excluding tax.\n\nRefer to the Rounding section for how this setting might be affected by other settings.\n\nThe Display prices during cart and checkout setting determines how prices are displayed in your cart and during checkout. Choose from Including Tax or Excluding Tax.\n\nRefer to the Rounding section for how this setting might be affected by other settings.\n\nThe Price display suffix setting allows you to add any text after product prices and, optionally, show how much tax is included or the prices without tax. You can use the following dynamic place holders and add text around it:\n\nFor example, using in this field will display as “Price incl. tax: $59.74” in your store. This is a way to add the tax-inclusive price in small print to a store where the prices are configured to exclude tax, or vice versa.\n\nPrice suffixes are not shown by default when first viewing a variable product. They do, however, appear once a variation has been selected.\n\nThe Display tax total setting determines if multiple taxes are displayed as one total during checkout or if they’re displayed as an itemized list of taxes.\n\nThis setting, when set to Itemized, can also be useful to show the tax rate name on the cart and checkout pages, especially when only one tax rate per location is used and the name needs to be updated according to the location. In the image below is an example tax rate to illustrate. Note how the tax name is set to My Tax Name.\n\nThe tax appears as the English default Taxes when the Display tax totals is set to As a single total.\n\nHowever, the tax appears by the name given in the tax rate setup, My Tax Name, when we change the Display tax totals to Itemized.\n\nCreate a custom translation instead to change the default text (Taxes in English) without using the above setting.\n\nIf your settings are greyed out, you may notice an extra Automated taxes setting, which is set to Enable automated tax. If that is the case, most of this document won’t apply, as your taxes are automatically managed by an additional plugin.\n\nTo make this document more relevant, change the Automated taxes setting to Disable automated taxes (and click Save changes) to return the normal functionality of core WooCommerce tax settings.\n\nThe Automated taxes setting is added by an additional extension, in this case WooCommerce Tax. Refer to the WooCommerce Tax Documentation for how it works.\n\nTax classes are displayed as subtabs at the top of the Tax settings screen. Click on a tax class to view its tax rates table which is where you define the tax rates to apply to your customers.\n\nEach tax rate row has the following attributes:\n• Country Code – specify a 2-digit country code that the rate applies to or leave the asteriks (wildcard *) to apply to all countries. All country abbreviations are in the WooCommerce code, viewable here on Github.\n• State Code – specify a 2-digit state code that the rate applies to, for example “CA” for California, in the U.S or leave the wildcard * to apply to all states. All state/province abbreviations are in the WooCommerce code, viewable here on Github.\n• Postcode / Zip – enter postcodes that the rate applies to. Separate multiple values with a semicolon (;), use the wildcard * to match all postcodes, prefix letters or numbers to the wildcard * to apply to only certain postcodes (e.g. PE* would match all postcodes starting with PE, or 90210* would work in the U.S. for ZIP+4 postcodes), and use numeric ranges to include everything between a start and end (e.g. 2000…3000).\n• City – semicolon separated list of cities the rate applies to, or use the wildcard * to apply to all cities. If a city is specified, the customer would have to enter it exactly for a match. E.g. a rule for “Cape Town” will not match if a customer enters “Capetown”.\n• Rate % – enter the tax rate, for example 20 for a tax rate of 20%.\n• Tax name – give your tax a name, e.g. “VAT”.\n• Priority – assign a priority to the tax rate. Only the 1st rate that matches per priority will be used. Specify a different priority per rate to define multiple tax rates for a single area. 1 is the highest priority, and will be considered before 2, which will be considered before 3, etc. Here’s a detailed practical example.\n• Compound – check this box if this rate is compound (applied on top of all prior taxes).\n• Shipping – enabled by default and signifies that the tax rate also applies to shipping.\n\nFor How-to guides for configuring specific tax setups please see Configuring Specific Tax Setups in WooCommerce.\n\nTax rates can be entered manually by following the steps below:\n• Enter a value as required and explained above, for each column in each row.\n\nTax rates can also be exported to or imported from Comma-separated Value (CSV) files. Find the Import CSV and Export CSV buttons to the bottom-right of a tax rate table.\n\nTo create a tax rate CSV file from which to import rates, we suggest manually entering a rule first, and then doing a CSV export. It will generate a tax rule CSV file that contains the 10 columns that need to be present for a tax rate import to work, serving as a template for changes or additions. The columns are\n\nWe’ve provided a sample tax rate CSV below that you can download and use to import for the United States based on state tax only. Leave Tax class blank for standard rates. This should not be used for production/live purposes, as tax rates frequently change. Double-check any rate for accuracy before using.\n\nIncorrect rates should be deleted by following the steps below:\n• Go to WooCommerce > Settings > Tax and click on the appropriate tax class subtab (e.g. Standard rates, Reduced rates, etc.)\n• Select lines in the tax class rate table by clicking on them. Hold the SHIFT key or the CMD/CTRL key to select consecutive or specific rows respectively. Selected rows are highlighted yellow as pictured below.\n• Click the Remove Selected Rows button to delete the highlighted row(s).\n• Click Save changes to finalize the action.\n\nTo delete all tax rates at once (maybe because you have an extensive list to redo or perhaps you just want to start fresh) go to WooCommerce > Status > Tools > Delete WooCommerce Tax Rates and click the Delete tax rates button. This action cannot be undone.\n\nTax reports can be found in WooCommerce > Analytics > Taxes. The reports are further detailed in the WooCommerce Analytics Taxes Report Documentation.\n\nDo you still have questions and need assistance?\n• If you’re looking to extend the core functionality shown here, we recommend reviewing available extensions in the WooCommerce Marketplace.\n• Need ongoing advanced support or a customization built for WooCommerce? Hire a Woo Agency Partner.\n• Are you a developer building your own WooCommerce integration or extension? Check our Developer Resources.\n\nIf you weren’t able to find the information you need, please use the feedback thumbs below to let us know."
    },
    {
        "link": "https://woocommerce.com/document/setting-up-taxes-in-woocommerce/configuring-specific-tax-setups-in-woocommerce",
        "document": "The tax scenarios in this document are step-by-step guides that show how to configure specific tax setups in WooCommerce. They provide all the steps needed to achieve a particular outcome but without going into detail. Due to the uniqueness and variety of stores out there, the scenarios are not exhaustive and for illustration purposes only.\n\nRefer to these additional guides for detailed descriptions of settings:\n\nThis documentation is meant to help with setting up tax rates in the WooCommerce settings and how the platform handles taxes/VAT/GST based on these settings, but not when or what to charge. We’re not tax professionals, our advice is how to use our software. For specific advice when it comes to what or when to charge tax/VAT/GST etc… We recommend consulting with a tax professional or an accountant on what may be your best options. Each business is unique, and there’s no way we can cover every possibility.\n\nThis example store is based in South Africa. It charges one rate of 15% VAT to all customers regardless of where they’re buying from or shipping to. It shows all its product prices including tax.\n\nThe outcome of this setup is that all customers see and pay the same tax-inclusive prices for products throughout the store.\n\nTo achieve this outcome, follow the steps below. Use the default values where settings are not specifically mentioned.\n• Go to WooCommerce > Settings > General and set Store Address to Cape Town, South Africa.\n• Scroll to the bottom and click Save changes.\n• Set Prices entered with tax to Yes, I will enter prices inclusive of tax.\n• Set Display prices in the shop to Including tax\n• Set Display prices during cart and checkout to Including tax.\n• Go to Standard rates (the subtab near the the top of the screen)\n• In the Tax name column enter VAT.\n\nVerify that taxes work as you expect by running tests with a variety of addresses, both inside and outside of the store’s base country.\n\nIn this scenario the example store is based in the UK and sells world-wide. It taxes purchases for customers from only 3 countries based on their shipping address: 20% in the UK, 19% in France, and 25% in Norway. It does not collect tax for customers shipping anywhere else. Because of the varying taxes, it displays product prices excluding tax.\n\nThe outcome of this setup is that first-time visitors all see the same tax-exclusive prices for products. Once a shipping country is added to the address field on the cart/checkout page, taxes are calculated according to the respective tax rate for one of the 3 countries. If a customer’s shipping address is no in one of the 3 countries, prices continue to show as tax-exclusive and taxes are not charged.\n\nTo achieve this outcome, follow the steps below. Use the default values where settings are not specifically mentioned.\n• Set Prices entered with tax to No, I will enter prices exclusive of tax.\n• Set Display prices in the shop to Excluding tax.\n• Set Display prices during cart and checkout to Excluding tax.\n• Set Display tax totals to Itemized (to show the tax rate names).\n• Go to Standard rates (the subtab near the the top of the screen).\n• Click the Insert row button to enter the 1st tax rule.\n• In the Country Code column enter GB (the 2-digit code for the UK).\n• In the Tax name column enter VAT.\n• Click the Insert row button to enter the 2nd tax rule.\n• In the Country Code column enter FR (the 2-digit code for France).\n• In the Tax name column enter TVA.\n• Click the Insert row button to enter the 3rd tax rule.\n• In the Country Code column enter NO (the 2-digit code for Norway).\n• In the Tax name column enter MVA.\n\nVerify that taxes work as you expect by running tests with a variety of addresses, both inside and outside of the store’s base country.\n\nThe example store in this scenario is based in California. It sells and ships within the U.S. only. It charges 7% for sales that ship within the state, plus an additional 2% for shipping to specifically the 90210 ZIP code. Sales shipped to any other state are charged 6% tax. The order in which tax rules appear among priorities are important as the 1st rule that matches is used.\n\nThe outcome of this scenario is that all visitors see prices excluding tax until they enter their shipping details on the cart/checkout page, after which one or more taxes apply as determined by the tax rates.\n\nTo achieve this outcome, follow the steps below. Use the default values where settings are not specifically mentioned.\n• Go to WooCommerce > Settings > General and set Store Address to a California-based address.\n• Set Default customer location to No location by default (first-time visitors will not see any tax info until they enter a shipping address).\n• Scroll to the bottom and click Save changes.\n• Set Prices entered with tax to No, I will enter prices exclusive of tax.\n• Set Display prices in the shop to Excluding tax.\n• Set Display prices during cart and checkout to Excluding tax.\n• Set Display tax totals to Itemized (to show the tax rate names).\n• Go to Standard rates (the subtab near the the top of the screen).\n• Click the Insert row button to enter the 1st tax rule.\n• In the Country Code column enter US (the 2-digit code for the U.S.).\n• In the State Code column enter CA (the 2-digit code for California).\n• In the Tax name column enter Tax.\n• Click the Insert row button to enter the 2nd tax rule.\n• In the Country Code column enter US.\n• In the Postcode / ZIP column enter 90210* (we add the wildcard (*) to apply this rule to ZIP+4 codes as well).\n• In the Tax name column enter BH Tax.\n• Click the Insert row button to enter the 3rd tax rule.\n• In the Country Code column enter US .\n• In the Tax name column enter Tax.\n\nYou’ll notice that the rules are automatically rearranged and grouped by priority once saved.\n\nHere is how the tax rules are evaluated when a customer enters their address:\n• All Priority 1 taxes are evaluated first, from the top down as the rules appear in the table.\n• The 1st criteria from the 1st rule is that the address is U.S.-based.\n• If it is, the 2nd criteria is that the address is California-based.\n• If it is, the 7% rate is applied, and the evaluation moves on to Priority 2 taxes.\n• If the address is not California-based, it moves on to the next Priority 1 tax rate, and applies that instead.\n• WooCommerce checks if the address is U.S.-based.\n• If it is, it checks if the ZIP code starts with 90210.\n• If it does, it applies the 2% rate (alongside the Priority 1 tax).\n• If the ZIP code does not start with 90210, the rate is ignored and only the one Priority 1 tax applies.\n\nThe below illustrations show how the different tax rates apply to various addresses.\n\nFirst, Hiouochi is in California, but outside the specific ZIP code, so only the 7% tax applies.\n\nNext, 90210 is in both California and match the specific ZIP code we targeted with the 2nd tax rate. As intended, this address gets 2 taxes applied.\n\nOur last address is in Ann Arbor, Michigan, so only the more general U.S. tax applies to it.\n\nBy default, shipping taxes rely on the Standard rate class. If no Standard rate products are present in an order, or you do not use that tax class, then the first rate in Additional tax classes is used. In that case, make sure that your highest rate is listed first in the Additional tax class section as illustrated below.\n\nNote the additional classes: Tax A, Tax B, and Tax C. Create them by adding the names in the Additional tax class setting and Save changes. The names will appear as sub-tabs at the top of the screen. The Standard rates class cannot be deleted, but if left blank, it will be ignored.\n\nThe illustration below shows the Standard rates class without any tax rules, thus empty.\n\nIn the illustration below, the Tax A class is shown with the highest rate of 24%, so it’s positioned first on the list. One row is added to the rates table with the Country code set to US, Rate % set to 25, Tax name set to Tax 24%, and Priority set to 1. The rest of the columns have default values.\n\nThe next illustration shows that the Tax B class is next. It’s the same as Tax A, except here the Rate % is 14 and the Tax name is Tax 14%.\n\nIn this illustration the Tax C class is entered last and the settings are the same again as Tax B, except the Rate % is 10% and the Tax Name is Tax 10%.\n\nThe outcome of this scenario is that the highest tax rate is applied to shipping when an order with multiple products is created, each product with one of the above tax rates assigned.\n\nIn the illustration of the order below, we see that the tax for Product 1 is $84 (on a $350 product). The Flat rate shipping of $10 is $2.40. Where the total for this 24% tax rate appears, we see that together it’s the sum of those parts, or $86.40, confirming that the 24% tax rate applied to the shipping, as we intended.\n\nThe store in this scenario is based in the U.S. state of Kentucky where there’s a 6% state tax for physical goods shipped within the state. The store does not collect taxes on those same goods if shipped to outside the state. However, it also sells virtual goods for which it needs to collect taxes regardless of the customer’s shipping address.\n\nThe outcome of this setup is that all products for a Kentucky address are taxed, whether that product is virtual or physical, but for addresses elsewhere, only virtual products are taxed.\n• Go to WooCommerce > Settings > General and set Store Address to a Kentucky-based address.\n• Set Default customer location to No location by default (first-time visitors will not see any tax info until a shipping address is entered).\n• Scroll to the bottom and click Save changes.\n• Set Prices entered with tax to No, I will enter prices exclusive of tax.\n• In Additional tax classes add a new class e.g. Virtual Goods (we’ll assign this to products later).\n• Set Display prices in the shop to Excluding tax.\n• Set Display prices during cart and checkout to Excluding tax.\n• Go to Standard rates (the subtab near the the top of the screen).\n• Click the Insert row button to enter the 1st tax rule.\n• In the Country Code column enter US (the 2-digit code for the U.S.).\n• In the State Code column enter KY (the 2-digit code for Kentucky, now the rate applies to Kentucky only).\n• In the Tax name column enter KY Tax (optional).\n• Next, go to the tax class we created in the previous section, Virtual Goods rates (appears as a link near the top)\n• Click the Insert row button to enter the 1st tax rule in this class.\n• In the Tax name column enter Tax (optional).\n\nThis tax rate applies to all customers, but because its an Additional tax class, and the Standard rates are used by default, it only applies to products we specifically apply it to. We’ll do that next.\n• Go to Products and either Add new or edit existing products.\n• Any physical products that are shipped can continue to use Standard rates taxes.\n• For virtual products, set their Product > Product data > General > Tax class to Virtual Goods.\n• Click Update after editing a product to save the changes.\n\nBelow is an image showing a shippable product’s Tax class is set to Standard.\n\nBelow is another image, this time showing a virtual product’s Tax class set to Virtual Goods.\n\nWith the above settings in place, the shop is ready to collect taxes. Below illustrates the cart page with two products, aptly named Shippable Good ($20) and Virtual Good ($10). The address entered into the shipping calculator is Lexington, Kentucky. The itemized taxes show both KY Tax and Virtual Goods Tax apply.\n\nThe next illustration shows the same cart as above, except the address is now set to Ann Arbor, Michigan. The itemized taxes show that only the Virtual Goods Tax applies and, at $0.60, is applied to the Virtual Good product only.\n\nThe WooCommerce Developer Documentation outlines how to use code snippets to charge the same price regardless of location and taxes, charge tax based on the subtotal amount, apply different tax rates based on the customer role, show 0 value taxes, or add suffixes on the main variable product.\n\nDo you still have questions and need assistance?\n• If you’re looking to extend the core functionality shown here, we recommend reviewing available extensions in the WooCommerce Marketplace.\n• Need ongoing advanced support or a customization built for WooCommerce? Hire a Woo Agency Partner.\n• Are you a developer building your own WooCommerce integration or extension? Check our Developer Resources.\n\nIf you weren’t able to find the information you need, please use the feedback thumbs below to let us know."
    },
    {
        "link": "https://woocommerce.com/document/configuring-woocommerce-settings",
        "document": "When you go to WooCommerce > Settings in your site’s WP Admin dashboard, you’ll notice tabs relating to the different kinds of settings available:\n\nNote: WooCommerce is highly extensible, open-source software. Extensions and plugins commonly add additional settings and tabs to the WooCommerce settings page(s). If you see additional settings to those pictured below or mentioned in the following pages, they have most likely been added by an extension/plugin, your theme, or custom code.\n\nYou’ll find your store’s general settings in WP Admin at WooCommerce > Settings > General.\n\nThese settings include your store’s location, where you’ll sell and ship orders, what to use as the default customer location, enabling or disabling taxes and coupons, and your store’s currency options.\n\nFor more details, see General settings.\n\nFind and edit product settings in WP Admin at WooCommerce > Settings > Products.\n\nThese settings determine which page is set as your main shop page, which units of measurement to use for product dimensions, product review settings, inventory management, stock notifications, how downloadable products are handled, and more.\n\nFor more details, see Products settings.\n\nFind and edit tax settings in WP Admin at WooCommerce > Settings > Tax.\n\nThe Tax settings tab won’t be visible until taxes are enabled in the general settings. WooCommerce’s built-in tax settings let you choose how taxes are displayed and calculated in your shop, you can also add tax rates for specific areas, and additional tax classes with different rates to be used for certain products or shipping costs.\n\nFor more details, see WooCommerce tax settings.\n\nFind and edit shipping settings in WP Admin at WooCommerce > Settings > Shipping.\n\nWooCommerce has several built-in shipping settings and methods that cover a wide range of use cases:\n\nThe main shipping settings screen is for shipping zones. Think of a shipping zone as a geographic region where a certain set of shipping methods and their rates will apply.\n\nLearn more at Setting up shipping zones.\n\nThe shipping settings page contains the following settings:\n• Calculations\n• Enable the shipping calculator on the cart page\n• Hide shipping costs until an address is entered\n• Shipping destination\n• Ship to a customer’s billing or shipping address by default, or only ship to the user’s billing address.\n• Debug mode\n• Enabling debug mode will display the customer’s matched shipping zone in a notice on the site’s front-end (see image below), and bypass the shipping rate cache. Enable for troubleshooting purposes.\n\nShipping classes can be used to enable shipping methods to provide different rates for different classes or types of products.\n\nLocal pickup allows the customer to pick up an order themselves — no shipping required. There are currently two ways to implement local pickup in the free, core WooCommerce plugin:\n• A modern, streamlined experience that is natively integrated with the block version of the checkout flow. Learn more at WooCommerce Blocks: Local pickup.\n• A legacy version that can be added to shipping zones as a WooCommerce core shipping method. This will work on either the shortcode or block version of the checkout. Learn more at Legacy Shipping Method: Local Pickup.\n\nWe recommend using only one method for local pickup to avoid confusion.\n\nIn WP Admin, navigate to WooCommerce > Settings > Payments to specify which payment gateways are enabled and configure their settings.\n\nUse the Enabled toggle to turn a gateway on or off:\n\nIf you try to enable a payment method that needs additional configuration, you’ll be redirected to the setup screen for that payment method.\n\nClicking the name of the payment gateway will take you to a screen to set up or adjust its settings. Another way to configure its settings is to click the Set up or Manage button for that particular payment gateway.\n\nInstalled gateways are listed in the table and can be dragged and dropped to control the order in which they display to customers on the checkout.\n\nSee the following pages for more payment gateway information:\n\nFind accounts and privacy settings in WP Admin at WooCommerce > Settings > Accounts & Privacy.\n\nHere, you can enable or disable guest checkout, control customer account creation, control how personal data is retained or removed from your shop, and set your privacy policy notices.\n\nFor more details, see Accounts & Privacy settings.\n\nYou can edit design elements of your store’s email template, change your store’s sending address, and configure your settings for (or disable) each email WooCommerce sends.\n\nFor more details, see Email settings.\n\nThis is where you enter your license key for the MaxMind geolocation integration. Extensions, plugins, themes, and other integrations may also add settings to this tab.\n\nFrom the site visibility settings, you’ll be able to enable Coming soon mode and share your under-construction store via a private link.\n\nLearn more about Coming soon mode.\n\nAdvanced settings allow you to set WooCommerce pages, integrate external applications with the REST API, add custom webhooks to your store, and enable new or experimental features like High-Performance Order Storage (HPOS) and the new product editor.\n\nFor more details, see Advanced settings.\n\nDo you still have questions and need assistance?\n• If you’re looking to extend the core functionality shown here, we recommend reviewing available extensions in the WooCommerce Marketplace.\n• Need ongoing advanced support or a customization built for WooCommerce? Hire a Woo Agency Partner.\n• Are you a developer building your own WooCommerce integration or extension? Check our Developer Resources.\n\nIf you weren’t able to find the information you need, please use the feedback thumbs below to let us know."
    },
    {
        "link": "https://woocommerce.com/document/woocommerce-shipping-and-tax/woocommerce-tax",
        "document": "This documentation is meant to help with setting up tax rates in the WooCommerce settings and how the platform handles taxes/VAT/GST based on these settings, but not when or what to charge. We’re not tax professionals, our advice is how to use our software. For specific advice when it comes to what or when to charge tax/VAT/GST etc… We recommend consulting with a tax professional or an accountant on what may be your best options. Each business is unique, and there’s no way we can cover every possibility.\n\nYou can find information on how to install the WooCommerce Shipping & Tax extension on the WooCommerce Shipping & Tax page. This documentation is around the extension’s tax functionality. For more details around general setting up of taxes in WooCommerce, please see the Setting up Taxes in WooCommerce documentation.\n\nTo enable automated tax calculation, first ensure that “enable taxes and tax calculations” is checked on WooCommerce > Settings > General.\n\nWith taxes enabled, go to WooCommerce > Settings > Tax, select “Enable automated taxes” and Save Changes.\n\nOnce Automated taxes are enabled, many of the settings are disabled as Automated taxes “take over” from the WooCommerce core tax settings. This means that “Display prices” will be set to Excluding tax and tax will be Calculated using Customer shipping address.\n\n\n\nJust of note, Automated tax calculation depends on prices to be entered exclusive of tax.\n\nWhen Automated taxes are in use, this overrides any tax rates you have manually added for locations where you have a tax nexus, as well as the “Compound” and “Shipping” toggles for those tax rates.\n\nAfter switching to automated rates, a backup of your previous tax rates is created and can be found in your sites folder.\n\nThe “Automated Taxes” feature supports United States, Canada, Australia, and United Kingdom based stores, plus a growing list of countries in the rest of the world including: Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, and Sweden.\n\n\n\nIf your store is based in the EU, we recommend using our EU VAT Number extension in addition to automated taxes.\n\nTo diagnose issues with your WooCommerce Shipping & Tax setup, go to WooCommerce > Status > WooCommerce Shipping & Tax.\n\nThe system status page displays issues that could cause WooCommerce Shipping & Tax to stop functioning and contains helpful debug information, plus links to get further assistance.\n\nThe most recent tax requests can be seen on the WooCommerce > Status > WooCommerce Shipping & Tax under the Taxes Log section. Older requests can be viewed by going to WooCommerce > Status > Logs.\n\nEven if the tax value for an order is 0.00, Automated Taxes may be working correctly.\n\nIf your store is based in, for instance, the United States, you only need to collect sales tax from customers in locations where you have a “tax nexus,” which typically means a physical presence. WooCommerce Shipping & Tax uses your store address (WooCommerce > Settings > General) as your “tax nexus”.\n\nYou can also have a tax nexus in another state if you exceed a certain yearly dollar value or order total to another state. If you are unsure of your tax nexus status, please consult a certified local accountant.\n\nIf you need to charge tax for any other state, you can add a tax rate for that state in addition to using automated taxes to charge customers from that state tax as well. For more information about your States Tax Nexus and Destination Tax rules, please have a look at: State-by-state guide to economic nexus laws.\n\nAccording to the Florida Department of Revenue, sales tax must be charged on shipping costs if the customer does not have an option to avoid paying the merchant for shipping costs by either picking up the merchandise themselves or arranging for a third party to pick up the merchandise and deliver it to them.\n\nFor merchants with Store Address (WooCommerce > Settings > General) set to Florida, we have enabled shipping tax for Florida by default since 1.26.0. If you would like to disable it, you can do so via a filter:\n\nIf for some reason you need to change your store address to another state, it is important that you check the settings you are using.\n\nWooCommerce Shipping & Tax uses your store address (WooCommerce > Settings > General), so it is important that you use this setting to add the new address where your store will be located. You will also need to delete all information that you added to the Standard tax rates (WooCommerce > Settings > Taxes > Standard rates tab). When using the automated rate rates, you’ll want to remove those standard rates to reset the plugin to your new location.\n\nReset the connection to WordPress.com by following this guide from our WooPayments documentation as the process is the same.\n\nIn Florida, sales associated with specific addresses may produce 0 tax, even if they are “Taxable”.\n\nAccording to the Florida Department of Revenue, specific addresses are allowed by the state to be exempt from state and local sales and use tax requirements. You can review and test the rates for specific addresses and ZIP Codes at the Florida PointMatch website.\n\n\n\nWe connect to your WordPress.com account to authenticate your site and user account so we can securely charge the payment method on file for any labels purchased. You can read our Terms of Service here.\n\nOn April 1st, 2019, WooCommerce Tax returned lower-than-expected sales tax rates for select merchants in California and Texas. The issue was caused by a scheduled system update on our tax rate provider’s systems. They quickly identified and resolved the issue. However, some merchants based in California and Texas may have been affected.\n\nThe issue would have caused under-collection of sales tax of 1% or up to 6.5% in Texas and California, respectively.\n\nTo know if your transactions were affected, they would need to meet all of the following criteria:\n\nYour store address is in California or Texas. You can check your store address in WooCommerce > Settings.Your store is using WooCommerce Tax. To check if the automated taxes feature is enabled look at the Automated taxes setting in WooCommerce > Settings > Tax. This tab is only visible if taxes are enabled.Your store had transactions during the affected time windows. To review your orders, go to WooCommerce > Reports and select the appropriate date range:\n• In California, we returned a lower-than-expected state rate from midnight UTC (5 pm PDT on March 31st) until the issue was resolved at 1:25 PM UTC (2:25 am PDT on April 1st.)\n• In Texas, we returned a lower-than-expected city rate from midnight UTC (7 pm CDT on March 31st) until the issue was resolved at 5:30 PM UTC (8:25 am PDT on April 1st.)\n\nIf your transactions were affected and your business uses the tax reports for reporting & filing, you likely need to manually correct the collection amount for those transactions before filing your sales tax returns. This Sales Tax Calculator could be a helpful tool.\n\nAs always, we recommend consulting with a tax professional or an accountant that can advise regarding any applicable laws to your state, country, or business. Each business is unique.\n\nOn July 1, 2021, new taxation rules will come into effect as part of the European Union (EU) Value-Added Tax (VAT) eCommerce package. When using WooCommerce Tax, the new changes will affect the following kinds of merchants:\n• EU merchants offering cross-border eCommerce within the EU above the EUR 10,000.00 threshold\n• Non-EU merchants selling into the EU and opting to collect the VAT during the checkout\n\nRead more about it in the WooCommerce blog: New EU Tax Regulations: What OSS and IOSS Means for Your Store\n\nConsult the European Commission: Modernizing VAT for cross-border eCommerce\n\nAs always, we recommend consulting with a tax professional to ensure your business is following regulations and best practice.\n\nOn January 24 2022, WooCommerce Tax started returning higher-than-expected sales tax for select merchants outside of California. The issue was caused by a misconfiguration on our end. Merchants situated outside of California that made sales to California customers have been affected, and started to collect tax for those customers.\n\nTo know if your store might be affected, you need to meet all the following criteria:\n• Your store has WooCommerce Shipping & Tax installed and enabled (you can check this in the Plugins menu in your WordPress dashboard)\n• Your store is situated outside of California (you can check this in WooCommerce > Settings > General, under the Country / State setting)\n• Your store is enabled to sell to California (you can check this in WooCommerce > Settings > General, under the Selling location(s) setting)\n• Your store has enabled taxes (you can check this in WooCommerce > Settings > General, under the Enable taxes checkbox)\n• Your store is enabled to automatically calculate taxes at checkout (you can check this in WooCommerce > Settings > Tax under the Automated taxes setting)\n\nTo resolve the issue for future orders, you will have to:\n• Remove the incorrect tax rates that are stored on your store\n• Correct the collected amounts for transactions made to customers in California\n\nWe recommend following the two steps in the order above.\n\nIn WooCommerce Shipping & Tax version 1.25.23 there’s now a built in tool to automatically remove incorrect tax rates, which automates the steps below. This can found at WooCommerce > Status > Tools > Delete California tax rates.\n\n\n\nOnce that is run, you can proceed to the Correct the collected transaction amount steps.\n• Go to WooCommerce > Tax and click Standard rates\n• Select any rows with a State code of CA\n• You can hold the Shift or Alt key on your keyboard to select more than one row at a time\n• Click Remove selected row(s) button at the bottom of the table\n• Click the Save button on the page\n• Find the orders placed by customers in California. To help with this task you can:\n• View the billing and shipping addresses by tweaking the columns under Screen options\n• Filter orders placed between January 24, 2022 and the date where you removed the incorrect taxes\n• For each order, follow the refund steps to refund the tax amounts (if any) for each sold item\n\nPlease note that the reports under Analytics > Taxes will be updated shortly after."
    },
    {
        "link": "https://funnelkit.com/woocommerce-taxes",
        "document": "Do you want to understand how WooCommerce taxes work and learn how to set them up in your store?\n\nTaxes are a critical component of any e-commerce business. It becomes quite important to ensure your business complies with different tax laws and regulations.\n\nHowever, setting up and managing taxes is probably one of the most difficult challenges you may face in your business.\n\nSince every product you sell has to be taxed as per your country’s regulations, it’s essential that you charge the correct amount from your buyers.\n\nAs a WooCommerce store owner, you can easily get confused about how to set up tax rates and still make profits on your products.\n\nThat’s why this guide is for you!\n\nIn this post, we’ll give you a walkthrough of setting up and efficiently handling WooCommerce taxes to ensure your online store complies with tax regulations.\n\nFurthermore, we’ll also look at how you can optimize your tax strategy for maximum efficiency.\n\nWhat are Woocommerce Taxes and Why are they Important?\n\nGenerally, taxes are the charges usually set up by the government and are compulsory to be paid by individuals and businesses. These financial contributions help the government to fund public goods and services and invest in the country’s infrastructure and various programs.\n\nEvery business needs to comply with tax-related rules and regulations.\n\nTo help you with that, WooCommerce has provided the tax features built into its platform.\n\nWooCommerce taxes are the tax-related functionalities of WooCommerce that determine how much tax a customer needs to pay for a product or service.\n\nWooCommerce taxes ensure you efficiently calculate and maintain taxation norms to comply with the regulations of different cities, countries or states for each product.\n\nHere are some reasons why setting up taxes in WooCommerce is essential:\n• Legal compliance - Tax laws and regulations vary for different regions and can be complex. If you fail to comply with these laws, it can result in massive penalties. That’s why WooCommerce helps you accurately collect and remit taxes, minimizing the risk of getting into any legal issues.\n• Transparency for shoppers - Taxes constitute a part of the total cost of products and services. This way, businesses display taxes clearly at the checkout, helping you ensure transparency in pricing and build trust with shoppers.\n• Accurate pricing - WooCommerce taxes lets you configure tax rates based on your customer’s location and the type of products you sell. This process ensures the pricing in your WooCommerce store remains accurate, provided tax rates apply to each transaction.\n• Financial reporting - WooCommerce keeps track of taxable sales, liabilities and tax collections in one place. You can use this information for financial planning, accounting, and tax reporting.\n• Tax efficiency - Setting up WooCommerce taxes helps streamline the tax collection process. This saves you time and effort in managing your business finances. Setting up automated tax calculations in WooCommerce helps reduce the risk of making errors.\n\nHow Do Taxes Work in WooCommerce?\n\nWooCommerce taxes work by configuring and applying tax rates to the products based on different factors. These factors include geographical location, tax class, product type, etc.\n\nBy default, WooCommerce lets you define product prices in two ways:\n\nThe combination of product prices and taxes of the store’s base country.\n\nPlease note that the tax calculations are done per line, not per item.\n\nHere’s how tax calculation will be done for a tax rate of 20%:\n\nLet’s look at the other one.\n\nHere, a product's listed price does not include any applicable taxes. Customers will be able to see the base price of a product before taxes are added to the final price.\n\nLet’s look at the tax calculation that will be done for a tax rate of 20% here:\n\nThat’s how simple it is.\n\nIf you want to calculate the taxes across different countries or regions, you can refer to the official WooCommerce document.\n\nThis document helps you calculate taxes across various countries for tax-exclusive and inclusive prices.\n\nHow to Enable Taxes in WooCommerce?\n\nWooCommerce lets you incorporate taxes into the product prices in your store.\n\nBy configuring WooCommerce taxes, store owners can ensure that they are charging the correct amount of taxes and maintain transparency so that the customers are aware of the taxes they are paying.\n\nBefore configuring taxes, you must enable it from the WooCommerce settings first.\n\nFor that, navigate to WooCommerce ⇨ Settings.\n\nThere, check the ‘Enable taxes and tax calculations’ option.\n\nScroll down and hit the ‘Save Changes’ button once done.\n\nThis will enable the tax-related functionalities in your store. WooCommerce will add a new taxes section in your store’s settings.\n\nHow to Configure WooCommerce Tax Options and Settings?\n\nIn this section, we’ll go through different tax-related settings in WooCommerce.\n\nThis setting is about choosing whether your product prices are inclusive or exclusive of WooCommerce taxes.\n\nIf you choose prices exclusive of tax, WooCommerce will automatically calculate and add the taxes to the final price during checkout.\n\nHowever, if you choose prices inclusive of taxes, all the costs will be added to the product price and displayed based on your store’s base tax rate.\n\nThis option helps calculate taxes based on the following:\n\nThe first two settings will calculate taxes based on your customer’s shipping and billing addresses respectively.\n\nYou can even turn on the option to Geolocate to determine the customer's default location. Go to WooCommerce general settings to enable this option:\n\nIf you choose your store’s base address, taxes will be calculated as per the location of your store instead of the customer’s address.\n\nA shipping tax class determines the tax rate for the shipping or delivery charges associated with different products and services.\n\nBy default, shipping tax classes are based on the items in the user’s shopping cart.\n\nIf a user buys an item with a specific tax rate, the shipping tax will be calculated at that rate. You should choose a different tax class if it isn’t allowed in your tax jurisdiction.\n\nThis checkbox typically specifies whether you should or not round the tax at the subtotal level.\n\nEnable this option to round tax prices to a subtotal level rather than the default per-line rounding.\n\nDisplay prices on the shop, during cart and checkout\n\nThese two WooCommerce sales tax settings determine the price display (whether excluding or including taxes) in your store.\n\nYou can specify how product prices will show up on the shop page, during the cart and checkout page.\n\nFill in the text to display next to your product’s prices. You can include something like “Inclusive of taxes”, “VAT included”, ”Exclusive of taxes”, etc.\n\nThis setting lets you specify how the tax total will be displayed during checkout.\n\nIt gives you the option of whether you want to show multiple taxes pooled as a total or each listed as a separate entity.\n\nOnce you’re done, hit the ‘Save Changes’ button.\n\nThis was all about configuring the options and settings for WooCommerce taxes.\n\nWooCommerce tax classes are the additional categories used to group different types of products in your store.\n\nIt helps you calculate and apply taxes on different types of products you sell based on the tax regulations in your area.\n\nWhen to use tax classes\n\nTax classes help you categorize and assign tax rates to different types of products in your online store.\n\nSuppose you sell products taxed by different rates, such as 8% and 15%, in your store. Then, it’ll be best to create two WooCommerce tax classes. One can be Electronics (or just 8%) and the other can be Beauty (or just 15%).\n\nThis will make it easier for you to configure products. All you have to do is choose the suitable class for your products and the particular tax rate will be applied to your product.\n\nNext, if you want to sell products to foreign countries where different WooCommerce taxes are applicable.\n\nFor example, let’s say you want to impose a 20% tax rate in the United Kingdom and a 27% tax rate in Switzerland. In this case, you can set different tax rates for different countries by adding the country code in the WooCommerce tax classes section.\n\nBy default, WooCommerce lets you set up standard tax rates under the ‘Standard Rates’ class.\n\nClick on ‘Insert Row’ to enter a new tax rate.\n\nLet’s set up our standard taxes by going through the detailed process.\n\nHere, you can set up standard tax rates for geographical areas:\n• Country code - Enter a two-digit country code per the standard ISO 3166-1 alpha-2. Leaving this field blank will apply the tax rate to all countries.\n• State code - Specify the two-digit state code. You can also leave the field empty if you want the tax rate to apply to all the states of your chosen country.\n• ZIP/Postcode - Enter the individual or multiple ZIP / postal codes separated by semicolons. Leaving the field blank will apply the same tax to all the areas.\n• City - Enter the name of the city or cities to which you want to apply this tax rate. You can enter multiple cities separated by commas. Leave this field empty to apply this tax rate to all cities.\n• Rate % - Enter the tax value in percentage up to 4 decimal places. For example, 14.0000 or 8.3333.\n• Tax name - Specify the name of this tax that will be visible to the shoppers in your WooCommerce store along with invoices.\n• Priority - Decide the priority of tax rates related to deciding which one should be applied first. Please note that the priority number has to be different for different tax rates you specify here; otherwise, only one tax will be mentioned in your invoices.\n• Compound - Enable this field to specify this tax rate as a combination rate. The compound rate will be applicable after the calculation of other taxes. This means that the tax rate for which you have enabled this field, a compound tax will be applied to the already taxed product.\n\nLet’s understand a bit more about priority and compound in WooCommerce taxes.\n\nPriority and compound are essential when a country has national and local taxes.\n\nLet’s say the national tax is 30% and a particular city or state applies an additional 5% tax, which has to be added for customers of that city.\n\nIn this case, priorities and compound will be crucial to calculate taxes accurately.\n\nWooCommerce gives you the option whether you want to apply the tax rate to shipping costs.\n\nPlease note that you must have at least one rate for shipping; otherwise, it will not be taxed. If you select multiple tax rates for shipping, the tax will be applied based on the priority.\n\nThis will add the sales/VAT taxes to the shipping charges.\n\nStandard tax classes determine the tax rates for assigned products in your WooCommerce store.\n\nIn most cases, the default WooCommerce tax classes work. However, all businesses have different requirements, so WooCommerce allows you to create additional tax classes.\n\nYou can do it from the ‘Tax Options’ tab under the WooCommerce taxes settings.\n\nThese classes will appear as additional sections or tabs in the taxes menu.\n\nSetting up these additional tax classes is similar to standard rates, as explained in the complete process above.\n\nOnce done, you can assign these additional tax classes to your WooCommerce products.\n\nFor that, go to Products - edit the selected product. Under the Product Data - General tab, set the tax class for your product.\n\nOnce done, hit ‘Update’ to save your changes. This way, you'll get the tax rate for this product in WooCommerce.\n\nWell done! This is how you can set up additional tax classes in WooCommerce.\n\nYou can delete individual tax rates or all of them in bulk.\n\nTo remove each tax rate individually, click on a row to select it and hit ‘Remove selected row(s)’.\n\nTo delete all tax rates, go to WooCommerce ⇨ Status. Under the Tools section, click on the ‘Delete WooCommerce tax rates’ button.\n\nThis will remove all the tax rates in WooCommerce. Please note that this action cannot be reversed.\n\nNow, if we add products to the cart and head to the checkout page, we’ll see the tax rates below the subtotal and shipping charges.\n\nThe total value of the product becomes a total of subtotal, shipping and taxes. This is the value that a shopper has to pay for a successful purchase.\n\nIt helps maintain transparency as to the amount you collect taxes per tax laws and regulations.\n\nPlease note that we have used a custom store checkout page to replace the default WooCommerce checkout with the plugin - FunnelKit Funnel Builder.\n\nIt helps you design beautiful sales funnels that increase sales and conversions in your WooCommerce store.\n\nHow to Import and Export WooCommerce Tax Rates?\n\nWooCommerce allows you to import or export different configurations of tax rates in your store. You can do this by importing or exporting a CSV file.\n\nThis is useful if you want to set up multiple tax rates in your WooCommerce store quickly.\n\nTo import tax rates, click on ‘Import CSV’ under any tax rate options available in WooCommerce.\n\nFor example, we’ve downloaded the ready-to-import EU CSV sample from WooCommerce with tax rates on our device. Let’s now import this file here.\n\nEnter the path to store this file on the server.\n\nThis CSV file will help ensure your tax rates are correctly set up. You’ll be able to generate WooCommerce invoices and safely keep an account of critical data.\n\nOnce you’ve configured your WooCommerce tax rates and classes, you can export all the data and keep it safe in a CSV file format on your device.\n\nAll you have to do is hit the ‘Export CSV’ button and your data will be exported to your system.\n\nSo, this is how you can import and export WooCommerce tax rates.\n\nHow to View Your WooCommerce Tax Reports?\n\nOnce you’ve set up and configured WooCommerce taxes, it’ll automatically get applied when customers make their purchases.\n\nTo keep track of taxable sales and liabilities, WooCommerce keeps this information that can be used for financial planning and tax reporting purposes.\n\nHere, you’ll be able to see the complete tax reports for your WooCommerce store including:\n\nYou can select a date range to see the data for that particular time period.\n\nTo compare reports for different tax codes, go to the Show field and select ‘Comparison’. Just enter the WooCommerce tax codes you want to compare in your store.\n\nHere’s how you can set up tax codes to compare:\n\nIf you scroll down to the bottom of this analytics page, you’ll see a breakdown of the taxes.\n\nIt'll show the tax code, tax rate, total tax, order tax, shipping tax and number of orders placed.\n\nThis tool is great for comparing the different tax rates.\n\nIf you want to look at a more advanced tax reporting tool that sorts your taxes by code or date, navigate to WooCommerce ⇨ Reports.\n\nUnder the Taxes section, you’ll see all the tax reports collected in your store.\n\nYou can even specify a custom date and see the data for that period.\n\nHow to Programmatically Calculate Sales Taxes in WooCommerce?\n\nIf you don’t want to configure and manage WooCommerce taxes manually, you can find many WordPress plugins to help you automatically calculate sales taxes.\n\nTo set up automated taxes in WooCommerce, you can use an official plugin - WooCommerce Tax. You’ll also be asked to install Jetpack to unlock the complete functionality of WooCommerce services for the shipping & tax plugin.\n\nOnce you’ve installed and activated the plugin on your dashboard, go to WooCommerce ⇨ Settings.\n\nUnder the WooCommerce tax settings, select the ‘Enable automated taxes’ option.\n\nOnce done, hit the ‘Save Changes’ button.\n\nPlease note that when you enable automated WooCommerce taxes, many settings here will get disabled because the plugin overrides the core tax settings.\n\nWhen you enable the automated taxes, they take over any manually added tax rates that you may have added.\n\nMake sure to enable logging if some problems occur with the configuration of automated taxes.\n\nThis will assist you in diagnosing and troubleshooting WooCommerce taxes.\n\nTo enable logging, navigate to WooCommerce ⇨ Status. Under the WooCommerce Shipping & Tax section, turn the toggle to enable logging.\n\nThe debug log will enable you to display issues on the system status page. It includes useful debugging information along with links to additional assistance to help you.\n\nIf you want alternative WooCommerce tax plugins to automate the sales tax in your store, here are some effective WordPress tools you can try:\n\nThese WooCommerce sales tax plugins are the automated Woocommerce taxes calculators that help you automate sales tax calculations in your store.\n\nAre You Ready to Configure WooCommerce Taxes in Your Store?\n\nWe hope you’ve understood everything you need to know about setting, configuring and managing WooCommerce taxes in your online store.\n\nBy default, WooCommerce offers various options to set up taxes in your store.\n\nYou can configure the display prices inclusive or exclusive of taxes, calculate taxes as per customer’s location, add tax rates for different countries, and more.\n\nFor that, this guide will help you comply with certain tax regulations.\n\nFurthermore, if you don’t want a manual tax setup, you can use a WooCommerce tax plugin to automate your sales taxes.\n\nNot just that, if you want to use custom checkout or effective sales funnels, you can download the FunnelKit Funnel Builder on your WordPress website.\n\nIt helps you enhance your store’s conversions by setting up custom checkouts and AOV-boosting offers.\n\nIt’s a great way to boost your profits and make big sales by setting up sales funnels and tracking your conversions.\n\nSo what are you waiting for?"
    }
]