[
    {
        "link": "https://xmacro.sourceforge.net",
        "document": ""
    },
    {
        "link": "https://github.com/alvatar/xmacro/blob/master/HOWTO",
        "document": "For more complex (and up-to-date) X controlling try \"xautomation\" tools - http://hoopajoo.net/projects/xautomation.html\n\nGentoo: it is \"obsolete\" - it hasn't been updated long time, so you must download it from Internet - but it is still fully functional!\n\nUbuntu: it is still included in universe package source\n\n-k KEYCODE the keycode for the key used for quitting.\n\n* You can add some \"Delay 1\" lines, when you have long list of keys\n\n* The last command MUST NOT end with \"new line\"\n\n5) Replay your \"macro\" to X11 server (I recommend to use delay for event ~30ms):"
    },
    {
        "link": "https://github.com/franciscod/xmacro",
        "document": ""
    },
    {
        "link": "http://linuxpoison.blogspot.com/2012/03/record-play-keystrokes-and-mouse.html",
        "document": "Thepackage contains two simple, C++ programs () for recording and replaying keyboard and mouse events on an X server. This functionality is achieved through the XTest extension. The programs are heavily based on the xremote utility of Jan Ekholm (chakie at infa.abo.fi).Grabs all the control over your local display and send the mouse and keyboard events to the remote display. In the meantime it emitsandlines to the standard output. It emits MotionNotify lines only if the event struct of the above four events contains different coordinates than the previous event or a mouse button is pressed during the movement.can be used to playback recorded events or send any other mouse/keyboard events you choose. It is very handy for scripting an X display - for example running some smoke tests on the GUI application.Open the terminal and type following command to install Xmacro:The first thing you need to do is to record the events () and for this you need to use xmacrorec2 package of Xmacro, open the terminal and type following command to record and store these events in a text file:This will bring up a prompt () where you need to input any keystroke to tell xmacrorec2 to \"stop\" the record.: As xmacrorec doesn't save the timestamps of the event, you may need to insert Delay statements into the recorded file!"
    },
    {
        "link": "http://l3oc.com/2015/05/linux-keyboard-and-mouse-macros.html",
        "document": "Macros are the simple way to automatize tasks, plus speed. Just record a sequence of keystrokes or mouse moves and clicks in a macro file, and then play it! Here you can see how to record and play a macro in Linux. Macros are the simple way to automatize tasks, plus speed. Just record a sequence of keystrokes or mouse moves and clicks in a macro file, and then play it! Here you can see how to record and play a macro in Linux.\n\nTwo things important here, the \":0\" is your display number, it will be needed to play your macro. And the stop key to stop the macro recording, as suggested by the tool, just hit Esc to proceed and then Esc again when you want stop the macro recording.\n\nTo play the macro, just use this (don't forget to use your display number):\n\nNow you should see your mouse/keyboard or whatever you recorded, repeating the process. As you will see, the macro speed is very fast, if you want place some delay between the actions, just edit the .macro file and place a delay command line (delay in seconds):"
    },
    {
        "link": "https://softwarerecs.stackexchange.com/questions/51193/mouse-and-keyboard-recording-and-replaying-on-linux",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://linuxuprising.com/2020/03/how-to-record-and-play-mouse-and.html",
        "document": "\n• Record and play the mouse movement / clicks and keyboard presses on demand\n• Save the capture (macro) as a script and run it independently of Atbswp\n• Can use hotkeys to start recording and playback\n• Allows repeating a capture for a given number of times or indefinitely\n\nHow to use Atbswp desktop automation tool to record your mouse and keyboard actions, and play them back automatically on demand\n\nThis application can be useful to automate some demo for example, or to perform long tasks that require clicking on the same items over and over again. In case you want to automate repetitive typing (text expansion), I recommend AutoKey instead.Atbswp desktop automation tool features:Atbswp doesn't have image recognition to identify user interface elements, like SikuliX for example.You might also like: How To Bind Mouse Buttons To Keyboard Keys Or Commands (Linux Using X11) I'll start by showing you a short video demo of Atbswp macro recorder, then I'll explain how to use it to record and play your mouse movement and clicks, as well as the keyboard key presses:In this video I begin by clickingin Atbswp, then perform some mouse and keyboard actions. Then I stop the capture in Atbswp by clickingagain, and finally I clickto let Atbswp play back the keyboard and mouse actions it recorded.This is how to use Atbswp keyboard and mouse macro recorder.To start capturing your mouse movement and clicks, as well as keyboard key presses, click thebutton.When you're done capturing everything you need to play back later, press thebutton again to stop capturing.To execute the mouse and keyboard events that you've recorded, click thebutton.To save the capture on disk for future use, so you can load it in Atbswp and play it without having to record it again, click thebutton.You can save the recorded mouse and keyboard events as a stand-alone script that you can later run independently of Atbswp. This can be done by clicking on thebutton. Once saved, make the file executable (e.g.), and run it in a terminal (in the folder where you saved) or by double-clicking on the file (if your file manager allows this).Use the instructions from there to download and run it.Each time you want to launch Atbswp desktop automation tool you'll need to open a terminal, navigate to the folder where you've cloned the Atbswp Git repository, and runthere, e.g. (assuming you've cloned Atbswp in your home directory):Or you can create a new applications menu entry (using an application like MenuLibre for example) with(replace with the path to) as thecommand."
    },
    {
        "link": "http://linuxpoison.blogspot.com/2012/03/record-play-keystrokes-and-mouse.html",
        "document": "Thepackage contains two simple, C++ programs () for recording and replaying keyboard and mouse events on an X server. This functionality is achieved through the XTest extension. The programs are heavily based on the xremote utility of Jan Ekholm (chakie at infa.abo.fi).Grabs all the control over your local display and send the mouse and keyboard events to the remote display. In the meantime it emitsandlines to the standard output. It emits MotionNotify lines only if the event struct of the above four events contains different coordinates than the previous event or a mouse button is pressed during the movement.can be used to playback recorded events or send any other mouse/keyboard events you choose. It is very handy for scripting an X display - for example running some smoke tests on the GUI application.Open the terminal and type following command to install Xmacro:The first thing you need to do is to record the events () and for this you need to use xmacrorec2 package of Xmacro, open the terminal and type following command to record and store these events in a text file:This will bring up a prompt () where you need to input any keystroke to tell xmacrorec2 to \"stop\" the record.: As xmacrorec doesn't save the timestamps of the event, you may need to insert Delay statements into the recorded file!"
    },
    {
        "link": "https://linuxquestions.org/questions/linux-software-2/record-click-events-and-play-them-back-657021",
        "document": "Start by using xmacrorec2 to record the actions (don't use xmacrorec, because it only records actions on remote systems. xmacrorec2 is a newer version that will work on the host system):\n\n When you start it, it will ask you for a keyboard key to press to stop the recording. Choose one that won't be used in the macro, like printscreen or something. Then whatever mouse and keyboard actions you do will be recorded to the file.\n\n \n\n When finished, play the file back using 'xmacroplay macrofile.txt'. Unfortunately, xmacro does not record timing info, so the file will play back at insanely fast speed. If you want to slow it down you have to go in and edit the macro file and place delay lines (\"Delay n\" seconds) between each command. Kind of a pain.\n\n \n\n \n\n 2) I just discovered this new macro recorder 1) The traditional way is to use xmacro Start by using xmacrorec2 to record the actions (don't use xmacrorec, because it only records actions on remote systems. xmacrorec2 is a newer version that will work on the host system):When you start it, it will ask you for a keyboard key to press to stop the recording. Choose one that won't be used in the macro, like printscreen or something. Then whatever mouse and keyboard actions you do will be recorded to the file.When finished, play the file back using 'xmacroplay macrofile.txt'. Unfortunately, xmacro does not record timing info, so the file will play back at insanely fast speed. If you want to slow it down you have to go in and edit the macro file and place delay lines (\"Delay n\" seconds) between each command. Kind of a pain.2) I just discovered this new macro recorder JW Record Playback . I haven't tried it yet, but it looks more user friendly than the old xmacro way. And it appears to keep timing info too. I'm not sure I like that big gui window though, seems like unnecessary clutter. Check it out."
    },
    {
        "link": "https://reddit.com/r/linux4noobs/comments/1dwxg6q/automate_mouse_clicks_and_movement",
        "document": "I’m running the latest Ubuntu distro. I’m currently sitting through a 20 hour online class that is repeating the exact same material from a class I took this past week. I’d like to automate page forward and page back in Firefox, but I can’t figure out anything with the extensions available.\n\nIs there a way I can automate this?"
    }
]