[
    {
        "link": "https://stackoverflow.com/questions/77555173/windows-batch-script-to-add-entry-to-registry",
        "document": "I'm attempting to create a batch script that would reproduce an entry in the registry I created manually. The script is going to be part of the installation process for a small WEB application I'm working on.\n\nThe needed entry into the registry is in fact the definition of a custom protocol to be invoked from JavaScript to activate an external process (in this case, a PowerShell script).\n\nThe manually generate entry is shown in the following snapshot and it works as needed:\n\nThe script I have so far correctly replicates the shown entry except for the last one (the part) is complaining about a syntax error. Here is the piece of script hat attempts to register the last part of the definition and is triggering the error message:\n\nWhat is syntax error (in the command)?"
    },
    {
        "link": "https://stackoverflow.com/questions/9315289/batch-file-if-registry-keys-data-is-equal-to",
        "document": "I'm trying to make a .bat toggler for certain Explorer settings. To do this I need the batch file to query the Registry key's data and then set the key accordingly. For example, in ActionScript 3 or JavaScript it would be something along the lines of this:\n\nThis way, every time it runs it will set the key's data to be the opposite of what it currently is - a toggler.\n\nI have Google-d this extensively and after quite a long time of chopping up and splicing multiple examples, I eventually got this:\n\nIf I remove the from the then it returns the accurate data value of the key without error. I have also tried it with , and and they didn't work either."
    },
    {
        "link": "https://superuser.com/questions/761008/add-registry-key-entries-using-batch-file",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://tutorialspoint.com/batch_script/batch_script_adding_registry.htm",
        "document": ""
    },
    {
        "link": "https://superuser.com/questions/995591/how-to-get-a-registry-value-and-set-into-a-variable-in-batch",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/reg",
        "document": "Performs operations on registry subkey information and values in registry entries.\n\nSome operations enable you to view or configure registry entries on local or remote computers, while others allow you to configure only local computers. Using reg to configure the registry of remote computers limits the parameters that you can use in some operations. Check the syntax and parameters for each operation to verify that they can be used on remote computers.\n\nDon't edit the registry directly unless you have no alternative. The registry editor bypasses standard safeguards, allowing settings that can degrade performance, damage your system, or even require you to reinstall Windows. You can safely alter most registry settings by using the programs in Control Panel or Microsoft Management Console (MMC). If you must edit the registry directly, back it up first."
    },
    {
        "link": "https://learn.microsoft.com/en-us/troubleshoot/windows-server/performance/windows-registry-advanced-users",
        "document": "This article describes the Windows registry and provides information about how to edit and back it up.\n\nThe Microsoft Computer Dictionary, Fifth Edition, defines the registry as:\n\nA central hierarchical database used in Windows 98, Windows CE, Windows NT, and Windows 2000 used to store information that is necessary to configure the system for one or more users, applications, and hardware devices.\n\nThe Registry contains information that Windows continually references during operation, such as profiles for each user, the applications installed on the computer and the types of documents that each can create, property sheet settings for folders and application icons, what hardware exists on the system, and the ports that are being used.\n\nThe Registry replaces most of the text-based .ini files that are used in Windows 3.x and MS-DOS configuration files, such as the Autoexec.bat and Config.sys. Although the Registry is common to several Windows operating systems, there are some differences among them. A registry hive is a group of keys, subkeys, and values in the registry that has a set of supporting files that contain backups of its data. The supporting files for all hives except HKEY_CURRENT_USER are in the folder on Windows NT 4.0, Windows 2000, Windows XP, Windows Server 2003, and Windows Vista. The supporting files for HKEY_CURRENT_USER are in the folder. The file name extensions of the files in these folders indicate the type of data that they contain. Also, the lack of an extension may sometimes indicate the type of data that they contain.\n\nIn Windows 98, the registry files are named User.dat and System.dat. In Windows Millennium Edition, the registry files are named Classes.dat, User.dat, and System.dat.\n\nThe following table lists the predefined keys that are used by the system. The maximum size of a key name is 255 characters.\n\nThe following table lists the data types that are currently defined and that are used by Windows. The maximum size of a value name is as follows:\n\nLong values (more than 2,048 bytes) must be stored as files with the file names stored in the registry. This helps the registry perform efficiently. The maximum size of a value is as follows:\n\nBefore you edit the registry, export the keys in the registry that you plan to edit, or back up the whole registry. If a problem occurs, you can then follow the steps in the Restore the registry section to restore the registry to its previous state. To back up the whole registry, use the Backup utility to back up the system state. The system state includes the registry, the COM+ Class Registration Database, and your boot files. For more information about how to use the Backup utility to back up the system state, see the following articles:\n• None Back up and restore your PC\n• None How to use the backup feature to back up and restore data in Windows Server 2003\n\nTo modify registry data, a program must use the registry functions that are defined in Registry Functions.\n\nAdministrators can modify the registry by using Registry Editor (Regedit.exe or Regedt32.exe), Group Policy, System Policy, Registry (.reg) files, or by running scripts such as VisualBasic script files.\n\nWe recommend that you use the Windows user interface to change your system settings instead of manually editing the registry. However, editing the registry may sometimes be the best method to resolve a product issue. If the issue is documented in the Microsoft Knowledge Base, an article with step-by-step instructions to edit the registry for that issue will be available. We recommend that you follow those instructions exactly.\n\nYou can use Registry Editor to do the following actions:\n\nThe navigation area of Registry Editor displays folders. Each folder represents a predefined key on the local computer. When you access the registry of a remote computer, only two predefined keys appear: HKEY_USERS and HKEY_LOCAL_MACHINE.\n\nMicrosoft Management Console (MMC) hosts administrative tools that you can use to administer networks, computers, services, and other system components. The Group Policy MMC snap-in lets administrators define policy settings that are applied to computers or users. You can implement Group Policy on local computers by using the local Group Policy MMC snap-in, Gpedit.msc. You can implement Group Policy in Active Directory by using the Active Directory Users and Computers MMC snap-in. For more information about how to use Group Policy, see the Help topics in the appropriate Group Policy MMC snap-in.\n\nCreate a Registration Entries (.reg) file that contains the registry changes, and then run the .reg file on the computer where you want to make the changes. You can run the .reg file manually or by using a logon script. For more information, see How to add, modify, or delete registry subkeys and values by using a Registration Entries (.reg) file.\n\nThe Windows Script Host lets you run VBScript and JScript scripts directly in the operating system. You can create VBScript and JScript files that use Windows Script Host methods to delete, to read, and to write registry keys and values. For more information about these methods, visit the following Microsoft Web sites:\n\nWindows Management Instrumentation (WMI) is a component of the Microsoft Windows operating system and is the Microsoft implementation of Web-Based Enterprise Management (WBEM). WBEM is an industry initiative to develop a standard technology for accessing management information in an enterprise environment. You can use WMI to automate administrative tasks (such as editing the registry) in an enterprise environment. You can use WMI in scripting languages that have an engine on Windows and that handle Microsoft ActiveX objects. You can also use the WMI Command-Line utility (Wmic.exe) to modify the Windows registry.\n\nFor more information about WMI, see Windows Management Instrumentation.\n\nFor more information about the WMI Command-Line utility, see A description of the Windows Management Instrumentation (WMI) command-line utility (Wmic.exe).\n\nYou can use the Console Registry Tool for Windows (Reg.exe) to edit the registry. For help with the Reg.exe tool, type at the Command Prompt, and then click OK.\n\nTo restore the registry, use the appropriate method.\n\nTo restore registry subkeys that you exported, double-click the Registration Entries (.reg) file that you saved in the Export registry subkeys section. Or, you can restore the whole registry from a backup. For more information about how to restore the whole registry, see the Method 2: Restore the whole registry section later in this article.\n\nTo restore the whole registry, restore the system state from a backup. For more information about how to restore the system state from a backup, see How to use Backup to protect data and restore files and folders on your computer in Windows XP and Windows Vista.\n\nFor more information, visit the following Web sites:\n\nThe Windows Server Catalog of Tested Products is a reference for products that have been tested for Windows Server compatibility.\n\nData Protection Manager (DPM) is a key member of the Microsoft System Center family of management products and is designed to help IT professionals manage their Windows environment. DPM is the new standard for Windows backup and recovery and delivers continuous data protection for Microsoft application and file servers that use seamlessly integrated disk and tape media. For more information about how to back up and restore the registry, see How to back up and restore the registry in Windows XP and Windows Vista."
    },
    {
        "link": "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/windows-commands",
        "document": "All supported versions of Windows and Windows Server have a set of Win32 console commands built in. This set of documentation describes the Windows Commands you can use to automate tasks by using scripts or scripting tools.\n\nWindows has two command-line shells: the Command shell and PowerShell. Each shell is a software program that provides direct communication between you and the operating system or application, providing an environment to automate IT operations.\n\nThe Command shell was the first shell built into Windows to automate routine tasks, like user account management or nightly backups, with batch (.bat) files. With Windows Script Host, you could run more sophisticated scripts in the Command shell. For more information, see cscript or wscript. You can perform operations more efficiently by using scripts than you can by using the user interface. Scripts accept all commands that are available at the command line.\n\nPowerShell was designed to extend the capabilities of the Command shell to run PowerShell commands called cmdlets. Cmdlets are similar to Windows Commands but provide a more extensible scripting language. You can run both Windows Commands and PowerShell cmdlets in PowerShell, but the Command shell can only run Windows Commands and not PowerShell cmdlets.\n\nFor the most robust, up-to-date Windows automation, we recommend using PowerShell instead of Windows Commands or Windows Script Host for Windows automation.\n\nA reference of exit and error codes for Windows Commands can be found in the Debug system error codes articles that may be helpful to understanding errors produced. Windows Commands also include command redirection operators. To learn more of their use, see Using command redirection operators.\n\nYou can configure the Command shell to automatically complete file and directory names on a computer or user session when a specified control character is pressed. By default this control character is configured to be the tab key for both file and directory names, although they can be different. To change this control character, run and navigate to either of the following registry keys and entries, depending on whether you wish to change the value for the current user only, or for all users of the computer.\n\nSet these values to that of the control character you wish to use. See virtual key codes for a complete list. To disable a particular completion character in the registry, use the value for space (0x20) as it isn't a valid control character. The type of value for this registry entry is REG_DWORD, and can also be specified by hexadecimal or decimal value.\n\nYou can also enable or disable file and directory name completion per instance of a Command shell by running with the parameter and switch or . If name completion is enabled with the parameter and switch, the two control characters used are for directory name completion and for file name completion. User-specified settings take precedence over computer settings, and command-line options take precedence over registry settings.\n\nTo find information about a specific command, in the following A-Z menu, select the letter that the command starts with, and then select the command name."
    },
    {
        "link": "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/reg-query",
        "document": "Returns a list of the next tier of subkeys and entries that are located under a specified subkey in the registry.\n• None The return values for the reg query operation are:\n\nTo display the value of the name value Version in the HKLM\\Software\\Microsoft\\ResKit key, type:\n\nTo display all subkeys and values under the key HKLM\\Software\\Microsoft\\ResKit\\Nt\\Setup on a remote computer named ABC, type:\n\nTo display all the subkeys and values of the type REG_MULTI_SZ using # as the separator, type:\n\nTo display the key, value, and data for exact and case sensitive matches of SYSTEM under the HKLM root of data type REG_SZ, type:\n\nTo display the key, value, and data that match 0F in the data under the HKCU root key of data type REG_BINARY, type:\n\nTo display the keys, values, and data that match asp.net under the key HKLM\\SOFTWARE\\Microsoft and all subkeys, type:\n\nTo display only the keys that match asp.net under the key HKLM\\SOFTWARE\\Microsoft and all subkeys, type:\n\nTo display the value and data for value names of null (default) under HKLM\\SOFTWARE, type:"
    },
    {
        "link": "https://simeononsecurity.com/guides/windows-registry-command-line-tips",
        "document": "The Windows Registry is a crucial component of the Windows operating system, storing configuration settings and options for both the OS itself and installed applications. While there are graphical tools available to interact with the registry, the command line provides a more efficient and direct way to query and modify registry keys using the reg command. This article will guide you through the process of working with the Windows Registry via the command line, highlighting the importance of caution and providing examples of common registry tweaks.\n\nIntroduction to the Windows Registry and Command Line Access #\n\nThe Windows Registry serves as a hierarchical database that contains settings and information essential for the proper functioning of the Windows OS. It is organized into keys, subkeys, and values, resembling a file system. The reg command allows users to interact with the registry directly from the command line interface.\n\nTo open a command prompt with administrative privileges, press Win + X and choose Command Prompt (Admin). Alternatively, you can use Win + R, type cmd, and press Ctrl + Shift + Enter.\n\nTo query the registry, use the reg query command followed by the key path. For instance, to retrieve information about the current user’s desktop wallpaper, you can use:\n\nThis command will display the wallpaper’s file path and other relevant details.\n\nUse the reg query command with the switch to enumerate all subkeys within a given key:\n\nThis will display a list of all subkeys and their values under the specified key.\n\nTo create a new registry key, use the reg add command. For instance, to add a new key named “MyKey” under the current user’s hive, you can use:\n\nTo add a new string value within this key, you can use the following command:\n\nYou can use the reg import command to apply changes stored in a .reg file:\n\nFor exporting registry data to a .reg file, the reg export command is used:\n\nIt’s important to exercise extreme caution when modifying the registry via the command line. A single mistake can lead to system instability or even prevent Windows from booting. Always create a backup before making any changes.\n\nTo change the default web browser using the registry, navigate to:\n\nLocate the Progid value and modify it to the desired browser’s identifier (e.g., ChromeHTML for Google Chrome).\n\nWindows telemetry gathers usage and performance data. To disable it, navigate to:\n\nCreate a DWORD value named AllowTelemetry and set its data to 0.\n\nMastering the art of working with the Windows Registry through the command line can provide you with greater control over your system’s configuration. However, always proceed with caution, and consider referring to official Microsoft documentation and guidelines. The reg command offers a powerful means of interacting with the registry, but its power comes with great responsibility. Stay informed, back up your data, and make changes only when necessary and well-understood."
    }
]