[
    {
        "link": "https://cisco.com/c/en/us/td/docs/security/asa/asa84/configuration/guide/asa_84_cli_config/basic_hostname_pw.pdf",
        "document": ""
    },
    {
        "link": "https://cisco.com/c/en/us/support/docs/switches/catalyst-6000-series-switches/10581-6.html",
        "document": ""
    },
    {
        "link": "https://cisco.com/c/en/us/support/docs/smb/switches/cisco-small-business-300-series-managed-switches/smb5563-configure-password-settings-on-a-switch-through-the-command.html",
        "document": ""
    },
    {
        "link": "https://enumerateit.com/basic-cisco-configuration-how-to-set-up-hostnames-banners-passwords-and-save-configurations",
        "document": "Are you new to Cisco networking or preparing for your CCNA certification? Understanding how to configure hostnames, banners, passwords, and save configurations is essential for managing Cisco routers and switches. In this blog, we’ll walk you through the basic Cisco commands to set up and secure your devices. Whether you’re a beginner or an IT professional, this guide will help you get started with Cisco configurations.\n\nCisco devices are the backbone of modern networks. Knowing how to configure them is crucial for:\n• Ensuring configurations are saved and persist after reboots.\n\nBy mastering these basic commands, you’ll be able to set up and manage Cisco routers and switches with confidence.\n\nThe hostname is used to identify the device in the network. Here’s how to set it up:\n• Set the hostname:bashCopyhostname R1 # Replace “R1” with your desired hostnameExample:bashCopyhostname Router1\n\nBanners are messages displayed to users when they access the device. The most common banner is the Message of the Day (MOTD).\n• Configure the MOTD banner:bashCopybanner motd #Your Message Here#Example:bashCopybanner motd #Unauthorized access is prohibited.#\n• The symbols are delimiters and can be replaced with any character not used in the message.\n\nPasswords are used to secure access to the device. Here’s how to configure them:\n\nThe console password secures access to the device via the console port.\n\nThe VTY password secures remote access via Telnet or SSH.\n\nThe enable secret command provides a more secure way to protect privileged EXEC mode by encrypting the password.\n• Set the enable secret:bashCopyenable secret\n• The password overrides the if both are configured.\n\nAfter making changes, you need to save the configuration to NVRAM so it persists after a reboot.\n\nThe command is a shortcut to save the configuration.\n\nThe command is another way to save the configuration.\n\nHere’s an example of configuring a router with a hostname, banner, passwords, and enable secret, and saving the configuration:\n• Test the console and VTY access:\n• Log out and log back in to verify the console and VTY passwords.\n• Always use strong passwords to secure your devices.\n• Use the command instead of for better security.\n• Save your configuration after making changes to avoid losing them during a reboot.\n• Use to see available commands and options (e.g., ).\n\nMastering these basic Cisco configuration commands is the foundation of network administration. Whether you’re setting up a small network or preparing for the CCNA exam, these commands will help you get started. Practice them in a lab environment using tools like Cisco Packet Tracer or Cisco Modeling Labs (CML) to build your confidence.\n\nAt Enumerate IT Solutions, we’re committed to helping you succeed in your networking journey. Stay tuned for more tutorials, tips, and guides to elevate your IT skills!"
    },
    {
        "link": "https://manageengine.com/network-configuration-manager/configure-cisco-switch.html",
        "document": "How to configure Cisco switch in 11 steps?\n\nIn this page, we will explore the configuration process for a Cisco switch. By configuring your Cisco switch, you can effectively manage its functionality, ensuring versatility, power, and optimal performance. Discover the essential CLI switch commands and the 11 configuration steps necessary to configure and manage a Cisco switch.\n\nStep 1: Use an external emulator such as Telnet or a PuTTY to login to the switch.\n• Connect the switch to the computer by utilizing a console cable that is connected to the console port on the switch and the serial port on the computer.\n• Open puTTY -> under category choose serial -> in \"Serial line to connect to\" box provide the COM port to which the cable is connected -> configure the serial line transfer settings -> Click \"Open\"\n• Type \"enable\" next to it and press \"Enter\"(we don't need any password to enable at this stage).\n• This will take you to the \"EXEC\" mode, also known as the Global Configuration mode.\n• Go to configure mode using the configure terminal.\n• Input the configuration commands by typing one command per line.\n\nStep 2: Provide a hostname for the switch to function in a particular network environment\n\nThe provided hostname should be unique within the network in order to facilitate easier identification of the switch. It is also advisable to adhere to any naming standards in order to easily categorize the devices with names.\n\nTo enable remote connectivity to the switch via SSH or Telnet, it is necessary to configure the IP address. Any VLAN can be selected for configuring the IP. Please utilize the following commands:\n\nConfiguring an administrative password for the privileged exec mode is essential to restrict access. Without this password, anyone with console credentials will have the ability to configure the switch.\n\nNote: This password will have to be given before entering into config mode once it is configured.\n\nChanging the default password of the switch is crucial, as it is widely known. To modify the password for an existing user, follow the commands provided below:\n\nWe can also create a new set of credentials as given above with desired privileges.\n\nIn order to enable remote accessibility of the switch, it is necessary to configure the default gateway. Ensure that the provided default gateway is within the same network as the device (network router IP can be provided as gateway IP).\n\nTo establish a secure connection, it is essential to restrict access to the switch through all input ports.\n\nIn the absence of entries in the dynamic routing table or when there is no specific route available, the switches are capable of forwarding packets via the configured static route.\n\nWe can configure interface description using below commands\n\nThe duplex mode governs the data transmission between the switches and the endpoint. When set to full duplex, the switch is capable of both sending and receiving data from the endpoint simultaneously.\n\nHow to configure a Cisco switch with Network Configuration Manager?\n\nYou can use Network Configuration Manager's Configlet feature to configure Cisco switch. You can automate the process by pushing the commands for configuring a switch to multiple devices at one go. In case, you want us to help you with configuring your switch on Network Configuration Manager's console, you can contact NCM support.\n\nThe above table shows how the configuration commands will appear on Network Configuration Manager's Configlet command tab."
    },
    {
        "link": "https://cisco.com/c/en/us/support/docs/security-vpn/secure-shell-ssh/4145-ssh.html",
        "document": ""
    },
    {
        "link": "https://cisco.com/c/en/us/td/docs/ios-xml/ios/sec_usr_ssh/configuration/xe-16/sec-usr-ssh-xe-16-book/sec-secure-shell-v2.html",
        "document": ""
    },
    {
        "link": "https://cisco.com/c/en/us/td/docs/switches/lan/catalyst2960x/software/15-2_3_e/consolidated_guide/b_1523e_consolidated_2960x_cg/b_consolidated_152ex_2960-X_cg_chapter_0100110.pdf",
        "document": ""
    },
    {
        "link": "https://uninets.com/blog/enable-ssh-on-cisco-switch",
        "document": "Secure Shell (SSH) is an essential protocol for managing IT infrastructure devices such as servers, routers, switches, etc. It provides a secure connection from client to server, unlike traditional management protocols like Telnet.\n\nFor IT professionals, it is important to understand how to enable SSH on a Cisco switch or any other device for that matter (Steps for configuring SSH are almost the same on most of the Cisco devices). Using SSH, they manage and maintain infrastructure securely and efficiently.\n\nCisco networking training and certifications such as CCNA cover the importance of SSH over telnet to ensure network administrators are well aware to implement, operate, and manage secure connections in their network environment.\n\nIn the field of IT, keep yourself updated with the latest technologies and best practices. This is where CCNA live training comes into the picture. It offers an interactive learning experience. Through these courses, candidates can gain hands-on experience in configuring network devices including setting up SSH on Cisco switch and many more scenarios crucial in a production environment.\n\nIn case you only wish to learn to configure SSH on a Cisco switch then this blog article is more than enough for you. If you seek to achieve the certification and live CCNA training online then feel free to contact our learning advisors.\n\nIn this blog, I will explain how to enable SSH on a Cisco switch with step-by-step configuration instructions, from generating key pairs to configuring VTY lines and applying another security setting. Then it will also cover steps for verifications and commands.\n\nHere I have created a very simple topology to understand the SSH setup, in this topology there is a central Cisco Switch (SW) which is directly connected to Cisco routers R01 and R02.\n\n● Enable SSH on Cisco Switch SW given in the above topology\n\n● Configure SSH version 2 and use 1024 bit key module to setup SSH on Cisco Switch\n\n● Configure the domain name uninets.com and authenticate SSH clients using the username \"cisco\" and the password \"cisco123\"\n\n● Follow tight security standards and do not allow telnet connection on the switch and make sure the password is secure with type 5 encryption\n\n● Both R01 and R02 should be able to SSH SW1 for its configuration management\n\nBefore moving to the SSH configuration, first configure the IP addresses and other devices and verify the basic connectivity. Both ports of the SW are in access VLAN 10, A layer 3 SVI VLAN 10 is created for its management IP address 10.0.0.10/24\n\nOn both routers R1 and R2, configure only IP address 10.0.0.1/24 and 10.0.0.2/24 for providing IP reachability to SW\n\nVerify the IP connectivity from SW to both R01 and R02\n\nSSH full form is Secure Shell, it works at transport layer 4 of the TCP/IP model and uses TCP port number 22. SSH provides secure communication to access remote network devices for management purposes.\n\nTwo versions exist for the communication between the client and server. Both provide encrypted connections which makes communication secure.\n\nTo configure SSH on the Cisco switch, we should configure the hostname, domain name, and privilege 15 username and password. Additionally, we can filter the remote communication protocol using the \"transport input\" line configuration mode. It has components such as \"all\", \"telnet\", \"ssh\", and \"none\".\n\nIn our case, we need to use \"transport input ssh,\" which allows only the SSH connection to refuse the telnet communication. By default, SSH version 1.99 is enabled as soon as we generate the crypto key, which can be changed using the ip ssh version global configuration command.\n\nWhen you generate an RSA key pair, by default the key size is 512 so as per the task you have to change it to 1024 and you notice that the default version of SSH installed is 1.99 as shown below\n\nInitially, let's verify the public/private key generated by the Cisco switch SW to provide a secure remote connection to its clients. After that, we can test whether the clients can make the telnet or SSH connection or both.\n\nNow also check the SSH version and the size of the key module\n\nLet's try to telnet SW from R1 since on switch telnet is not allowed, the connections will refuse.\n\nNow try to SSH to SW from R01 and R02, it will be a successful login using username Cisco.\n\nYou can also verify the ssh users login on the switch using the command \"show users\"\n\nThis concludes how to enable SSH on Cisco switches, the above configuration is strictly on Cisco switches however you can also enable SSH on Cisco routers using the same commands."
    },
    {
        "link": "https://cisco.com/c/en/us/td/docs/switches/lan/catalyst9300/software/release/17-12/configuration_guide/sec/b_1712_sec_9300_cg/configuring_secure_shell__ssh_.html",
        "document": ""
    },
    {
        "link": "https://cisco.com/en/US/docs/switches/lan/catalyst3850/software/release/3.2_0_se/multibook/configuration_guide/b_consolidated_config_guide_3850_chapter_011111.pdf",
        "document": ""
    },
    {
        "link": "http://cisco.com/en/US/docs/switches/lan/catalyst3850/software/release/3.2_0_se/multibook/configuration_guide/b_consolidated_config_guide_3850_chapter_011111.html",
        "document": ""
    },
    {
        "link": "https://cisco.com/c/en/us/td/docs/switches/lan/catalyst9300/software/release/17-12/configuration_guide/sec/b_1712_sec_9300_cg/port_security.html",
        "document": ""
    },
    {
        "link": "https://9tut.com/port-security-tutorial",
        "document": "By default, all interfaces on a Cisco switch are in an enabled state, meaning that anyone can potentially connect to your network through a wall socket, posing a security risk. Port Security is a feature that enhances the security of Cisco switches by controlling access to Ethernet ports based on the MAC addresses of connected devices.\n\nPort Security allows network administrators to associate only specific MAC addresses or set a maximum number of MAC addresses with each switch port. This association restricts access to the interface, ensuring that only authorized devices with recognized MAC addresses can use it. If an unauthorized device attempts to connect, you can configure the switch to take predefined actions, such as discarding the incoming traffic, sending a warning message or shutting down the port to mitigate the security threat.\n\nIn the figure below, only host with MAC address of AAA (just for example. In fact the MAC address must be 48 bits) was configured to connect to the switch port while other MAC addresses are blocked:\n\nThere are three steps to configure port security on a Cisco switch:\n\n1. Configure the switch port as an access port using the “switchport mode access” command.\n\n 2. Activate port security on the switch port with the “switchport port-security” command.\n\n 3. Specify the permitted MAC addresses for sending frames through the interface. This can be done by utilizing either the “switchport port-security mac-address {MAC_Address}” command or, for dynamic MAC address learning, the “switchport port-security mac address sticky” command while the host is connected. An example of the configuration is shown below:\n\nThis is the minimum configuration to activate port-security.\n\nTo verify the port-security configuration on an interface, we can use the “show port-security interface {interface}” command:\n\nThere are two optional steps for more control of this feature:\n\n1. Specify the action the switch should take when it receives a frame from an unauthorized device using the “switchport port-security violation {protect/restrict/shutdown}” command.\n\n+ Protect: drops the packets with an unknown source MAC address. It will not make log entry for dropped packets. Interface will learn MAC address until it reaches the maximum allowed number of MAC address that was configured. Any additionally learned addresses would be dropped while keeping interface operational.\n\n + Restrict: drops the packets with unknown source MAC addresses. It then causes the SecurityViolation counter to increase and generate a security violation alert.\n\n + Shutdown: causes the interface to enter an error-disabled state (same as down state) immediately. It then sends an SNMP trap notification. The switchport will remain in this state until manually removed. This is the default violation mode.\n\nAll three options result in discarding traffic from the unauthorized device. Both the “restrict” and “shutdown” options also generate log messages when a violation occurs, with the “shutdown” mode additionally disabling the port.\n\n2. Set the maximum allowable number of MAC addresses that can be used on the port using the “switchport port-security maximum {number}” interface command. The default number of MAC addresses allowed is 1 so if we connect another host to the same port, the security violation will occur and the port is put into err-disabled state:\n\nFirst we will receive an error message like this when we try to connect another host (with MAC 0090.ab0e.4582) to this port (through another switch or hub):\n\nThen we can check this port to see it is in err-disabled state:\n\nErr-disabled state is same as “shutdown” state. But it means the security violation occurred on this port.\n\nAlso the port-security on this port:\n\nThe line “Port Status: Secure-shutdown” means that this port has been shut down because of port-security. We can reactivate this port by using the “shutdown” and “no shutdown” commands.\n\nPort security is a good feature in Cisco devices for securing access to your network through a switch. By following the steps outlined in this tutorial, you can configure, manage, and troubleshoot port security to enhance the security of your network and prevent unauthorized access."
    },
    {
        "link": "https://community.cisco.com/t5/networking-knowledge-base/implementing-portsecurity-to-switchports-to-avoid-vulnerability/ta-p/4906158",
        "document": "Infected LAN-switch takes unusual actions which sends load of informational messages to continuously be shutting down its interfaces.\n\nAttacker gained access an end point of LAN-switch at local office with infected device. Which makes the vulnerability of interfaces of the LAN-switch and launch an attack to company network.\n\nBest practice to avoid such attack that must implement port-security on switchports, restricting devices that can use the port only authorized MAC addresses in end point of LAN-switch.\n\nBelow here describes how to implement (configure) switchport security in layer2 Catalyst 2960 switch.\n\nI would like to add this line of paragraph after discussion with Rich R (as on below comment section) to avoid misunderstanding of Network Security as a whole. In the current real world situation network security must implemented in depth in other term Defense-in-Depth. Which means to security architecture must implement with different layers of security levels such that firewalls, intrusion preventing system, antivirus and antimalware tools for end user devices, IP access control lists to filter packets on routers and there are many more. Switchport security is one of elements or entities of Security as a whole (DiD). Therefore, implementing switchport security in the same way we can minimize and prevent attack and vulnerability of local office network.\n\n\n\n \n\n \n\n Enter configuration commands, one per line. End with CNTL/Z. \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n\n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n Total Addresses in System (excluding one mac per port) : 0 \n\n Max Addresses limit in System (excluding one mac per port) : 8192 \n\n\n\nF0/11-port violation detected due to attempting to access F0/11 end point by a device having a different MAC address. Port Secure-shutdown.\n\nF0/11-port must manually \"shutdown\" and \"no shutdown\" by network engineer to gain link up.\n\nF0/11-port violation detected due to attempting to access F0/11 end point by a device having a different MAC address. Port Secure-up. Port-Security restrict mode, issues alarming messages but not shutdown the port.\n\nI hope this may help you to secure your LAN network. If it is useful give me thumbs up using \"helpful\"."
    }
]