[
    {
        "link": "https://support.microsoft.com/en-us/office/if-function-69aed7c9-4e8a-4755-a9bc-aa8bbff73be2",
        "document": "The IF function is one of the most popular functions in Excel, and it allows you to make logical comparisons between a value and what you expect. So an IF statement can have two results. The first result is if your comparison is True, the second if your comparison is False. For example, =IF(C2=”Yes”,1,2) says IF(C2 = Yes, then return a 1, otherwise return a 2).\n\nIn the above example, cell D2 says: IF(C2 = Yes, then return a 1, otherwise return a 2) In this example, the formula in cell D2 says: IF(C2 = 1, then return Yes, otherwise return No)As you see, the IF function can be used to evaluate both text and values. It can also be used to evaluate errors. You are not limited to only checking if one thing is equal to another and returning a single result, you can also use mathematical operators and perform additional calculations depending on your criteria. You can also nest multiple IF functions together in order to perform multiple comparisons. In the above example, the IF function in D2 is saying IF(C2 Is Greater Than B2, then return “Over Budget”, otherwise return “Within Budget”) In the above illustration, instead of returning a text result, we are going to return a mathematical calculation. So the formula in E2 is saying IF(Actual is Greater than Budgeted, then Subtract the Budgeted amount from the Actual amount, otherwise return nothing). In this example, the formula in F7 is saying IF(E7 = “Yes”, then calculate the Total Amount in F5 * 8.25%, otherwise no Sales Tax is due so return 0) Note: If you are going to use text in formulas, you need to wrap the text in quotes (e.g. “Text”). The only exception to that is using TRUE or FALSE, which Excel automatically understands."
    },
    {
        "link": "https://ablebits.com/office-addins-blog/if-and-formula-in-excel",
        "document": "The tutorial shows how to use IF together with the AND function in Excel to check multiple conditions in one formula.\n\nSome things in the world are finite. Others are infinite, and the IF function seems to be one of such things. On our blog, we already have a handful of Excel IF tutorials and still discover new uses every day. Today, we are going to look at how you can use IF together with the AND function to evaluate two or more conditions at the same time.\n\nIF AND statement in Excel In order to build the IF AND statement, you obviously need to combine the IF and AND functions in one formula. Here's how: Translated into plain English, the formula reads as follows: IF condition 1 is true AND condition 2 is true, do one thing, otherwise do something else. As an example, let's make a formula that checks if B2 is \"delivered\" and C2 is not empty, and depending on the results, does one of the following:\n• If both conditions are TRUE, mark the order as \"Closed\".\n• If either condition is FALSE or both are FALSE, then return an empty string (\"\"). The screenshot below shows the IF AND function in Excel:\n\n If you'd like to return some value in case the logical test evaluates to FALSE, supply that value in the value_if_false argument. For example: The modified formula outputs \"Closed\" if column B is \"delivered\" and C has any date in it (non-blank). In all other cases, it returns \"Open\":\n\n Note. When using an IF AND formula in Excel to evaluate text conditions, please keep in mind that lowercase and uppercase are treated as the same character. If you are looking for a case-sensitive IF AND formula, wrap one or more arguments of AND into the EXACT function as it is done in the linked example. Now that you know the syntax of the Excel IF AND statement, let me show you what kind of tasks it can solve.\n\n\n\nExcel IF: greater than AND less than In the previous example, we were testing two conditions in two different cells. But sometimes you may need to run two or more tests on the same cell. A typical example is checking if a cell value is between two numbers. The Excel IF AND function can easily do that too! Let's say you have some sales numbers in column B and you are requested to flag the amounts greater than $50 but less than $100. To have it done, insert this formula in C2 and then copy it down the column: If you need to include the boundary values (50 and 100), use the less than or equal to operator (<=) and greater than or equal to (>=) operator: To process some other boundary values without changing the formula, enter the minimum and maximum numbers in two separate cells and refer to those cells in your formula. For the formula to work correctly in all the rows, be sure to use absolute references for the boundary cells ($F$1 and $F$2 in our case): By using a similar formula, you can check if a date falls within a specified range. For example, let's flag dates between 10-Sep-2018 and 30-Sep-2018, inclusive. A small hurdle is that dates cannot be supplied to the logical tests directly. For Excel to understand the dates, they should be enclosed in the DATEVALUE function, like this: Or simply input the From and To dates in two cells ($F$1 and $F$2 in this example) and \"pull\" them from those cells by using the already familiar IF AND formula: For more information, please see Excel IF statement between two numbers or dates.\n\n\n\nIF this AND that, then calculate something Apart from returning predefined values, the Excel IF AND function can also perform different calculations depending on whether the specified conditions are TRUE or FALSE. To demonstrate the approach, we will be calculating a bonus of 5% for \"Closed\" sales with the amount greater than or equal to $100. Assuming the amount is in column B and the order status in column C, the formula goes as follows: The above formula assigns zero to the rest of the orders (value_if_false = 0). If you are willing to give a small stimulating bonus, say 3%, to orders that do not meet the conditions, include the corresponding equation in the value_if_false argument:\n\nMultiple IF AND statements in Excel As you may have noticed, we have evaluated only two criteria in all the above examples. But there is nothing that would prevent you from including three and more tests in your IF AND formulas as long as they comply with these general limitations of Excel:\n• In Excel 2007 and higher, up to 255 arguments can be used in a formula, with a total formula length not exceeding 8,192 characters.\n• In Excel 2003 and lower, no more than 30 arguments are allowed, with a total length not exceeding 1,024 characters. As an example of multiple AND conditions, please consider these ones:\n• Amount (B2) should be greater than or equal to $100\n• Delivery date (D2) is within the current month Now, we need an IF AND statement to identify the orders for which all 3 conditions are TRUE. And here it is: Given that the 'current month' at the moment of writing was October, the formula delivers the below results:\n\n \n\n\n\nWhen working with large worksheets, chances are that you may be required to check a few sets of different AND criteria at a time. For this, you take a classic Excel nested IF formula and extend its logical tests with AND statements, like this: To get the general idea, please look at the following example. Supposing you want to rate your service based on the shipment cost and estimated time of delivery (ETD):\n• Excellent: shipment cost under $20 and ETD under 3 days\n• Poor: shipment cost over $30 and ETD over 5 days\n• Average: anything in between To get it done, you write two individual IF AND statements: …and nest one into the other: The result will look similar to this:\n\n More formula examples can be found in Excel nested IF AND statements.\n\n\n\nCase-sensitive IF AND function in Excel As mentioned in the beginning of this tutorial, Excel IF AND formulas do not distinguish between uppercase and lowercase characters because the AND function is case-insensitive by nature. If you are working with case-sensitive data and want to evaluate AND conditions taking into account the text case, do each individual logical test inside the EXACT function and nest those functions into your AND statement: For this example, we are going to flag orders of a specific customer (e.g. the company named Cyberspace) with an amount exceeding a certain number, say $100. As you can see in the below screenshot, some company names in column B look the same excerpt the characters case, and nevertheless they are different companies, so we have to check the names exactly. The amounts in column C are numbers, and we run a regular \"greater than\" test for them: To make the formula more flexible, you can input the target customer name and amount in two separate cells and refer to those cells. Just remember to lock the cell references with $ sign ($G$1 and $G$2 in our case) so they won't change when you copy the formula to other rows: Now, you can type any name and amount in the referenced cells, and the formula will flag the corresponding orders in your table:\n\n \n\n\n\nIF OR AND formula in Excel In Excel IF formulas, you are not limited to using only one logical function. To check various combinations of multiple conditions, you are free to combine the IF, AND, OR and other functions to run the required logical tests. Here is an example of IF AND OR formula that tests a couple of OR conditions within AND. And now, I will show you how you can do two or more AND tests within the OR function. Supposing, you wish to mark the orders of two customers with an amount greater than a certain number, say $100. In the Excel language, our conditions are expressed in this way: Assuming the customer names are in column B, amounts in column C, the 2 target names are in G1 and G2, and the target amount is in G3, you use this formula to mark the corresponding orders with \"x\": The same results can be achieved with a more compact syntax: Not sure you totally understand the formula's logic? More information can be found in Excel IF with multiple AND/OR conditions.\n\n\n\nThat's how you use the IF and AND functions together in Excel. Thank you for reading and see you next week!"
    },
    {
        "link": "https://support.microsoft.com/en-us/office/create-conditional-formulas-ca916c57-abd8-4b44-997c-c309b7307831",
        "document": "Testing whether conditions are true or false and making logical comparisons between expressions are common to many tasks. You can use the AND, OR, NOT, and IF functions to create conditional formulas. For example, the IF function uses the following arguments. Formula that uses the IF function logical_test: The condition that you want to check. value_if_true: The value to return if the condition is True. value_if_false: The value to return if the condition is False. For more information about how to create formulas, see Create or delete a formula.\n\nCreate a conditional formula that results in a logical value (TRUE or FALSE) To do this task, use the AND, OR, and NOT functions and operators as shown in the following example. The example may be easier to understand if you copy it to a blank worksheet. How do I copy an example?\n• Select the example in this article. Selecting an example from Help\n• In the worksheet, select cell A1, and press CTRL+V. Important: For the example to work properly, you must paste it into cell A1 of the worksheet.\n• To switch between viewing the results and viewing the formulas that return the results, press CTRL+` (grave accent), or on the Formulas tab, in the Formula Auditing group, click the Show Formulas button. After you copy the example to a blank worksheet, you can adapt it to suit your needs. Determines if the value in cell A2 is greater than the value in A3 and also if the value in A2 is less than the value in A4. (FALSE) Determines if the value in cell A2 is greater than the value in A3 or if the value in A2 is less than the value in A4. (TRUE) Determines if the sum of the values in cells A2 and A3 is not equal to 24. (FALSE) Determines if the value in cell A5 is not equal to \"Sprockets.\" (FALSE) Determines if the value in cell A5 is not equal to \"Sprockets\" or if the value in A6 is equal to \"Widgets.\" (TRUE) For more information about how to use these functions, see AND function, OR function, and NOT function.\n\nCreate a conditional formula that results in another calculation or in values other than TRUE or FALSE To do this task, use the IF, AND, and OR functions and operators as shown in the following example. The example may be easier to understand if you copy it to a blank worksheet. How do I copy an example?\n• Select the example in this article. Important: Do not select the row or column headers. Selecting an example from Help\n• In the worksheet, select cell A1, and press CTRL+V. Important: For the example to work properly, you must paste it into cell A1 of the worksheet.\n• To switch between viewing the results and viewing the formulas that return the results, press CTRL+` (grave accent), or on the Formulas tab, in the Formula Auditing group, click the Show Formulas button. After you copy the example to a blank worksheet, you can adapt it to suit your needs. =IF(A2=15, \"OK\", \"Not OK\") If the value in cell A2 equals 15, return \"OK.\" Otherwise, return \"Not OK.\" (OK) =IF(A2<>15, \"OK\", \"Not OK\") If the value in cell A2 is not equal to 15, return \"OK.\" Otherwise, return \"Not OK.\" (Not OK) =IF(NOT(A2<=15), \"OK\", \"Not OK\") If the value in cell A2 is not less than or equal to 15, return \"OK.\" Otherwise, return \"Not OK.\" (Not OK) =IF(A5<>\"SPROCKETS\", \"OK\", \"Not OK\") If the value in cell A5 is not equal to \"SPROCKETS\", return \"OK.\" Otherwise, return \"Not OK.\" (Not OK) =IF(AND(A2>A3, A2<A4), \"OK\", \"Not OK\") If the value in cell A2 is greater than the value in A3 and the value in A2 is also less than the value in A4, return \"OK.\" Otherwise, return \"Not OK.\" (Not OK) =IF(AND(A2<>A3, A2<>A4), \"OK\", \"Not OK\") If the value in cell A2 is not equal to A3 and the value in A2 is also not equal to the value in A4, return \"OK.\" Otherwise, return \"Not OK.\" (OK) =IF(OR(A2>A3, A2<A4), \"OK\", \"Not OK\") If the value in cell A2 is greater than the value in A3 or the value in A2 is less than the value in A4, return \"OK.\" Otherwise, return \"Not OK.\" (OK) =IF(OR(A5<>\"Sprockets\", A6<>\"Widgets\"), \"OK\", \"Not OK\") If the value in cell A5 is not equal to \"Sprockets\" or the value in A6 is not equal to \"Widgets\", return \"OK.\" Otherwise, return \"Not OK.\" (Not OK) =IF(OR(A2<>A3, A2<>A4), \"OK\", \"Not OK\") If the value in cell A2 is not equal to the value in A3 or the value in A2 is not equal to the value in A4, return \"OK.\" Otherwise, return \"Not OK.\" (OK) For more information about how to use these functions, see IF function, AND function, and OR function."
    },
    {
        "link": "https://ablebits.com/office-addins-blog/excel-if-function-multiple-conditions",
        "document": "The tutorial shows how to create multiple IF statements in Excel with AND as well as OR logic. Also, you will learn how to use IF together with other Excel functions.\n\nIn the first part of our Excel IF tutorial, we looked at how to construct a simple IF statement with one condition for text, numbers, dates, blanks and non-blanks. For powerful data analysis, however, you may often need to evaluate multiple conditions at a time. The below formula examples will show you the most effective ways to do this.\n\nHow to use IF function with multiple conditions In essence, there are two types of the IF formula with multiple criteria based on the AND / OR logic. Consequently, in the logical test of your IF formula, you should use one of these functions:\n• AND function - returns TRUE if all the conditions are met; FALSE otherwise.\n• OR function - returns TRUE if any single condition is met; FALSE otherwise. To better illustrate the point, let's investigate some real-life formulas examples. Excel IF statement with multiple conditions (AND logic) The generic formula of Excel IF with two or more conditions is this: Translated into a human language, the formula says: If condition 1 is true AND condition 2 is true, return value_if_true; else return value_if_false. Suppose you have a table listing the scores of two tests in columns B and C. To pass the final exam, a student must have both scores greater than 50. For the logical test, you use the following AND statement: AND(B2>50, C2>50) If both conditions are true, the formula will return \"Pass\"; if any condition is false - \"Fail\". Easy, isn't it? The screenshot below proves that our Excel IF /AND formula works right: In a similar manner, you can use the Excel IF function with multiple text conditions. For instance, to output \"Good\" if both B2 and C2 are greater than 50, \"Bad\" otherwise, the formula is: Important note! The AND function checks all the conditions, even if the already tested one(s) evaluated to FALSE. Such behavior is a bit unusual since in most of programming languages, subsequent conditions are not tested if any of the previous tests has returned FALSE. In practice, a seemingly correct IF statement may result in an error because of this specificity. For example, the below formula would return #DIV/0! (\"divide by zero\" error) if cell A2 is equal to 0: The avoid this, you should use a nested IF function: For more information, please see IF AND formula in Excel.\n\n Excel IF function with multiple conditions (OR logic) To do one thing if any condition is met, otherwise do something else, use this combination of the IF and OR functions: The difference from the IF / AND formula discussed above is that Excel returns TRUE if any of the specified conditions is true. So, if in the previous formula, we use OR instead of AND: Then anyone who has more than 50 points in either exam will get \"Pass\" in column D. With such conditions, our students have a better chance to pass the final exam (Yvette being particularly unlucky failing by just 1 point :) Tip. In case you are creating a multiple IF statement with text and testing a value in one cell with the OR logic (i.e. a cell can be \"this\" or \"that\"), then you can build a more compact formula using an array constant. For example, to mark a sale as \"closed\" if cell B2 is either \"delivered\" or \"paid\", the formula is: More formula examples can be found in Excel IF OR function.\n\n IF with multiple AND & OR statements If your task requires evaluating several sets of multiple conditions, you will have to utilize both AND & OR functions at a time. In our sample table, suppose you have the following criteria for checking the exam results: If either of the conditions is met, the final exam is deemed passed. At first sight, the formula seems a little tricky, but in fact it is not! You just express each of the above conditions as an AND statement and nest them in the OR function (since it's not necessary to meet both conditions, either will suffice): Then, use the OR function for the logical test of IF and supply the desired value_if_true and value_if_false values. As the result, you get the following IF formula with multiple AND / OR conditions: The screenshot below indicates that we've done the formula right: Naturally, you are not limited to using only two AND/OR functions in your IF formulas. You can use as many of them as your business logic requires, provided that:\n• In Excel 2007 and higher, you have no more than 255 arguments, and the total length of the IF formula does not exceed 8,192 characters.\n• In Excel 2003 and lower, there are no more than 30 arguments, and the total length of your IF formula does not exceed 1,024 characters.\n\nIf you want to evaluate multiple logical tests within a single formula, then you can nest several functions one into another. Such functions are called nested IF functions. They prove particularly useful when you wish to return different values depending on the logical tests' results. Here's a typical example: suppose you want to qualify the students' achievements as \"Good\", \"Satisfactory\" and \"Poor\" based on the following scores:\n• Satisfactory: between 40 and 60 (>40 and <60) Before writing a formula, consider the order of functions you are going to nest. Excel will evaluate the logical tests in the order they appear in the formula. Once a condition evaluates to TRUE, the subsequent conditions are not tested, meaning the formula stops after the first TRUE result. In our case, the functions are arranged from largest to smallest: Naturally, you can nest more functions if needed (up to 64 in modern versions). For more information, please see How to use multiple nested IF statements in Excel.\n\n\n\nAnother way to get an Excel IF to test multiple conditions is by using an array formula. To evaluate conditions with the AND logic, use the asterisk: To test conditions with the OR logic, use the plus sign: To complete an array formula correctly, press the Ctrl + Shift + Enter keys together. In Excel 365 and Excel 2021, this also works as a regular formula due to support for dynamic arrays. For example, to get \"Pass\" if both B2 and C2 are greater than 50, the formula is: In my Excel 365, a normal formula works just fine (as you can see in the screenshots above). In Excel 2019 and lower, remember to make it an array formula by using the Ctrl + Shift + Enter shortcut. To evaluate multiple conditions with the OR logic, the formula is:\n\nUsing IF together with other functions This section explains how to use IF in combination with other Excel functions and what benefits this gives to you. Example 1. If #N/A error in VLOOKUP When VLOOKUP or other lookup function cannot find something, it returns a #N/A error. To make your tables look nicer, you can return zero, blank, or specific text if #N/A. For this, use this generic formula: If the lookup value in E1 is not found, the formula returns zero. If the lookup value is not found, the formula returns nothing (an empty string). If the lookup value is not found, the formula returns specific text. For more formula examples, please see VLOOKUP with IF statement in Excel.\n\n Example 2. IF with SUM, AVERAGE, MIN and MAX functions To sum cell values based on certain criteria, Excel provides the SUMIF and SUMIFS functions. In some situations, your business logic may require including the SUM function in the logical test of IF. For example, to return different text labels depending on the sum of the values in B2 and C2, the formula is: If the sum is greater than 130, the result is \"good\"; if greater than 110 – \"satisfactory', if 110 or lower – \"poor\". In a similar fashion, you can embed the AVERAGE function in the logical test of IF and return different labels based on the average score: Assuming the total score is in column D, you can identify the highest and lowest values with the help of the MAX and MIN functions: To have both labels in one column, nest the above functions one into another: Likewise, you can use IF together with your custom functions. For example, you can combine it with GetCellColor or GetCellFontColor to return different results based on a cell color. In addition, Excel provides a number of functions to calculate data based on conditions. For detailed formula examples, please check out the following tutorials: Example 3. IF with ISNUMBER, ISTEXT and ISBLANK To identify text, numbers and blank cells, Microsoft Excel provides special functions such as ISTEXT, ISNUMBER and ISBLANK. By placing them in the logical tests of three nested IF statements, you can identify all different data types in one go: Example 4. IF and CONCATENATE To output the result of IF and some text into one cell, use the CONCATENATE or CONCAT (in Excel 2016 - 365) and IF functions together. For example: Looking at the screenshot below, you'll hardly need any explanation of what the formula does:\n\nThe modern versions of Excel have special functions to trap errors and replace them with another calculation or predefined value - IFERROR (in Excel 2007 and later) and IFNA (in Excel 2013 and later). In earlier Excel versions, you can use the IF ISERROR and IF ISNA combinations instead. The difference is that IFERROR and ISERROR handle all possible Excel errors, including #VALUE!, #N/A, #NAME?, #REF!, #NUM!, #DIV/0!, and #NULL!. While IFNA and ISNA specialize solely in #N/A errors. For example, to replace the \"divide by zero\" error (#DIV/0!) with your custom text, you can use the following formula:\n\nAnd that's all I have to say about using the IF function in Excel. I thank you for reading and hope to see you on our blog next week!"
    },
    {
        "link": "https://stackoverflow.com/questions/30612282/using-and-and-or-together-on-the-if-function",
        "document": "Hi all I have been trying to fin out how to use AND and OR together on the same formula.\n\nI'm trying to resolve the following issue :\n\nThe person will get a discount only if they are working on the Cerrovial project or if they are working on the Parinas project but the risk of the job must be Low\n\nI tried to use a formula and excel gave me an error and also fixed my formula but I do not know if this is correct or what the \"*\" means"
    },
    {
        "link": "https://stackoverflow.com/questions/28933776/using-search-function-across-multiple-columns",
        "document": "You can't have a range in , it will just return a #VALUE which, in your formula will give you a \"Not Found\". When in doubt, take out your and see what the conditional statement returns.\n\nYou can, however, concatenate your cell values together to make a big fat search term. The formula will work, you can just use :\n\nEither way that one will work. That concatenation is pretty tedious to write, but it's your best bet outside of a quick VBA UDF."
    },
    {
        "link": "https://reddit.com/r/excel/comments/s0ybpd/how_to_search_multiple_columns_for_a_specific",
        "document": "Please see the pic below for reference. I need to search an array of values (columns A through C) for a specific integer and return each value from column E that corresponds to a row in which the integer was found. For example, if the integer in question was \"4\", this supposed formula would search A2:C10 and return values of 3, 6, and 9 from column E, as those are the values which correspond to the rows in which the integer was found.\n\nBonus points if you can tell me how to automatically multiply together the values pulled by this supposed formula (without manually inputting the values into a SUM function). So in the example I provided, it would pull 3, 6, and 9, and then return a product of 162 in a single cell instead of giving me several values.\n\nI have been going insane trying to figure out this formula with various combinations of XLOOKUP, INDEX, SMALL, and IF logic to no avail. I am somewhat Excel savvy, but not that savvy. I would appreciate any help, thanks!"
    },
    {
        "link": "https://financialmodelingeducation.com/pages/blog/index-match-multiple-columns-guide",
        "document": ""
    },
    {
        "link": "https://techcommunity.microsoft.com/discussions/excelgeneral/search-multiple-columns-all-at-once-to-find-locate-and-return-matching-data-deta/2108972",
        "document": "Search Multiple Columns all at once to Find, Locate and return Matching Data Details (Power Query)?\n\nWhat is the best, quickest and simplest method?\n\nI have a of [default emails] on one Worksheet1; And three(3) different of [email_1], [email_2] and [email_3] on a different Worksheet2.\n\nHow can I search the three(3) of [email_1], [email_2] and [email_3] all at once against the [default email] in order to return matches with the [default email] losing any data? I also need to pull those that were not-matched, and organized them separately.\n\nALSO, I would like to maintain this as a Table format so that the data can continue to be added/updated to the file/worksheet.\n\nLastly, I would also like to see if Power Query can be utilized as well. And, Pivot Table to report 'matched' and 'non-matched' groups of data.\n\nAny help would be greatly appreciated!\n\n*I have attached a sample contact list (fake data) with further detail how I would like to see the results. May I please ask if I can get further solution to the attached? Thanks!"
    },
    {
        "link": "https://reddit.com/r/excel/comments/sy9ddr/how_to_find_a_common_value_in_multiple_columns",
        "document": "So I have columns A-H each column has a list of names. How can I find if a name appears in all columns?\n\nWhat I'm hoping is excel can analyze all the data and highlight a name that exists in each column.\n\nI tried conditional formatting and to find duplicate values. But this may show a name that appears in column A and D but not in the others. I need to find names that only exist in every column and for them to be highlighted.\n\nI guess the easiest way to phrase it is I want to find a match that exists in all columns. Without specifying a particular name. I'd like excel to analyze all the data and spit out a name that appears in each column"
    }
]