[
    {
        "link": "https://help.autodesk.com/view/MAYAUL/2023/ENU?guid=GUID-3B38E9FB-CD86-41DF-8104-109A13815B96",
        "document": ""
    },
    {
        "link": "https://help.autodesk.com/cloudhelp/2023/ENU/Maya-WhatsNewPR/files/GUID-C2F0002E-1B00-45AE-A97D-5996BF2965C5.htm",
        "document": "Welcome to Maya 2023! Read on to learn about the new features and updated workflows you'll find in this release. For technical details including What's Fixed, see the Maya 2023 Release Notes.\n\nMaya 2023 focuses on improved usability for both seasoned Maya artists and new users alike. Experience the completely revamped Booleans Tool, the new Blue Pencil Tool, or try some of the other improvements detailed in the links below. You'll also notice an improved user experience with the new Application Home hub, gamiefied tutorials, and a new Search feature that lets you navigate the user interface more efficiently.\n\nFor more on the evolution of Maya over the years, check out the Maya timeline on Autodesk AREA."
    },
    {
        "link": "https://w.thegnomonworkshop.com/tutorials/introduction-to-maya-2023-volume-1",
        "document": "Get up and running quickly in Maya 2023 with this beginner’s guide tutorial by one of our most-watched instructors, Eric Keller. Introduction to Maya 2023: Volume 1 is comprised of 12 chapters that take you on a comprehensive tour of the Maya interface, covering navigation along with the many editors that you'll need to use when building 3D models and scenes.\n\nEric then walks through the creation of a Maya scene using a network of interconnected nodes. The relationships between these nodes define the shapes of your virtual objects, the shaders that determine the material qualities of those objects, the animation that moves them, and the lights and cameras that turn your creations into cinematic elements, game assets, scientific visualizations — or whatever you need to bring your digital art to life!\n\nA number of helpful assets are available to download as project files with this workshop to help you with examples and to follow along with the workshop.\n\nIn Volume 2, you will explore the modeling and animation tools. In Volume 3, Eric will introduce lighting shading and reveal how to export assets for use in real-time game-editing software, like the Unreal Engine development kit."
    },
    {
        "link": "https://thegnomonworkshop.com/tutorials/introduction-to-maya-2023-volume-1",
        "document": "Get up and running quickly in Maya 2023 with this beginner’s guide tutorial by one of our most-watched instructors, Eric Keller. Introduction to Maya 2023: Volume 1 is comprised of 12 chapters that take you on a comprehensive tour of the Maya interface, covering navigation along with the many editors that you'll need to use when building 3D models and scenes.\n\nEric then walks through the creation of a Maya scene using a network of interconnected nodes. The relationships between these nodes define the shapes of your virtual objects, the shaders that determine the material qualities of those objects, the animation that moves them, and the lights and cameras that turn your creations into cinematic elements, game assets, scientific visualizations — or whatever you need to bring your digital art to life!\n\nA number of helpful assets are available to download as project files with this workshop to help you with examples and to follow along with the workshop.\n\nIn Volume 2, you will explore the modeling and animation tools. In Volume 3, Eric will introduce lighting shading and reveal how to export assets for use in real-time game-editing software, like the Unreal Engine development kit."
    },
    {
        "link": "https://reddit.com/r/gamedev/comments/119bm42/if_an_environmental_artist_uses_3ds_max_maya_or",
        "document": "After watching a dozen videos and reading two dozen articles, I still can’t seem to find many key differences between a Level Designer and an EA, in terms of software they use. According to what I’ve found, both use UE and those modeling softwares. I thought the environment was created in one of those three softwares, yet videos and online courses seem to suggest that these can also be done in UE 5.\n\nAs part of still trying to decide between EA and Game/Level Design, this might sound lazy, but I’d like to know which one uses less different softwares? Why does that matter? As someone venturing from media arts, where the software and use seemed obvious and specific to me (i.e. FCP/Premiere for editing, After Effects for vfx/motion graphics), there wasn’t much crossover in terms of software capability. Meaning, I knew I had to learn the editing apps for editing and the vfx apps for vfx.\n\nAgain, it’s not out of laziness, I just get overwhelmed when faced with multiple different apps I’d have to learn to do the job. I’d like to be an EA, since I already know a small amount of 3D modeling from school, it seems creative enough, and the skills seem easily applicable to film with cgi environments using Unreal (again, am I understanding that UE can do what these other softwares can?). I’m also interested in Game/Level design, even though it means learning a lot of new things without formal schooling, as it looks like it involves the creative landscape design of EA but with more impact on helping make the story."
    },
    {
        "link": "https://help.autodesk.com/view/MAYAUL/2024/ENU?guid=GUID-07C3BA47-32BB-477B-B6C5-1090E5C9B81C",
        "document": ""
    },
    {
        "link": "https://sdcpublications.com/Textbooks/Autodesk-Maya-2023-Basics-Guide/ISBN/978-1-63057-527-4",
        "document": "Written by renowned author and 3D artist Kelly L. Murdock, Autodesk Maya 2023 Basics Guide is designed to give new users a solid understanding of the fundamental skills needed to create beautiful 3D models and stunning animations with Autodesk Maya. Using clear and easy to follow instructions this book will guide you through learning all the major features of Maya. The text is complemented by video instruction. Each chapter has a corresponding video tutorial that introduces you to the topics and allows you to watch and learn how functions are performed in a way that a text alone cannot do.\n\nAutodesk Maya 2023 Basics Guide makes no assumptions about your previous experience with Autodesk Maya. It begins by helping you get comfortable with the user interface and navigating scenes before moving into modeling, texturing, lighting, animating, rendering and more. Additionally, more advanced features such as character rigging, skinning, animating with dynamics and MEL scripting are also introduced.\n\nEach chapter begins by examining the concept behind each task, the goal and the necessary features that are involved. Then you go in-depth with the objective of your task as you study examples and learn the steps necessary to complete it. Working your way through the comprehensive, step-by-step lessons, you'll develop the confidence you need to create incredible renderings and animations using Autodesk Maya.\n\nWho this book is for\n\nThis text was created specifically for users with no prior 3D modeling or animation experience. If you want to work in a creative field or are just curious about how 3D animated movies are made this book is the perfect way to get started. Users who are migrating from another 3D application or upgrading from a previous version of Maya will also benefit greatly from this text.\n• How to create models using primitives, curves, NURBS, Polygons and more\n• How to assign materials and textures to make realistic-looking models\n• How to use Paint Effects to paint on and quickly create complex 3D Models\n• How to use lights, cameras, and depth of field to render captivating scenes\n• How to use keyframes, motion paths and the Graph Editor to create animations\n• How to use character rigging, skinning, and inverse kinematics to animate realistic movements\n• How to use various deformers to manipulate objects, animations and special effects\n• How to add influence objects, skin weights and hair to a character for a more realistic look\n• How to use dynamics to create fire, smoke, lightning, explosions, cloth and ocean effects\n• How to enable raytracing, motion blur, and fog effects for increased realism\n• How to render stills and animations using Maya Vector and Mental Ray for different looks\n• How to use the Command Line and MEL Scripting to work faster\n\nMaya is a program, created by Autodesk, used to model, animate, and render 3D scenes. 3D scenes created with Maya have appeared in movies, television, advertisements, games, product visualizations, and on the Web. With Maya, you can create and animate your own 3D scenes and render them as still images or as animation sequences."
    },
    {
        "link": "https://help.autodesk.com/view/MAYAUL/2023/ENU?guid=GUID-3B38E9FB-CD86-41DF-8104-109A13815B96",
        "document": ""
    },
    {
        "link": "https://help.autodesk.com/view/MAYAUL/2025/ENU?guid=GUID-07C3BA47-32BB-477B-B6C5-1090E5C9B81C",
        "document": ""
    },
    {
        "link": "https://books.google.com/books/about/Autodesk_Maya_2023_Basics_Guide.html?id=gtRsEAAAQBAJ",
        "document": "Written by renowned author and 3D artist Kelly L. Murdock, Autodesk Maya 2023 Basics Guide is designed to give new users a solid understanding of the fundamental skills needed to create beautiful 3D models and stunning animations with Autodesk Maya. Using clear and easy to follow instructions this book will guide you through learning all the major features of Maya. The text is complemented by video instruction. Each chapter has a corresponding video tutorial that introduces you to the topics and allows you to watch and learn how functions are performed in a way that a text alone cannot do.\n\nAutodesk Maya 2023 Basics Guide makes no assumptions about your previous experience with Autodesk Maya. It begins by helping you get comfortable with the user interface and navigating scenes before moving into modeling, texturing, lighting, animating, rendering and more. Additionally, more advanced features such as character rigging, skinning, animating with dynamics and MEL scripting are also introduced.\n\nEach chapter begins by examining the concept behind each task, the goal and the necessary features that are involved. Then you go in-depth with the objective of your task as you study examples and learn the steps necessary to complete it. Working your way through the comprehensive, step-by-step lessons, you'll develop the confidence you need to create incredible renderings and animations using Autodesk Maya.\n\nWho this book is for\n\nThis text was created specifically for users with no prior 3D modeling or animation experience. If you want to work in a creative field or are just curious about how 3D animated movies are made this book is the perfect way to get started. Users who are migrating from another 3D application or upgrading from a previous version of Maya will also benefit greatly from this text.\n• How to create models using primitives, curves, NURBS, Polygons and more\n• How to assign materials and textures to make realistic-looking models\n• How to use Paint Effects to paint on and quickly create complex 3D Models\n• How to use lights, cameras, and depth of field to render captivating scenes\n• How to use keyframes, motion paths and the Graph Editor to create animations\n• How to use character rigging, skinning, and inverse kinematics to animate realistic movements\n• How to use various deformers to manipulate objects, animations and special effects\n• How to add influence objects, skin weights and hair to a character for a more realistic look\n• How to use dynamics to create fire, smoke, lightning, explosions, cloth and ocean effects\n• How to enable raytracing, motion blur, and fog effects for increased realism\n• How to render stills and animations using Maya Vector and Mental Ray for different looks\n• How to use the Command Line and MEL Scripting to work faster\n\nMaya is a program, created by Autodesk, used to model, animate, and render 3D scenes. 3D scenes created with Maya have appeared in movies, television, advertisements, games, product visualizations, and on the Web. With Maya, you can create and animate your own 3D scenes and render them as still images or as animation sequences."
    }
]