[
    {
        "link": "https://reddit.com/r/ZodiacKiller/comments/16fo5ux/has_anyone_tried_this_method_for_solving_z13",
        "document": "Disclaimer: Before I get people telling me this is not a perfectly sound approach, I understand this relies on several assumptions that really can't be made with much confidence even on their own, and will state that I am just doing this for fun to see what I find. I think my actual chances of solving a cipher that has eluded top intelligence agencies for over half a century are less than that of me winning the lottery. I just enjoy problem solving and think this is one way to approach the puzzle.\n\nOn Friday, I ended up going down the rabbit hole of the Zodiac Killer story, as I'm sure everyone else here has. While I was previously familiar with the story and that the killer left coded messages, it wasn't until this weekend when I came across the story of the Z340 Cipher and how it was solved that my problem solving side suddenly had its interest piqued.\n\nAlthough the difficulty of solving the Z13 Cipher is astronomically harder given its limitations (due to its length), two things have made me want to at least play with it:\n• If ZK understood the challenges behind cracking a cipher of this size, he frankly could have been confident enough to encode his true name (especially given that his previous Z340 Cipher had gone several months without being solved and would have been much simpler to decode, making him comfortable with more risk-taking). If this is the case, then solving it doesn't just provide an unhelpful, taunting messages, but leads you directly to the killer.\n• This cipher has unique solving advantages relative to the other ciphers because:\n• It cannot really have the added creative encryption layers that were given to the Z340, where it was both cut up into sections and read diagonally going 1 down and 2 over. Additionally, the challenge of incorporating an anagram, for example, is that because the message is simply a name, you would basically be making a coded message of gibberish if you tried to anagram a name. It would be meaningless even if you had the key, and there's not really much room to systematically rearrange the letters for someone to see the pattern once decoded.\n• The cipher's length does not really leave room for there to be a complex key. In the other ciphers, many letters had several possible symbols and needed to, because a simple 1-to-1 key on a cipher that large would be solvable by most of humanity. However, in this case, if ZK was really trying to leave a possibility of this to be solvable, having any single letter have more than 2 possible symbols tops essentially dilutes any possibility of this ever being solved. You would basically not be giving a name at all if you went too far beyond a 1-to-1 key. I would think maximum, only 2 letters used could have more than one symbol, and no letter would have more than 2 symbols associated with it. My hunch is that it is truly a 1-to-1 key though since it is so small.\n• There is little room for clerical error. Due to the size of the other ciphers, it is very likely for ZK to have made at least a couple of mistakes in encoding the message, which is partly why the Z340 was so difficult to crack. With only 13 characters, however, it is extremely unlikely you are getting any errors from encoding, so you are working with a clean cipher.\n• While coded messages can allow for the solver to use several techniques in unmasking patterns in the message to begin uncovering a key, the downside is that the degrees of freedom are so large that there is no possibility of brute forcing possible answers. Names, however, are way more predictable, and also only follow a few possible formats. These would be First Last, First Middle Last, First M Last, First L, First M L, F M Last, and F Last. We also know that the individual is male, so if it includes a first name, then you really narrow down the number of names that can fit into the front end of the cipher.\n\nAll of that said, and especially considering the 2nd and 4th bullet points, the ability to brute force an answer by generating a massive dataset of possible names and then running a pattern filter through the dataset to uncover potential names that meet a 1-to-1 cipher is very easy. This also allows you to pre-filter the outcomes to only allow for true names and then narrow that list to ones that fit the cipher, basically reverse-engineering the process.\n\nIf one were to try to brute force the thing traditionally, this would be much more challenging, as there would be ~17 billion possibly outcomes (8 unique characters, or 26 x 25 x 24 x 23 x 22 x 21 x 20 x 19 outcomes), most of which would be pure gibberish too. Trying to cut the list down from this to truly feasible answers would be difficult.\n\nWhat I've done thus far with this thought process was gathered several common first and last names, and created ~41 million 13-character name combinations of various formats listed above. The first names used, I grabbed from a dataset from the Social Security Administration, which has lists for each year that provide all first names that applied for a SSN that year that had a frequency of at least 5 applicants. I used all unique male names that spanned applications between the years 1929 and 1949 (I chose this timeframe because the first ID of the ZK was in 1969, in which the identifier described ZK as a man in his mid-twenties to early-thirties. This span of time would mean I would get all remotely common names from the years ZK may have been born, if he was anywhere between 20 to 40 years old at the time of being identified). This list came out to just over 8,000 first names. I then used a separate SSA dataset that had the top 1,000 most common last names in the year 2000. I would have gone back to the timeframe that ZK was born, but the SSA does not go back anywhere near that far with last names. However, given that last names cannot trend like first names can, I am guessing these last names are at least close to what would have been common in that timeframe.\n\nFrom here, I used a small .NET code to iterate over all of the full names and determine if they met the cipher. If it is truly a 1-to-1 key cipher, then you can take each string (currentText) and run the following 33 conditions on it to see if it fits the cipher:\n\ncurrentText(0) <> currentText(1) AND currentText(0) <> currentText(2) AND currentText(0) <> currentText(3) AND currentText(0) <> currentText(4) AND currentText(0) <> currentText(5) AND currentText(0) <> currentText(7) AND currentText(0) <> currentText(9) AND currentText(0) = currentText(11) AND currentText(1) <> currentText(2) AND currentText(1) <> currentText(3) AND currentText(1) <> currentText(4) AND currentText(1) <> currentText(5) AND currentText(1) <> currentText(7) AND currentText(1) <> currentText(9) AND currentText(2) <> currentText(3) AND currentText(2) <> currentText(4) AND currentText(2) <> currentText(5) AND currentText(2) <> currentText(7) AND currentText(2) <> currentText(9) AND currentText(2) = currentText(10) AND currentText(3) <> currentText(4) AND currentText(3) <> currentText(5) AND currentText(3) <> currentText(7) AND currentText(3) <> currentText(9) AND currentText(4) <> currentText(5) AND currentText(4) = currentText(6) AND currentText(4) <> currentText(7) AND currentText(4) = currentText(8) AND currentText(4) <> currentText(9) AND currentText(5) <> currentText(7) AND currentText(5) <> currentText(9) AND currentText(7) <> currentText(9) AND currentText(7) = currentText(12)\n\nI ran this on my 41 million possible name strings and was able to find 1 match. While this isn't incredibly exciting, I think the cool part is that (1.) this only took a couple of hours to set up and now that I've done that, I can easily up the dataset and run more when I have another hour or two this week, (2.) the actual processing time to execute the code over the full dataset was a couple of minutes, so I could feed this code hundreds of times the combinations I've used here and really open up the possibilities, and (3.) I didn't really use that many names from the get-go. For example, Alfred E. Neuman was not in my 41 million because Neuman was not a top 1000 last name. I've found a database that has 150,000+ common last names in it and can probably find one of similar size for first names to really amp up the dataset, and then let my computer run its course for a few days to see what kinds of names come out of it.\n\nFor those curious, the one match I got was Oather E. Newton, and when I searched this name, nothing interesting came up. I had actually never heard of the name Oather prior to this, but apparently it was a name from back during this time frame and you can find plenty of obituaries that have Oather as a first or middle name.\n\nIf I find any more interesting solutions to the cipher through this method once I really expand the search, I will report back. If you have tried this method, please share and if you've had any interesting hits from it. Hope someone found this interesting!"
    },
    {
        "link": "https://reddit.com/r/ZodiacKiller/comments/lsgqsp/some_simple_toughts_about_the_z13_cipher",
        "document": "I'm a newbie on this forum and I just want to share with you some thoughts I had about the Z13 cipher.\n\nI don't think I've seen elsewhere the approach which I'll try to explain here, and which seems to provide a very simple (too simple ?) solution to the Z13 cipher (if this is not the case, my apologies in advance for having rediscovered something that has already been done before).\n\nI assume that the Z13 code was designed to be deciphered (and not as an unbreakable code or gibberish) : we can easily imagine the Zodiac being torn between his desire to show his intellectual superiority by imagining complex ciphers, but also his will that these codes can be deciphered so that their content can be known to the public.\n\nHowever, using a substitution cipher for the Z13 (as for the Z408 or Z340) would not easily lead to a decodable message, since the text here is too short to find the correct key. The various tests carried out, assuming that the code was written using the substitution method, do not seem to give very satisfactory results : so we can imagine that the coding method for the Z13 cipher is a little bit different from those used in other longer codes.\n\nThe hypothesis made here is that an extremely simple, even simplistic, coding method was used. Let's just put the Z13 cipher upside down :\n\nAssuming that the alphabetic signs stand for what they are (except for the letter M which becomes W because of the rotation), it's very tempting to read something like \"want to know ...\". Given the context (\"My name is ___\"), it is clear that the question \"want to know my name?\" would make sense.\n\nI know that's seeing in this code something like \"want to know my name ?\" is totally arbitrary and that the decryption of the others zodiac's ciphers taught us that it's not really a good idea to pick up directly readable words in the code (for example, the \"wrong\" signature ZOΔAIK at the end of the Z340 cipher). But let's try and see where it takes us !\n\nIf we try to develop this intuition, we obtain something like that. Note in particular that :\n• the letters of each word are generally mixed up and they are all the more mixed as we advance in the code ;\n• when two words share a common letter, this letter appears only once and make the junction between these two words (the mixing is choised to allow this junction) : T for want/to, o for to/know et m for my/name (no junction letter for know/my).\n\nAs indicated above, the alphabetic signs are unaltered by the coding process, with the exception of the letter M, which becomes W due to the rotation of the code. And every non-alphabetic sign is decoded as follows:\n• The \"O/8 sign\" is a \"joker sign\", which can represent several letters : the first one (therefore the third one in the initial direction of the cipher) represents an O, the second one an N and the third one a Y. It's a huge difference with the Z408 and Z340 ciphers, where each sign encodes only for a single letter ;\n\nI stress the fact that, in this way, each non-alphabetic character must absolutely correspond to just one letter: there is no arbitrary choice to make it correspond to this or that letter. The \"anchor sign\" must be a T to give \"WANT\", the first \"O/8 sign\" must be a \"O\" to form \"TO\", the second one must be à \"N\" to form \"KNOW\", the \"anchor sign\" must be a \"M\" to make the junction beetween \"MY\" and \"NAME\", and the last \"O/8 sign\" must therefore be à \"Y\".\n\nIf we go back to the initial code, we obtain something like this :\n\nThere are several ways to continue, knowing that the more manipulations you add, the less realistic the solution is.\n\n1/ We can just stop right here : the answer to the question \"My name is ___\" is simply a new question \"want to know my name?\", which is in the spirit of what we can expect from the Zodiac. Simply a new taunt about his identity (I don't think it's credible to wait for him to reveal his real name in this code ...).\n\n2/ Look only at the non alphabetical signs : one can imagine that the coded signs have a particular value. The non-alphabetical sequence can be read as \"M / Y / N / O / T\". If you absolutely want to see a name there, you can read from right to left \"TONY M\" or an anagram of \"MONTY\". But I don't think these solutions are very credible and I write them only to try to review all possibilities.\n\n3/ Search for particular words in the entire code : there can be a lot of different solutions but here are my favorites.\n\nIf we take only the odd letters, we get \"A / N / Y / N / O / N / M\" : it does not take too much imagination to see the word \"ANONYM\", in the form of an anagram (unfortunately with an extra N, which weakens this approach). Of course, we can also find this type of solution by arbitrarily selecting the letters in the code (and not just the odd letters) : the reading direction of the words is preserved here, but the letters are selected arbitrarily, which also weakens the solution. It is then easy to find \"ANONYM\" (6 letters used out of 13, which is not much) or \"AN ANONYM\" (8 letters used out of 13, which is already better)\n\nDespite everything, this type of solution leading to the answer \"ANONYM\" or \"AN ANONYM\" to the question \"my name is ___\" is my favorite ! It is quite logical and corresponds well to the idea of a new taunt about the zodiac's identity. We could also see a response like \"ANYONE\" and probably many other words, but I think that the \"ANONYM\" solution is the most satisfactory in my opinion.\n\nAnyway, I am not claiming of course that this solution is the right one, but it doesn't appear to me so unrealistic compared to what I've seen elsewhere. But it also has a number of disadvantages that should not be hidden :\n• Its simplicity, which seems coherent with the fact of having a code that is both short, but also decodable ;\n• The solution, which seems imo in the spirit of what we can expect from the Zodiac ...\n• Its simplicty again... maybe this method is too simplistic/childish ?\n• Seeing in the code something like \"want to know my name?\" is totally arbitrary and just comes from an impression to see directly readable words in the original code ;\n• The letters used to form \"ANONYM\" or \"AN ANONYM\" are selected randomly, and some unused letters are left : \"EKMTAM\" (maybe you can add a \"ME\" for \"me, an anonym\" ?). But if the code is really based on the method exposed above, there must necessarily be left letters (except the answer is a perfect anagram of the initial question, which is not obvious to achieve).\n\nIn any case, there are some elements to continue thinking about the meaning of the Z13 cipher !"
    },
    {
        "link": "https://zodiacciphers.com/zodiac-news/the-poe-solution-to-z13",
        "document": ": \"The killer wouldn't dare, as he claimed in letters to the newspapers, to reveal his name in the cipher to established cryptogram experts. He knows, to quote Edgar Allan Poe, that any cipher created by man can be solved by man. Zodiac has not told the truth in his cipher messages to the Examiner, the Chronicle and the Vallejo Times-Herald. Zodiac has not done this, because to tell the complete truth in relation to his name - in cipher code - would lead to his capture. I invite Zodiac to send The American Cryptogram Association a cipher code - however complicated - which will truly and honestly include his name\".\n\n\n\n​The Zodiac Killer responded on November 8th 1969 by using the scytale method of decryption featured at the top of Poe's essay A Few Words On Secret Writing. Or should I say, it can be used to crack the 340 cipher encrypted message, that contained the wording \"one in paradice\" just like Edgar Allen Poe's poem to his dead wife entitled \"To One In Paradise\". The next method of encryption in Poe's A Few Words On Secret Writing involved splitting the alphabet A to M and N to Z (two sections of thirteen) mirroring the Zodiac's 13 character code which began with A and ended with M - and because of the distinct lack of characters in this code - it has been considered unsolvable using standard cryptographic methods.\n\n\n\n​The Zodiac seemingly didn't supply us with a key to this code in later communications, leading me to believe that the key or answer lies in the Edgar Allen Poe essay mentioned above. I believe the answer to the code is \"This is the Zodiac speaking. By the way have you cracked the last cipher I sent you? My name is....Fk, I'm crackproof, in which each element of the phrase is begun by each of the circled eights, thereby creating an infinite circular cipher (hence the circled 8's which represent infinity and a new beginning). The Zodiac Killer may have supplied us with the answer to the Z13 code in the 13-Hole postcard on October 5th 1970 in which he configured the punched holes in an arrangement of 10 to 3, pinpointing the position of the three eights, and supplying the answer of Fk, I'm crackproof. Using Edgar Allen Poe's reasoning in A Few Words On Secret Writing, I can now place five letters in the correct position within the 13 character code, albeit not to my complete satisfaction. The Zodiac Killer responded on November 8th 1969 by using the scytale method of decryption featured at the top of Poe's essay. Or should I say, it can be used to crack the 340 cipher encrypted message, that contained the wordingjust like Edgar Allen Poe's poem to his dead wife entitledThe next method of encryption in Poe'sinvolved splitting the alphabet A to M and N to Z (two sections of thirteen) mirroring the Zodiac's 13 character code which began with A and ended with M - and because of the distinct lack of characters in this code - it has been considered unsolvable using standard cryptographic methods.​The Zodiac seemingly didn't supply us with a key to this code in later communications, leading me to believe that the key or answer lies in the Edgar Allen Poe essay mentioned above. I believe the answer to the code isUsing Edgar Allen Poe's reasoning inI can now place five letters in the correct position within the 13 character code, albeit not to my complete satisfaction.\n\nHere is a section of reasoning from Edgar Allen Poe's A Few Words On Secret Writing where A can represent N and vice versa, where B can represent O and vice versa, and where C can represent P and vice versa. But he also makes a point of saying A might stand for P (or vice vera). This is where I shall jump into the code using a trial and error approach.\n\nIf A can stand for P, I shall place P above the A in the beginning of the Z13 code like so:\n\nIf A can stand for P, and P can also represent C, then A can also stand for C. So let us insert the letter C above A in the Z13 code.\n\nIf A can represent N and vice versa, B can represent O and vice versa, and C can represent P and vice versa, then E can represented R. So let us place R in the Z13 code.\n\nEdgar Allen Poe stated that N can represent A, so let us place A above the second N in the Z13 code:\n\nIf A can stand for P, and P can also represent C, then A can also stand for C. This means that if M can stand for X, and X can represent K, then M can also stand for K (just like A stood for C). So let us insert K into the Z13 code:\n\nIf the K and M between the three eights are representative of themselves as I have previously surmised, then we have the beginning of the answer to the Z13 code. But without this assumption, we have five letters inserted that mirror the previous solution I have suggested - all reasoned from Edgar Allen Poe's essay. It's not perfect, but it's a start."
    },
    {
        "link": "https://60thfever.medium.com/zodiac-killer-name-cipher-vs-artificial-intelligence-gpt-copilot-and-gemini-700b1c3753d3",
        "document": "Every so often I see what happens when you input some questions for the Zodiac Killer into some of the LLM’s or large language models currently popular. For this experiment I used Chat GPT 5, Microsoft Copilot, and Google Gemini for this experiment. I believe that as these become more sophisticated that more ideas will be put out by these artificial intelligence programs. I am excited for the possibility of an artificial general intelligence to take over this case to possibly see what creative ways it would be able to solve this case. In regards to my other posts I am and feel confident that it will name Joseph Paul Franklin as the prime individual responsible for the crimes.\n\nIf you don’t know who Joseph Paul Franklin is please check out some of my other articles but in the meantime here are the results as of May 2024 of the following experiment on the LLM’s and the Zodiac Killer.\n\nI wanted to share what I found when prompted for the Zodiac Killer name cipher vs three artificial intelligence LLM (Large Language Models).\n\n“What do you think the Zodiac Z13 name cipher says?”\n\nChat GPT: “The Zodiac Killer, an unidentified serial killer active in Northern California during the late 1960s and early 1970s, claimed to have sent cryptic messages to the media. One of these messages was the “Zodiac Z13 name cipher,” which was sent to the San Francisco Chronicle in 1970. The cipher has never been definitively solved, and its exact meaning remains a mystery. Over the years, numerous amateur and professional cryptographers have attempted to decipher it, but no consensus has been reached on its interpretation. Some believe it may contain the killer’s identity or other crucial information, while others think it could be a hoax or a red herring. Without a breakthrough in codebreaking or new evidence, the meaning of the Zodiac Z13 name cipher is likely to remain elusive.”\n\nMe: What do you think the Zodiac Z13 name cipher likely says?\n\nCopilot: The Zodiac Z13 cipher has been the subject of much speculation and analysis. Let’s explore some of the proposed solutions:\n• One interpretation suggests that the Zodiac symbol represents “zero at North,” resulting in the phrase “No Name No Name” when read around the wheel using opposite sectors for substitutions1.\n• This solution remains consistent regardless of how many times you spin the wheel or in which direction.\n• Another amateur sleuth claimed to have cracked the Z13 cipher, resulting in the partial solution “KAYR.” This is close to the name “Lawrence Kaye,” a longtime suspect in the Zodiac murders2.\n• “I am Kane. I am a man. I am aka Zodiac.”:\n• Yet another interpretation reveals the phrase “I am Kane. I am a man. I am aka Zodiac” when deciphered3.\n• This solution provides a more detailed message, but its authenticity remains uncertain.\n\nIn summary, the Z13 cipher remains enigmatic, with multiple proposed solutions. Without further input from the killer, definitive conclusions are elusive. Keep in mind that the Zodiac Killer’s ciphers continue to captivate amateur sleuths and researchers alike, making them an enduring mystery in true crime history.\n\nThe following pages were given as references to the Microsoft Copilot:\n\nMe: What do you think the Zodiac Z13 unsolved cipher likely says?\n\nGemini: The Zodiac Z13 cipher is unfortunately very difficult to crack due to its short length. This makes it hard to apply common decryption methods that rely on frequent letter patterns. Experts believe it’s a substitution cipher, where letters are replaced with other letters or symbols.\n\nHere’s some information about the Z13 cipher:\n• Short length: At only 13 characters, the Z13 cipher offers limited data to work with for decryption.\n• Possible substitution cipher: It’s believed to be a substitution cipher, but without knowing the substitution method, it remains indecipherable.\n\nThere have been attempts to solve the Z13 cipher, some suggesting names or phrases, but none have been universally accepted.\n\nIf you’re interested in learning more about the cipher and deciphering attempts, you can search for “Zodiac Z13 cipher solution” online.\n\nConclusion: It seems that while some interesting solutions but of course nothing has come of any of the proposed solutions just yet."
    },
    {
        "link": "https://forum.zodiackillerciphers.com/community/zodiac-cipher-mailings-discussion/some-simple-toughts-about-the-z13-cipher",
        "document": "I’m a newbie on this forum and I just want to share with you some thoughts I had about the Z13 cipher.\n\nI don’t think I’ve seen elsewhere the approach which I’ll try to explain here, and which seems to provide a very simple (too simple ?) solution to the Z13 cipher (if this is not the case, my apologies in advance for having rediscovered something that has already been done before).\n\nI assume that the Z13 code was designed to be deciphered (and not as an unbreakable code or gibberish) : we can easily imagine the Zodiac being torn between his desire to show his intellectual superiority by imagining complex ciphers, but also his will that these codes can be deciphered so that their content can be known to the public.\n\nHowever, using a substitution cipher for the Z13 (as for the Z408 or Z340) would not easily lead to a decodable message, since the text here is too short to find the correct key. The various tests carried out, assuming that the code was written using the substitution method, do not seem to give very satisfactory results : so we can imagine that the coding method for the Z13 cipher is a little bit different from those used in other longer codes.\n\nThe hypothesis made here is that an extremely simple, even simplistic, coding method was used. Let’s just put the Z13 cipher upside down.\n\nAssuming that the alphabetic signs stand for what they are (except for the letter M which becomes W because of the rotation), it’s very tempting to read something like \"want to know …\". Given the context (\"My name is ___\"), it is clear that the question \"want to know my name?\" would make sense.\n\nI know that’s seeing in this code something like \"want to know my name ?\" is totally arbitrary and that the decryption of the others zodiac’s ciphers taught us that it’s not really a good idea to pick up directly readable words in the code (for example, the \"wrong\" signature ZOΔAIK at the end of the Z340 cipher). But let’s try and see where it takes us !\n\nIf we try to develop this intuition, we obtain something like that. Note in particular that :\n\n – the letters of each word are generally mixed up and they are all the more mixed as we advance in the code ;\n\n – when two words share a common letter, this letter appears only once and make the junction between these two words (the mixing is choised to allow this junction) : T for want/to, o for to/know et m for my/name (no junction letter for know/my).\n\nAs indicated above, the alphabetic signs are unaltered by the coding process, with the exception of the letter M, which becomes W due to the rotation of the code. And every non-alphabetic sign is decoded as follows:\n\n – The \"anchor sign\" represents the letter T;\n\n – The \"O/8 sign\" is a \"joker sign\", which can represent several letters : the first one (therefore the third one in the initial direction of the cipher) represents an O, the second one an N and the third one a Y. It’s a huge difference with the Z408 and Z340 ciphers, where each sign encodes only for a single letter ;\n\n – The \"crosshair sign\" represents the letter M.\n\nI stress the fact that, in this way, each non-alphabetic character must absolutely correspond to just one letter: there is no arbitrary choice to make it correspond to this or that letter. The \"anchor sign\" must be a T to give \"WANT\", the first \"O/8 sign\" must be a \"O\" to form \"TO\", the second one must be à \"N\" to form \"KNOW\", the \"anchor sign\" must be a \"M\" to make the junction beetween \"MY\" and \"NAME\", and the last \"O/8 sign\" must therefore be à \"Y\".\n\nIf we go back to the initial code, we obtain something like this :\n\nThere are several ways to continue, knowing that the more manipulations you add, the less realistic the solution is.\n\n1/ We can just stop right here : the answer to the question \"My name is ___\" is simply a new question \"want to know my name?\", which is in the spirit of what we can expect from the Zodiac. Simply a new taunt about his identity (I don’t think it’s credible to wait for him to reveal his real name in this code …).\n\n2/ Look only at the non alphabetical signs : one can imagine that the coded signs have a particular value. The non-alphabetical sequence can be read as \"M / Y / N / O / T\". If you absolutely want to see a name there, you can read from right to left \"TONY M\" or an anagram of \"MONTY\". But I don’t think these solutions are very credible and I write them only to try to review all possibilities.\n\n3/ Search for particular words in the entire code : there can be a lot of different solutions but here are my favorites.\n\nIf we take only the odd letters, we get \"A / N / Y / N / O / N / M\" : it does not take too much imagination to see the word \"ANONYM\", in the form of an anagram (unfortunately with an extra N, which weakens this approach). Of course, we can also find this type of solution by arbitrarily selecting the letters in the code (and not just the odd letters) : the reading direction of the words is preserved here, but the letters are selected arbitrarily, which also weakens the solution. It is then easy to find \"ANONYM\" (6 letters used out of 13, which is not much) or \"AN ANONYM\" (8 letters used out of 13, which is already better)\n\nDespite everything, this type of solution leading to the answer \"ANONYM\" or \"AN ANONYM\" to the question \"my name is ___\" is my favorite ! It is quite logical and corresponds well to the idea of a new taunt about the zodiac’s identity. We could also see a response like \"ANYONE\" and probably many other words, but I think that the \"ANONYM\" solution is the most satisfactory in my opinion.\n\nAnyway, I am not claiming of course that this solution is the right one, but it doesn’t appear to me so unrealistic compared to what I’ve seen elsewhere. But it also has a number of disadvantages that should not be hidden :\n\nPros\n\n – Its simplicity, which seems coherent with the fact of having a code that is both short, but also decodable ;\n\n – The solution, which seems imo in the spirit of what we can expect from the Zodiac …\n\nCons\n\n – Its simplicty again… maybe this method is too simplistic/childish ?\n\n – Seeing in the code something like \"want to know my name?\" is totally arbitrary and just comes from an impression to see directly readable words in the original code ;\n\n – The letters used to form \"ANONYM\" or \"AN ANONYM\" are selected randomly, and some unused letters are left : \"EKMTAM\" (maybe you can add a \"ME\" for \"me, an anonym\" ?). But if the code is really based on the method exposed above, there must necessarily be left letters (except the answer is a perfect anagram of the initial question, which is not obvious to achieve).\n\nIn any case, there are some elements to continue thinking about the meaning of the Z13 cipher !"
    },
    {
        "link": "https://reddit.com/r/ZodiacKiller/comments/13oocov/the_main_problem_with_the_z13_z32_ciphers",
        "document": "That they are too short... But are they longer?\n\nDo you really think that the Zodiac didn't know how impossible it is to get a conclusive solution for such short encryptions?\n\nMaybe Zodiac's ego got to him after he was challenged to actually put his real name in the cipher, so he did, but faked the length?\n\nCan we look more into the symbols themselves and maybe rotate and add them back to the original set to be read diagonally or whatever sequence?\n\nCan it produce a higher than normal number of patterns and repetitions \"Bigrams\" if an AI took the burden of trial and error?\n\nI think it's worth the admittedly long shot, but hey, that's how the previous two were solved.\n\nSorry if this is the zillionth time this is suggested or if it's completely off, but these questions keep popping up in my amateur head ever since the 340 was finally deciphered.\n\nRough example attached, but you get the idea."
    },
    {
        "link": "https://ciphermysteries.com/other-ciphers/zodiac-killer-ciphers/zodiac-killer-z32",
        "document": "The “Z32” cipher (i.e. the Zodiac Killer’s 32-character-long cipher, also known as the “map code” cipher, or the “Phillips roadmap cipher”) was sent to the San Francisco Chronicle on 26th Jun 1970. It was part of a letter that ended in this way:-\n\nThis cipher was accompanied by a section of a map: made by the Phillips 66 company, this was a roadmap of California that at that time was widely available at service stations. (There’s a huge version here.) The Zodiac Killer had placed his signature symbol on top of Mount Diablo, together with what seem to be instructions as to how to link the map with the contents of the cipher.\n\nA follow-up note from the Zodiac Killer (on page 5 of the “little list” letter, postmarked 26th July 1970) added: “PS. The Mt. Diablo code concerns Radians &#inches along the radians“.\n\nOnly three shapes (the ‘C’-shape, the ‘O’-shape, and the hollow triangle shape) within the ciphertext appear twice: everything else appears exactly once. This seems to imply that we are looking at a homophonic cipher, the same cipher technique that the Zodiac Killer used in his Z408 cipher. As a result, it would be impossible to solve such a small homophonic ciphertext unambiguously without a large amount of extra information, or without knowing the cipher key.\n\nInterestingly, because nearly all of the cipher shapes used in the (solved) Z408 cipher key reappear in this cipher, it seems possible that this might do the trick. Unfortunately, applying the Z408 homophonic cipher key to it yields nothing that makes any obvious sense:-\n\nFurthermore, solving this (slightly more language-like) cipher as if it were a newspaper cryptogram again seems to yield nonsense, e.g. “dsbelishourtwichthekingmadearses“.\n\nThe Phillips 66 California roadmap scale for “San Francisco And Vicinity” is 1 inch to about 6.4 miles: so the plaintext should presumably contain both a number (for the direction) and a number in inches (i.e. to be multiplied by 6.4 to give a physical distance in miles along that direction).\n\nThe reference to magnetic north seems to imply that the bearing was calculated not from the map, but by eye from the peak of Mount Diablo. (Here’s a video panorama taken from the top platform area, and diagrammatic views facing North and facing South.)\n\nPeople will always have different opinions on anything to do with the Zodiac Killer, but it seems most likely to me that at the top of Mount Diablo he turned his watch round (or rotated an external bezel) so that 12 o’clock faced magnetic North; and then read off the time (or bezel value) that would point to his bomb target of choice. Hence the plaintext part indicating ‘direction’ could easily be something like a time, though some people have concluded that it would be measured in radians.\n\nIn 1970, magnetic North for this area fell 15 degrees clockwise of true North: so for example San Francisco (at 256 degrees round from true North) would have been at about 241 degrees clockwise relative to magnetic North, i.e. extremely close to “eight o’clock”. Similarly, San Mateo sits 227 degrees from true North, i.e. 212 degrees from magnetic North, i.e. extremely close to “seven o’clock”.\n\nThe most famous claimed solution to the Z32 cipher was by Gareth Penn, who was convinced that the word “radians” held the key, and that the locations of various killings (relative to Mt Diablo) were determined by some kind of mathematical or geometric scheme. However, it seems fairly unlikely that this was correct, and few now believe that the Zodiac Killer followed the precise scheme suggested by Penn."
    },
    {
        "link": "https://reddit.com/r/ZodiacKiller/comments/mgq190/zodiac_z32_cipher_new_solution_and_maybe_not_a",
        "document": "Over the past few weeks, I’ve tried to find some convincing solutions to the Z32 cipher but, while the results were not uninteresting, some weaknesses remained, and they were not totally satisfactory.\n\nThis time, I feel like I have something rather convincing but, of course, I'll let you be the judge !\n\nAs this post is a little long (but there is a map at the end…), here is the quick conclusion:\n• The text contained in the Z32 cipher could be “ON FEAR RD, ONE IN RADIAN EIGHT, WE ROAD” (I learned that using ROAD instead RODE is a common misspelling in English).\n• The place indicated in the cipher is situated in Alamo, Contra Costa County, near two elementary schools (within a distance of 0.5 mi ) and along the Donald D. Doyle Highway.\n• This solution is not obtained through guessing what the answer could/should be, but is based on the application of the key obtained from the Z340 cipher and only very few new/natural hypotheses are introduced.\n\nFirst step: apply the Z340 key twice in a row to the Z32 cipher\n\nMy basic idea is that the key to decode the Z32 cipher can’t be a new key. If this were the case, it would be impossible to decode because the message is too short and there are too few repeated signs (unlike the Z408 and Z340 ciphers). And I can’t think the Zodiak gave us an undecodable message!\n\nThe only two keys already available are those of the Z408 and Z340 ciphers. The Z340 key is the best candidate: the Z340 signs have more similarities with those of the Z32 signs (the Z32 only has two new signs compared to the Z340) and the Zodiac might have been encouraged to reuse it because the Z340 didn’t have been solved at the time.\n\nThe most natural way to make a new key from an existing key is to apply it twice in a row. This is the method uses below :\n\nSeveral points should be noted:\n• Expressions like “ON FEAR” on the left and ROAD, WE on the right, are clearly visible, which is rather encouraging.\n• The 2 new signs compared to the Z340 cipher appear in blue and are left undecoded at this stage.\n• There are three additional undecoded signs (represented with ?) corresponding to the \"I\" obtained after the first application of the key, and which give an unknown result after the second application.\n\nSecond step: find the right direction to read the signs\n\nThis is ultimately the most difficult step and the Z340 solution shows that the Zodiac can be very inventive...\n\nThe idea here is to split the Z32 into 4 block and to read the characters in the following order:\n\nThen I assume that the ?, corresponding to the I obtained after the first application of the key, remain I after the second application. Which give (the parts to be read backwards are in parentheses) :\n\nON FEAR RD (ONE) (IN) RIDI(AN.) EI.IDT WE ROAD\n\nOnly remain the two new signs not included in the Z340 key: here I’m assuming they are just silent characters. It’s a bit surprising but think about it: 1/ these signs don’t belong to the Z340 key, 2/ the 1st line, which contains these two characters, has two extra characters compared to the 2nde one although we know that the Zodiac is very attached to having symmetrical ciphers. Maybe these characters were introduced just to keep a 1st line of 17 characters, as for the Z408 or Z340 ciphers ? or maybe they are just here to make things more complicated (if so, it's successful) ?\n\nIn short, we therefore finally obtain:\n\nON FEAR RD (ONE) (IN) RIDI(AN) EIIDT WE ROAD\n\nOf course, the words RIDI(AN) and EEIDT are problematic. But I'm not too surprised because we know that the Zodiac makes, from time to time, intentional or unintentional coding errors : applying a coding key twice in a row, as assumed here, further increases the risk of errors.\n\nReading RADIAN instead of RIDIAN seems pretty natural. Concerning EEIDT, you'd expect to read a digit: if it's 5 letters long, starts with EI and ends with T, EIGHT is a pretty obvious solution.\n\nThe final result is therefore:\n\nON FEAR RD (ONE) (IN) RADI(AN) EIGHT WE ROAD\n\nThird step : but where is it ?\n\nThe length is quite obvious: 1in on the Philips 66 Map is equivalent to 6.4mi / 10.3km.\n\nRadian 8 is to be read as on a clock: 240°, to which must be added the 17° for the deviation from magnetic north (average value in 1970 in the San Francisco area) : the final angle is 257° measured from the geographic north.\n\nThe location indicated is in Alamo, less than 0.5mi from two elementary schools: Doris-Eaton School to the south and Alamo Elementary School to the north.\n\nThese two schools were already built in 1970 when the Zodiac cipher was sent. And these schools are located next to important roads (Donald D. Doyle Highway, Livorna Road and Stone Valley Road), which could be a good play to set in the bomb to which the Zodiac refers (in particular, one side of the highway is bordered by sloping embankments, as in Zodiac’s sketches of his explosive device).\n\nWhy I think it’s a not so bad solution?\n\n1/ The deciphering method is not arbitrary and is based on the Z340 cipher key. It does not involve odd numerology or guessing a new key to decode what one has already decided to find there. Of course, the text contains errors but ultimately quite limited in number imo.\n\n2 / Regarding the distance of 1in from Mt Diablo, it is relatively short compared to the size of the Philips 66 map, which is consistent with the fact that the angle was measured on site (it is difficult to correctly point a place when it’s far away). The fact that the location is situated at the intersection of major roads may also have made it easier: I can imagine that a highway could be more easily seen from the Mt Diablo summit than school buildings.\n\n3 / Regarding the angle at 8 o'clock, it's not a true radian, but I don't find it so surprising. First, this is consistent with the drawing of a watch made by the Zodiac on the map accompanying the cipher and suggesting that “radians” actually correspond to an angle measured with hours. But above all, the angle at 8 o'clock is consistent with another letter of the Zodiac sent one month later (Little list letter) which points strongly in this direction:\n\nI obviously have no certainty that this is the right solution, and it would be very pretentious; but I have the feeling that here are some interesting arguments: tell me what you think about it!"
    },
    {
        "link": "https://scholarworks.sjsu.edu/cgi/viewcontent.cgi?article=1055&context=etd_projects",
        "document": ""
    },
    {
        "link": "https://ciphermysteries.com/2014/01/30/swedish-zodiac-killer-z32-theory",
        "document": "A few days ago, I had a nice email from two Swedish engineers called Henrik (Henke) Sundberg and David Thelin: surprisingly, they claimed that they had worked out the details of the Zodiac Killer’s 32-character “map cipher” (also known as “Z32”).\n\nThe first thing I did was to put up a new page describing the Z32 cipher, something I’ve been meaning to do for a few years: as normal, I tried to cover the raw factuality and basic observations rather than out-and-out theories and speculation.\n\nThe short version is that the letter-shapes in the Z32 cipher look nearly exactly the same as the (famously solved) Z408 cipher, which makes it seem very much as though it too is a homophonic cipher, though with different letter assignments (deciphering it using the Z408 key doesn’t seem to yield anything sensible). Unfortunately, 32 characters (made up of 29 different shapes, i.e. only three appear more than once) wouldn’t normally be anywhere near large enough for a homophonic cryptogram to be cracked, unless you had some significant additional information to work with. (Hint: a cipher key would be a good start. 🙂 )\n\nHowever, in this case there was some other extra information: a roadmap of the San Francisco Bay Area with a “Zodiac Killer” shape centred on Mount Diablo, and a note saying “The Map coupled with this code will tell you where the bomb is set. You have untill next Fall to dig it up“. A second “little list” letter (posted a month later) give a further clue: “PS. The Mt. Diablo code concerns Radians 4#inches along the radians“.\n\nSundberg and Thelin’s theory (described in this PDF file) is that it’s in fact a very scientific cipher, as much a stegotext as a cryptogram.\n\nFrom this, they extract the phrases “C3H3”, “Octane”, and “North of West”, while “HCEL(Zodiac)PW(triangle)” reminds them of how the molecule HClO3 looks, centred around the Zodiac symbol. From which they deduce that they need to look 1 inch (i.e. 6.4 miles) along a vector due West from magnetic North.\n\nGuys, guys… I’m really sorry, but I think you’ve got it wrong. Nobody in their right (or indeed wrong) mind would concoct a chain of reasoning based around a vague resemblance to a particular molecule in order to encode a unit vector. Even dear old Jessica Lee wouldn’t do that, much as she likes chemistry and ciphers.\n\nLook: the Zodiac Killer wasn’t some evil scientific genius, he was a sick, unhappy man with a grudge against the SFPD (probably a surrogate for his sick unhappy relationship with his abusive, distant father) on a gun-powered external power trip, a (literally) vain attempt to right the perceived wrongs in his personal life. I don’t even think he knew properly what a “radian” is, because he doesn’t use the term correctly in his note."
    }
]