[
    {
        "link": "https://electronics-tutorials.ws/filter/band-stop-filter.html",
        "document": ""
    },
    {
        "link": "http://hwmicrowave.com/196.html",
        "document": "The band stop filter is a type of frequency selective circuit, that works exactly opposite to the bandpass filter. The name itself shows that it stops or rejects the particular range of frequencies of a signal. This filter is designed with the low pass filter and high pass filter, which are connected in parallel to allow high and low-frequency components. The band stop filter allows frequency components below the cut-off frequency and above the cut-off frequency. The cut-off frequency of the low pass filter is denoted as fL and the cut-off frequency of the high pass filter is denoted as fH. As the band stop filter contains two cut-off frequencies for low and high-frequency ranges, it depends on the components used in the circuit. This article gives a complete description of the band stop filter.\n\nThe filter that allows above and below the particular range of frequencies and rejects all other frequencies of a given input signal, is known as band stop filter. It is also known as a band-reject filter or band elimination filter or notch filter. It allows all the frequencies below and above the cut-off frequency of low pass and high pass filter circuit. Since this circuit is designed using low pass and high pass filter circuits. This type of filter is mainly used to reduce the distortion in the signal.\n\nThe RC band stop filter circuit is shown below.\n\nWhen the input signal is applied, the high frequencies are passed through a high pass filter and low frequencies are passed through a low pass filter. The output voltage Vout drops at the high frequency of the high pass filter and at a low frequency of the low pass filter. These two filters are connected in parallel to allow all the high and low frequencies of a signal without any obstruction. The range of frequencies between the fL and fH is attenuated.\n\nIt allows the frequencies below the fL and above the fH. The frequencies between fL and fH are attenuated, which represents the stopband.\n\nThe transformation characteristic of the bandstop filter can be improved by using high pass filter and low pass filter circuits. An inverting voltage follower with Av = 1 isolates these low and high pass filter circuits. The output of these circuits can be added by using an op-amp that acts as a voltage summer or voltage adder.\n\nThe op-amps used to improve the voltage gain in the filter. The voltage follower in the two filter circuits can convert the voltage gain of the basic inverting op-amp of Av =1+(Rf/Rin). This can be designed using inverting op-amps to improve the voltage gain and to achieve amplification of the signal is shown below.\n\nThe band stop filter theory can be understood by using the block diagram shown below.\n\nFrom the block diagram, we can observe that a band stop filter is a combination of a high pass filter and a low pass filter connected in parallel instead of series. The applied input signal is applied to the filter, the low pass filter allows only the low frequencies whereas the high pass filter allows the high frequencies of the signal. So, the bandstop filter will have two cut-off frequencies named as lower cut-off frequency and upper cut-off frequency.\n\nThe low pass filter allows the frequencies below its cut-off frequency while the high pass filter allows the frequency above its cut-off frequency. These two cut-off frequencies are predetermined based on the component values used in the circuit. The bandstop filter doesn’t allow the frequencies between these two cut-off frequencies and are attenuated or rejected. It has a stopband and one passband. The final output from the high pass filter and low pass filter is amplified by using an operational amplifier (op-amp) to improve the voltage gain.\n\nThis is a second-order filter because of 2 cut-off frequencies (lower and higher) with a bandwidth of -3dB that points between upper and lower points. So, the bandwidth can be (fL – fH). The bandwidth can be calculated by taking the difference between lower cut-off frequency fL and upper cut -off frequency fH\n\nThe center frequency is the square root of the difference between the cut-off frequency of low pass filter and the cut-off frequency of high pass filter\n\nConsider the RC band stop filter to calculate the cut-off frequency.\n\nThe cut-off frequency of the low pass filter is given as\n\nThe cut-off frequency of the high pass filter is given as\n\nThe quality factor Q of the circuit can be calculated as\n\nThe band stop filter circuit using R, L, and C is discussed below.\n\nThis filter allows a particular range of frequencies, which are above and below the cut-off frequencies of high pass and low pass filter circuits. It blocks the frequency components between the low and high-frequency ranges. The circuit using R, L, and C is shown below.\n\nThe passive elements R, L, and C are connected in series. The input voltage is applied across the resistor and the output voltage is obtained across the inductor and the capacitor. This filter allows all the high and low-frequency components with respect to the cut-off frequency. At low-frequency range, the capacitor becomes an open circuit and the inductor becomes a short circuit. At the high-frequency range, the capacitor becomes a short circuit and the inductor becomes an open circuit.\n\nThis circuit behaves as an open circuit at high and low-frequency ranges due to the capacitor and inductor are connected in series. Hence, at the mid-frequency range, the filter behaves as a short circuit and is blocked by the filter. The components used in the circuit determines the lower and higher cut-off frequency. The transfer function of the circuit is,\n\nThe band stop filter with a narrow frequency response is known as a notch filter. It is designed to reject or block a particular band of frequencies and increases the selectivity of the filter. The quality factor ‘Q’ is very high when compared to the bandpass filter. It is widely used to reject the specific frequency bands in reducing electrical noise, graphical equalizers, synthesizers, communications, biomedical applications, and many more.\n\nThe basic notch filter is designed by using two RC sections in the form of T. This design is called twin-T notch filter or twin-T configuration or parallel T configuration. If the notch filter provides maximum attenuation at a specific frequency, then it is called notch frequency fn, is given as\n\nThe figure shows that the resistors and the capacitors in the upper T-sections form the low pass filter circuit. The lower T-section forms the high pass filter circuit with a resistor and a capacitor.\n\nThe frequency response of the band stop filter is shown in the below figure. The frequency response is drawn between frequency vs gain.\n\nIn practice, the switching mechanism of the capacitor changes the output characteristics of high pass and low pass filters and are not similar to the ideal filter. The passband gain of this filter should be equal to the gain of the low pass and high pass filter.\n\nIn an ideal band stop filter, the pass band gain should be Amax and the stop band gain should be zero. But it is not possible in practice due to the transition region between the high and low pass filter sections. The pass band ripples and the stop band ripples can be measured by using,\n\nFor example, if the lower cut-off frequency (low pass filter) is 500Hz and the upper cut-off frequency (high pass filter) is 1000Hz, then the band stop filter works by allowing the low frequencies below and up to 500Hz and high frequencies above 1000Hz. The frequencies between 500Hz and 1000Hz are attenuated. The band stop filter gives a wide frequency response when compared to the band pass filter.\n\nThe ideal characteristics of the band-stop filter, which are opposite characteristics of band pass filter are shown below.\n\nThis filter allows the frequencies of a signal in a particular range i.e., above and below the cut-off frequency. So, it has two passbands and one stopband. The stopband represents the attenuated frequencies, ranges between the two cut-off frequencies. While the two passbands the frequencies below and above the cut-off frequencies of low pass and high pass filter circuits.\n\nThe main characteristic of the band stop filter is, it allows all the frequencies from zero to up to cut-off frequency and allows all the frequencies above the cut-off frequency. This type of filter the frequencies between the upper and lower cut-off frequencies\n\nFind the resistance required for an RC band stop filter with a center frequency of 120Hz and, the capacitance of 0.33micro farads.\n\nWe can find the resistance of this filter by using the formula,\n\nHence, a resistor of 4kilo ohms is required to design the RC bandstop filter with 120Hz center frequency and 0.33 micro Farads capacitance.\n\nThe bandstop filter applications include the following.\n\nUsed in telephone technology to reduce noise and provide DSL internet services\n\nUsed in amplifiers of the electric guitars to reduce hum and amplify the signal\n\nUsed in electronics and communication systems to reduce distortion in the signal\n\nUsed in audio and radio applications\n\nUsed in optical communications to eliminate the distortion due to the interference of frequency signals.\n\nUsed in digital signal and image processing systems\n\nUsed in biomedical devices like ECG to reduce noise."
    },
    {
        "link": "https://electronicsforu.com/technology-trends/learn-electronics/band-stop-high-low-pass-filter",
        "document": "Electronic filters are circuits that are designed to pass certain frequencies or frequency ranges while rejecting others. They are used in a wide range of applications, including audio processing, image processing, and telecommunications.\n\nA Low pass filter (LPF) is used in circuits that only allow low frequencies to pass through. It is often used to block high frequencies and AC currents in a circuit. Given below is a sample LPF circuit using op-amp. Ideally, the frequency output of an LPF is like this, but this is not the case with real circuits. As there is a slight attenuation. This attenuation can be further minimized by adding multiple stages as below.\n\nLPF is popular with speakers to block high pitches, some electric guitars, and radio transmitters.\n\nA high pass filter is used in circuits that only require high frequencies to operate. It blocks most low frequencies & DC components. Given below is a sample high-pass filter circuit using op-amp.\n\nIdeally, the frequency output of a high-pass filter is like this,\n\nBut this is not the case with practical circuits. As there is a slight attenuation.\n\nThis attenuation can be further minimized by adding multiple stages as with LPF.\n\nA band pass filter is a combination of a high pass and an LPF. It allows only a selected range of frequencies to pass through. It is designed in such a way that the cut-off frequency of the LPF is higher than the cut-off frequency of the high-pass filter, hence allowing only a selected range of frequencies to pass through. Presented here is a sample band pass filter circuit using op-amp.\n\nIdeally, the frequency output of a bandpass filter is like this,\n\nBut this is not the case with practical circuits. As there is a slight attenuation.\n\nThe band-pass filter is popular with speakers to block high pitches, some electric guitars, and radio transmitters.\n\nA band stop filter also known as a notch filter is used in circuits that block only a selected range of frequencies and allows others to pass through. It would be an inverse of the band pass filter and can be created by using the same input at a high pass and an LPF.\n\nNote: All graphs are plotted in the frequency domain\n\nHere are some common questions about electronic filters:\n\nQ1. What is an electronic filter and how does it work?\n\nAn electronic filter is a device that removes or attenuates unwanted frequencies from an electrical signal. It does this by allowing a certain range of frequencies to pass through while blocking or attenuating others. Electronic filters can be either passive or active. Passive filters use passive components such as resistors, capacitors, and inductors to filter the signal, while active filters use active components such as transistors to amplify the signal as well as filter it.\n\nQ2. What are the different types of electronic filters?\n\nThere are several types of electronic filters, including low-pass filters, high-pass filters, band-pass filters, band-stop filters, and all-pass filters. Each type of filter allows a different range of frequencies to pass through and blocks or attenuates others.\n\nQ3. What are the applications of electronic filters?\n\nElectronic filters are used in a wide range of applications, including audio and video processing, telecommunications, and instrumentation. They are also used in power supply circuits to remove unwanted noise and in radio frequency (RF) circuits to select a particular frequency band.\n\nQ4. How do I choose the right electronic filter for my application?\n\nThere are several factors to consider when selecting an electronic filter for a specific application. These include the frequency range of the signal to be filtered, the amount of attenuation required, the type of filter response needed (e.g. low-pass, high-pass, etc.), the size and weight constraints of the system, and the power requirements of the filter.\n\nQ5. What are the advantages and disadvantages of electronic filters?\n\nThe main advantage of electronic filters is their ability to remove or attenuate unwanted frequencies from a signal, which can improve the quality and clarity of the signal. However, electronic filters can also introduce phase shifts and distortion to the signal, and they may not be effective at blocking very high or very low frequencies.\n\nThis article was first published on 17 November 2017 and was recently updated on November 2023"
    },
    {
        "link": "https://electronicshub.org/band-stop-filter",
        "document": "In the previous tutorial, we have seen about Band Pass Filter, a circuit which allows a certain band of frequencies of the signal to pass. In this tutorial, we will learn about Band Stop Filter, a filter with exact opposite functionality of a Band Pass Filter.\n\nA Band Pass or Band Reject Filter stops or attenuates a band of frequencies while the frequencies outside this range are passed. The attenuated frequencies range is known as Stop Band.\n\nIf you are looking for information on Low Pass or High Pass filters, read the tutorials on Passive High Pass RC Filters, Passive Low Pass RC Filters, Active High Pass Filter and Active Low Pass Filter.\n\nThe band stop filter is formed by the combination of low pass and high pass filters with a parallel connection instead of cascading connection. The name itself indicates that it will stop a particular band of frequencies. Since it eliminates frequencies, it is also called as band elimination filter or band reject filter or notch filter.\n\nFollowing image shows the block diagram of a Band Stop Filter.\n\nWe know that unlike high pass and low pass filters, band pass and band stop filters have two cut-off frequencies. It will pass above and below a particular range of frequencies whose cut off frequencies are predetermined depending upon the value of the components used in the circuit design.\n\nAny frequencies in between these two cut-off frequencies are attenuated. It has two pass bands and one stop band. The ideal characteristics of the Band pass filter are as shown below.\n\nWhere f indicates the cut off frequency of the low pass filter.\n\nf is the cut off frequency of the high pass filter.\n\nThe characteristics of a band stop filter are exactly opposite of the band pass filter characteristics.\n\nWhen the input signal is given, the low frequencies are passed through the low pass filter in the band stop circuit and the high frequencies are passed through the high pass filter in the circuit.\n\nIn practice, due to the capacitor switching mechanism in the high pass and low pass filter the output characteristics are not same as that of in the ideal filter. The pass band gain must be equal to low pass filter and high pass filter. The frequency response of band stop filter is shown below and green line indicates the practical response in the below figure.\n\nBand Stop Filter circuit using R, L and C\n\nA simple band stop filter circuit with passive components is shown below.\n\nThe output is taken across the inductor and capacitor which are connected in series. We know that for different frequencies in the input the circuit behaves either as an open or short circuit.\n\nAt low frequencies the capacitor acts as an open circuit and the inductor acts like a short circuit. At high frequencies the inductor acts like an open circuit and the capacitor acts like a short circuit.\n\nThus, by this we can say that at low and high frequencies the circuit acts like an open circuit because inductor and capacitor are connected in series. By this it is also clear that at mid frequencies the circuit acts like a short circuit. Thus the mid frequencies are not allowed to pass through the circuit.\n\nThe mid frequency range to which the filter acts as a short circuit depends on the values of lower and upper cut-off frequencies. This lower and upper cut-off frequency values depends on the component values.\n\nThese component values are determined by the transfer functions for the circuit according to the design. The transfer function is nothing but the ratio of the output to the input.\n\nThe above circuit shows the Twin ‘T’ network. This circuit gives us a notch filter. A notch filter is nothing but the narrow Band stop filter. The characteristic shape of the band stop response makes the filter as a notch filter.\n\nThis notch filter is applied to eliminate the single frequency. Since it consists of two ‘T’ shaped networks, it is referred as Twin T network. The maximum elimination is occurs at the centre frequency f = 1/(2πRC).\n\nIn order to eliminate the specific value of the frequency in case of a notch filter, the capacitor chosen in the circuit design must be less than or equal to the 1 µF. By using the centre frequency equation,we can calculate the value of the resistor.\n\nBy using this notch circuit,we can eliminate single frequency at 50 or 60 Hz.\n\nThe second order notch filter with active component op-amp in non-inverting configuration is given as follows.\n\nThe gain can be calculated as\n\nIf the value of the quality factor is high, then the width of the notch filter is narrow.\n\nBy taking the frequency and gain, the frequency response of the stop band is obtained as below.\n\nThe bandwidth is taken across the lower and higher cut-off frequencies. According to ideal filter the pass band must have the gain as Amax and a stop band must have zero gain. In practice, there will be some transition region. We can measure the pass band ripple and stop band ripples as follows\n\nThe typical stop bandwidth of the band stop filter is 1 to 2 decades. The highest frequency eliminated is 10 to 100 times the lowest frequencies eliminated.\n\nLet us consider the narrow band notch filter circuit. We know that the notch filter is used to eliminate single frequency. Thus let us consider the frequency to eliminate be 120 Hz. The capacitor value C= 0.33 µF.\n\nBy using the centre frequency f = 1/(2πRC)\n\nThus, in order design the notch filter to eliminate 120 Hz frequency we have to take two parallel resistors with 4 kΩ each and the two capacitors in parallel with 0.33 µF each.\n\nBand Stop filter has two pass bands and one stop band. The characteristics of this filter are exactly opposite to the Band Pass Filter. It is also called as a Band rejection filteror Band elimination filter. It uses a high pass filter and a low pass filter connected in parallel. The low frequencies are given to the low pass, whereas the high frequencies are given to the high pass filter.\n\nSimple RLC circuit by connecting capacitor and inductor in series forms the band stop filter. At very high and very low frequencies the band stop filter circuit acts like an open circuit, whereas at mid frequencies the circuit acts as a short circuit.\n\nHence, the circuit attenuates only mid frequencies and allows all other frequencies. The lower and higher cut-off frequencies of the filter depend on the filter design.\n\nThe Band Stop filter with narrow band stop features is called as a notch filter. It is used to eliminate single frequency value. It is formed by two resistors and two capacitors connected in two ‘T’ shaped networks.\n\nSo, it is referred as Twin ‘T’ filter. The bandwidth of the filter is nothing but the stop band of the filter. If the quality factor Q is high the narrow the width of the notch response. These are widely preferred in communication circuits.\n\nIn different technologies, these filters are used at different varieties.\n• None In telephone technology, these filters are used as the telephone line noise reducers and DSL internet services. It will help to remove the interference on the line which will reduce the DSL performance.\n• None These are widely used in the electric guitar amplifiers. Actually,this electric guitar produces a ‘hum’ at 60 Hz frequency. This filter is used to reduce that hum in order to amplify the signal produced by the guitar amplifier and makes the best equipment. These are also used in some of the acoustic applications like mandolin, base instrument amplifiers.\n• None In communication electronics the signal is distorted due to some noise (harmonics) which makes the original signal to interfere with other signals which lead to errors in the output. Thus, these filters are used to eliminate these unwanted harmonics.\n• None These are used to reduce the static on radio, which are commonly used in our daily life.\n• None These are also used in Optical communication technologies, at the end of the optical fiber there may be some interfering (spurious) frequencies of light which makes the distortions in the light beam. These distortions are eliminated by band stop filters. The best example is in Raman spectroscopy.\n• None In image and signal processing these filters are highly preferred to reject noise.\n• None These are used in high quality audio applications like PA systems (Public address systems).\n• None These are also used in medical field applications,i.e., in biomedical instruments like EGC for removing line noise."
    },
    {
        "link": "https://electronics.stackexchange.com/questions/330634/how-to-determine-the-rlc-values-for-a-bandstop-filter",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://electronics-tutorials.ws/filter/band-stop-filter.html",
        "document": ""
    },
    {
        "link": "https://allaboutcircuits.com/textbook/alternating-current/chpt-8/resonant-filters",
        "document": "So far, the filter designs we’ve concentrated on have employed either capacitors or inductors, but never both at the same time. We should know by now that combinations of L and C will tend to resonate, and this property can be exploited in designing band-pass and band-stop filter circuits.\n\nSeries LC circuits give minimum impedance at resonance, while parallel LC (“tank”) circuits give maximum impedance at their resonant frequency. Knowing this, we have two basic strategies for designing either band-pass or band-stop filters.\n\nFor band-pass filters, the two basic resonant strategies are this: series LC to pass a signal, or parallel LC to short a signal. The two schemes will be contrasted and simulated here:\n\nSeries LC components pass signal at resonance, and block signals of any other frequencies from getting to the load.\n\nA couple of points to note: see how there is virtually no signal attenuation within the “pass band” (the range of frequencies near the load voltage peak), unlike the band-pass filters made from capacitors or inductors alone.\n\nAlso, since this filter works on the principle of series LC resonance, the resonant frequency of which is unaffected by circuit resistance, the value of the load resistor will not skew the peak frequency. However, different values for the load resistor will change the “steepness” of the Bode plot (the “selectivity” of the filter).\n\nThe other basic style of resonant band-pass filters employs a tank circuit (parallel LC combination) to short out signals too high or too low in frequency from getting to the load:\n\nThe tank circuit will have a lot of impedance at resonance, allowing the signal to get to the load with minimal attenuation. Under or over resonant frequency, however, the tank circuit will have a low impedance, shorting out the signal and dropping most of it across series resistor R .\n\nJust like the low-pass and high-pass filter designs relying on a series resistance and a parallel “shorting” component to attenuate unwanted frequencies, this resonant circuit can never provide full input (source) voltage to the load.\n\nThat series resistance will always be dropping some amount of voltage so long as there is a load resistance connected to the output of the filter. It should be noted that this form of band-pass filter circuit is very popular in analog radio tuning circuitry, for selecting a particular radio frequency from the multitudes of frequencies available from the antenna.\n\nIn most analog radio tuner circuits, the rotating dial for station selection moves a variable capacitor in a tank circuit.\n\nVariable capacitor tunes radio receiver tank circuit to select one out of many broadcast stations.\n\nThe variable capacitor and air-core inductor shown in Figure above photograph of a simple radio comprise the main elements in the tank circuit filter used to discriminate one radio station’s signal from another.\n\nJust as we can use series and parallel LC resonant circuits to pass only those frequencies within a certain range, we can also use them to block frequencies within a certain range, creating a band-stop filter. Again, we have two major strategies to follow in doing this, to use either series or parallel resonance. First, we’ll look at the series variety:\n\nWhen the series LC combination reaches resonance, its very low impedance shorts out the signal, dropping it across resistor R and preventing its passage on to the load.\n\nNext, we will examine the parallel resonant band-stop filter:\n\nThe parallel LC components present a high impedance at resonant frequency, thereby blocking the signal from the load at that frequency. Conversely, it passes signals to the load at any other frequencies.\n\nOnce again, notice how the absence of a series resistor makes for minimum attenuation for all the desired (passed) signals. The amplitude at the notch frequency, on the other hand, is very low. In other words, this is a very “selective” filter.\n\nIn all these resonant filter designs, the selectivity depends greatly upon the “purity” of the inductance and capacitance used. If there is any stray resistance (especially likely in the inductor), this will diminish the filter’s ability to finely discriminate frequencies, as well as introduce antiresonant effects that will skew the peak/notch frequency.\n\nA word of caution to those designing low-pass and high-pass filters is in order at this point. After assessing the standard RC and LR low-pass and high-pass filter designs, it might occur to a student that a better, more effective design of low-pass or high-pass filter might be realized by combining capacitive and inductive elements together like the Figure below.\n\nThe inductors should block any high frequencies, while the capacitor should short out any high frequencies as well, both working together to allow only low frequency signals to reach the load.\n\nAt first, this seems to be a good strategy, and eliminates the need for a series resistance. However, the more insightful student will recognize that any combination of capacitors and inductors together in a circuit is likely to cause resonant effects to happen at a certain frequency.\n\nResonance, as we have seen before, can cause strange things to happen. Let’s plot a SPICE analysis and see what happens over a wide frequency range:\n\nWhat was supposed to be a low-pass filter turns out to be a band-pass filter with a peak somewhere around 526 Hz! The capacitance and inductance in this filter circuit are attaining resonance at that point, creating a large voltage drop around C , which is seen at the load, regardless of L ‘s attenuating influence.\n\nThe output voltage to the load at this point actually exceeds the input (source) voltage! A little more reflection reveals that if L and C are at resonance, they will impose a very heavy (very low impedance) load on the AC source, which might not be good either.\n\nWe’ll run the same analysis again, only this time plotting C ‘s voltage, vm(2) in the Figure below, and the source current, I(v1), along with load voltage, vm(3):\n\nCurrent increases at the unwanted resonance of the L-C low-pass filter.\n\nSure enough, we see the voltage across C and the source current spiking to a high point at the same frequency where the load voltage is maximum. If we were expecting this filter to provide a simple low-pass function, we might be disappointed by the results.\n\nThe problem is that an L-C filter has an input impedance and an output impedance which must be matched. The voltage source impedance must match the input impedance of the filter, and the filter output impedance must be matched by “r ” for a flat response.\n\nThe input and output impedance is given by the square root of (L/C).\n\nTaking the component values from, we can find the impedance of the filter, and the required , R and R to match it.\n\nIn the Figure below we have added R = 316 Ω to the generator, and changed the load R from 1000 Ω to 316 Ω. Note that if we needed to drive a 1000 Ω load, the L/C ratio could have been adjusted to match that resistance.\n\nThe Figure below shows the “flat” response of the L-C low pass filter when the source and load impedance match the filter input and output impedances.\n\nThe response of impedance matched L-C low-pass filter is nearly flat up to the cut-off frequency.\n\nThe point to make in comparing the response of the unmatched filter to the matched filter is that variable load on the filter produces a considerable change in voltage. This property is directly applicable to L-C filtered power supplies– the regulation is poor. The power supply voltage changes with a change in load. This is undesirable.\n\nThis poor load regulation can be mitigated by a swinging choke. This is a choke, inductor, designed to saturate when a large DC current passes through it.\n\nBy saturate, we mean that the DC current creates a “too” high level of flux in the magnetic core, so that the AC component of current cannot vary the flux. Since induction is proportional to dΦ/dt, the inductance is decreased by the heavy DC current.\n\nThe decrease in inductance decreases reactance X . Decreasing reactance, reduces the voltage drop across the inductor; thus, increasing the voltage at the filter output. This improves the voltage regulation with respect to variable loads.\n\nDespite the unintended resonance, low-pass filters made up of capacitors and inductors are frequently used as final stages in AC/DC power supplies to filter the unwanted AC “ripple” voltage out of the DC converted from AC.\n\nWhy is this, if this particular filter design possesses a potentially troublesome resonant point?\n\nThe answer lies in the selection of filter component sizes and the frequencies encountered from an AC/DC converter (rectifier). What we’re trying to do in an AC/DC power supply filter is separate DC voltage from a small amount of relatively high-frequency AC voltage.\n\nThe filter inductors and capacitors are generally quite large (several Henrys for the inductors and thousands of µF for the capacitors is typical), making the filter’s resonant frequency very, very low. DC of course, has a “frequency” of zero, so there’s no way it can make an LC circuit resonate.\n\nThe ripple voltage, on the other hand, is a non-sinusoidal AC voltage consisting of a fundamental frequency at least twice the frequency of the converted AC voltage, with harmonics many times that in addition.\n\nFor plug-in-the-wall power supplies running on 60 Hz AC power (60 Hz United States; 50 Hz in Europe), the lowest frequency the filter will ever see is 120 Hz (100 Hz in Europe), which is well above its resonant point. Therefore, the potentially troublesome resonant point in a such a filter is completely avoided.\n\nThe following SPICE analysis calculates the voltage output (AC and DC) for such a filter, with series DC and AC (120 Hz) voltage sources providing a rough approximation of the mixed-frequency output of an AC/DC converter.\n\nWith a full 12 volts DC at the load and only 34.12 µV of AC left from the 1 volt AC source imposed across the load, this circuit design proves itself to be a very effective power supply filter.\n\nThe lesson learned here about resonant effects also applies to the design of high-pass filters using both capacitors and inductors. So long as the desired and undesired frequencies are well to either side of the resonant point, the filter will work OK.\n\nBut if any signal of significant magnitude close to the resonant frequency is applied to the input of the filter, strange things will happen!\n• Resonant combinations of capacitance and inductance can be employed to create very effective band-pass and band-stop filters without the need for added resistance in a circuit that would diminish the passage of desired frequencies."
    },
    {
        "link": "https://www2.seas.gwu.edu/~ece121/Spring-11/filterdesign.pdf",
        "document": ""
    },
    {
        "link": "https://ti.com/lit/pdf/slyt613",
        "document": ""
    },
    {
        "link": "https://electronics-tutorials.ws/filter/filter_4.html",
        "document": ""
    }
]