[
    {
        "link": "https://developers.google.com/workspace/forms/api/reference/rest",
        "document": "To call this service, we recommend that you use the Google-provided client libraries. If your application needs to use your own libraries to call this service, use the following information when you make the API requests.\n\nA Discovery Document is a machine-readable specification for describing and consuming REST APIs. It is used to build client libraries, IDE plugins, and other tools that interact with Google APIs. One service may provide multiple discovery documents. This service provides the following discovery document:\n\nA service endpoint is a base URL that specifies the network address of an API service. One service might have multiple service endpoints. This service has the following service endpoint and all URIs below are relative to this service endpoint:"
    },
    {
        "link": "https://developers.google.com/workspace/forms/api/guides",
        "document": "Stay organized with collections Save and categorize content based on your preferences.\n\nThe Google Forms API is a RESTful interface that lets you create and modify forms and quizzes, retrieve form responses and quiz grades, set up quiz answer keys with automatic feedback, and receive push notifications. The most common uses of this API include the following tasks:\n\nBelow is a list of common terms used in the Forms API:\n\nA Google Forms document, created and stored in Drive. Each form is represented by a resource and has a unique value, containing letters, numbers, hyphens, or underscores. You can find the form ID in a Google Forms URL: A specific type of Google Forms document that allows for grading of the form responses against an answer key. A quiz can only be created by using the method to update the setting on an existing form to . A point value, answer key, and feedback for a question, applied when is . Represented by the resource. A response given to the end user when responding to a question on a quiz, represented by the resource. A single element in a form, represented by the Item resource. is a repeating element which can contain a section, question group, question, text, image, or video. A single question on the form, represented by the resource. A group of questions that all share the same set of possible answers (for example, a grid of ratings from 1 to 5). Represented by the resource. A section is a way to break up a form into multiple pages and add conditional logic (such as only showing certain questions based on how the user answers). Sections correspond to the resource. The end user's answer to a question, represented by the resource. Includes both grade information (if present), metadata, and the content of the answer. The end user's submission of a form, represented by the resource. A trigger that tracks changes to either form schema changes (such as edits to questions) or form response submissions and sends a push notification when a change occurs. Represented by the resource.\n\nWhen managing forms and quizzes, understanding how to specify different fields can be complicated, given that many of the form objects can be nested inside each other in multiple ways. To see how the visual representation of a form maps to the fields, we recommend using the UI to create a few examples of forms your application might generate. Then retrieve the corresponding JSON using the method so you can compare. For example, this example quiz corresponds to the following JSON:\n• To learn about developing with Google Workspace APIs, including handling authentication and authorization, refer to Get started as a Workspace developer.\n• To learn how to configure and run a simple Forms API app, read the Quickstarts overview."
    },
    {
        "link": "https://developers.googleblog.com/en/introducing-the-google-forms-api",
        "document": "Building on the power of Google Forms\n\nFor the first time, Google Forms has an API and we are going to show you how you can use it and what’s in it. The new Google Forms API joins the large family of APIs available to developers under the Google Workspace Platform. The Forms API provides programmatic access for managing forms, acting on responses, and empowering developers to build powerful integrations on top of Forms.\n\nThe API supports two key use cases\n\nAutomated form creation and editing: Enables automated form creation and editing. Enables rapid form generation from large volume question banks or other data backends.\n\nReaction to Form responses: The API also enables developers to build automations for acting on incoming responses. Examples include developing real-time dashboards or visualizations and triggering business workflows based on response data.\n\nThe Forms API has a rich set of methods to perform all forms operations.\n\nForms API Watches allow applications to subscribe to Cloud Pub/Sub notifications when forms change events occur.\n\nWe had a great community response to our call for early access and beta developers and are proud to share some of their innovative integration examples with you.\n\nThousands of SMBs rely on Zapier’s current Google Forms integration today, which enables their users to connect Google Forms to 4000+ other applications. Zapier users automate tens of thousands of tasks daily using Google Forms, for example in coordinating internal business processes, handling external customer requests, even helping educators manage classroom activities, all which will be made much more reliable with the updated integration on the new Forms API.\n\nTry it out here!\n\nPortant’s new Google Forms API integration enables users to connect Google Forms to Google Docs & Slides to create custom document workflows. Some of the features enabled by Portant’s Forms API integration include:\n\nTry it out here!\n\nAutomagical Forms is a Google Workspace Add-on with integrations in Drive, Docs, Slides, and Gmail. It finds questions in the files and makes it easy to create a Google Form. With the help of the Forms API it can also export Forms to other integrations. Implementing the Forms API has increased their development speed by over 3x, which is helpful for Google Workspace Add-ons that can only run for 30 seconds. Their current integration generates Short Answer and Multiple Choice forms with export to other file formats for 3rd party integrations. Their next implementations will include embedded images, and push notifications (Pub/Sub) for acting on Forms responses.\n\nTry it out here!\n\nForm Builder Plus helps to build your Google Form from existing content of Google Sheets, Docs, Slides, Drive, Gmail, and Calendar automatically. This saves time and effort of people who regularly create new forms. It uses the Forms API to add questions in bulk within a few seconds. Educators like teachers, trainers, coaches, quiz masters use it for creating Google Forms quickly to conduct assessment, quizzes, exams etc. Businesses that use Google Forms for skill assessments or recruiting use it to rotate questions from question bank spreadsheets and other existing documents.\n\nTry out the add-on here or see a short video demo!\n\nIf you’d like a quick recap of the Forms API, please watch the overview video. We’ve also created a list of resources to help you quickly get started and get community support.\n\nWe’re very excited about this announcement and can’t wait to see what you build for Google Workspace! For more announcements about the Google Workspace Platform and APIs, please subscribe to our developer newsletter."
    },
    {
        "link": "https://stackoverflow.com/questions/71714110/can-you-submit-a-restful-request-to-a-google-forms-api",
        "document": "\"Is there a way to send in responses from my custom application to my google forms api?\"\n\nAssuming that you mean user supplied questionnaire responses, then the short answer to your question is No!\n\nCurrently, Google Forms does not accept questionnaire responses via the google forms api. The google forms api is intended only for managing your google forms documents and not for accepting user responses.\n\nHowever, considering that the user responses submitted from a google form are ultimately saved into a google sheet, you may be able to send in user questionnaire responses from your custom application using the google sheets api.\n\nKeep in mind though that it can get tricky trying to make updates programmatically to data in google sheets. If your use case will not include making updates then you should be fine otherwise you're probably better off just using your favourite db storage system."
    },
    {
        "link": "https://workspace.google.com/products/forms",
        "document": ""
    },
    {
        "link": "https://getformpay.com/blog/create-order-forms-with-google-forms",
        "document": "Google Forms is typically used as a free survey tool, but it’s also a great way to accept orders for online sales and registrations. Designing a good order form is a bit of an art, because you want it to be intuitive to use and not overwhelming for users. In this blog post, we will cover how to use Google Forms for orders, so that you can take orders for your online store or registrations for an event you’re hosting.\n\nFirst, sign into your Google account to access Google Forms. Create a new order form with the following information:\n• Form name: Choose something that’s easy for you to remember and descriptive for your customers.\n• Description: Add a short description about your business, and the purpose of the form. Include any contact information and other important order information like pickup and delivery schedules if you’re a food delivery service.\n• Branding: In the “Settings” section, there are many different pre-made themes you can choose from or you can customize the branding with your own unique colors and graphics.\n\nIn order to accurately process orders, you of course need to gather information about your customers! Here are some customer information fields you might want to add to your form:\n\nTo make sure that clients provide the required data accurately, you should add response validation rules. For example, you can set fields like name and email address to be required, and contact number fields to only accept numbers. By adding validation, you'll be able to avoid getting orders that aren't complete, which can cause confusion, additional administration, and order delays.\n\nAdd a new section for order details to your Google Form. This will be the meat of your order form. You can use Google Forms’ many question options like dropdown, checkboxes, and multiple choice questions to create the order form that makes the most sense for your business.\n\nFor example, if you’re offering shirts with different size and color combinations, you might want to offer a dropdown or multiple choice question.\n\nIf you’re selling products with different quantities, you can also create a “Quantity” input field with a number validation rule for each product.\n\nIf you’re offering pickup and delivery options, you can use the “Date” and “Time” fields to let customers specify their desired fulfillment times.\n\nGoogle Forms doesn’t automatically provide total cost calculation. However, you can provide an input field at the end of the form that asks your customers to calculate the total cost of their order before they submit the form. Unfortunately, you will still have to double check that your customer calculated the total costs properly.\n\nIf you would like to automate total cost calculation, consider using a solution like FormPay, which combines the ease of Google Forms with the power of ecommerce. It includes automatic cost calculation, integrated payments, automatic order confirmation, and an online order management system.\n\nIn order to collect payment from clients after they have completed the form, you must add payment options to your Google Forms. Although Google Forms does not directly support payment processing, you can still accept payments in a variety of other ways including:\n\nThese payment options each have their downsides since they’re not integrated into Google Forms. For a more streamlined and integrated solution, FormPay is a better option.\n\nIt's essential to thoroughly test your order form to make sure it functions as intended. With testing, you can find any potential problems or areas of confusion by testing your order form before your customers notice them.\n\nYou can also enlist the assistance of a friend or relative to test the form. They might view things differently and be able to spot things you might have overlooked.\n\nExamine your order form carefully as you test it to look for any potential areas of confusion or usability issues. This might involve problems with the navigation, ambiguous instructions, or challenging fields. Make the necessary changes to the form if there are any areas that could use improvement. In addition, you should test the payment process and notifications setup to ensure that it works as expected.\n\nOnce you’re confident with your order form, it’s time to share it with your customers! Press the “Send” button to generate a link that you can add to your social media profiles or message to your customers on Whatsapp. If you have a website, you can use the “embed” option to embed the form directly into your website.\n\nUse FormPay’s order form as an alternative\n\nAlthough Google Forms can be used to quickly set up order forms, it has a ton of limitations since it wasn’t built for online sales and businesses. Instead of trying to hack together a subpar customer experience on Google Forms, try FormPay as a better alternative. FormPay’s tailored ecommerce solution is a big step up with all the familiarity of Google Forms, but features that are designed for ecommerce businesses."
    },
    {
        "link": "https://agpartsworldwide.com/how-to-collect-data-with-google-forms-4-steps",
        "document": "How to Collect Data With Google Forms: 4 Steps\n\nA Google Form gives you a great way to gather responses from people. From a one-question form to a long multi-section quiz, a Google Form eliminates the need to decipher and tally responses on sheets of paper. A form also serves as an elegant alternative to asking a group of people questions in email.\n\nGoogle Forms can compile all the standard survey fields—such as text, multiple choice questions, drop downs, linear scales, and grids—to serve all sorts of data collection needs. They can be used to collect contact information on a website, gather inventory data, collect votes, obtain feedback, evaluate a product or service, test knowledge with a quiz, or replace a basic customer intake form. Here are four steps to help you get started with Google Forms:\n\nFirst, create questions to use on your form. For a short form, such as a web contact form that gathers an email address, name, and message, you can likely draft your questions directly in a Google Form. But for longer surveys or quizzes, I prefer to draft my questions in a Google Doc first. I find this helps me focus on the wording of each question.\n\nNext, go to https://forms.google.com in a desktop browser and select the button the lower right to create a new form. Add a title and description for your form, then enter your questions. Add new questions with the + to the right of your form. And add text, images, videos, or section breaks, as you wish. Change the question type by choosing an alternative from the dropdown list in the upper right of each question area.\n\nWhen you’re ready to accept responses, select the “Send” button in the upper right. Then choose from one of six ways to share your form: Email, a link, an embed code (for display on a web page), Google+, Facebook, or Twitter.\n\nYou can review responses at least three different ways. On the “Responses” tab in the form, you can view either a summary of responses or see each individual response. Or, select the Google Sheet icon to view data in rows and columns—with timestamps—in spreadsheet format.\n\nSource: How To Collect Data with Google Forms: 4 Steps by Andy Wolber, published in Tech Republic\n\nAGParts Worldwide is an industry leader in providing parts for Chromebook and laptop devices across all industries. We house a 350,000+ OEM new & reclaimed parts inventory and are an authorized reseller for most major Chromebook brands. Contact us to see how we can help your organization simplify your parts procurement process."
    },
    {
        "link": "https://workspace.google.com/marketplace/app/neartail_order_form/743172720058",
        "document": ""
    },
    {
        "link": "https://support.google.com/docs/thread/287106214/struggling-to-use-google-forms-with-google-sheets-in-order-to-track-company-inventory?hl=en",
        "document": ""
    },
    {
        "link": "https://reddit.com/r/gsuite/comments/16znwpn/how_do_i_make_an_online_order_form_with_google",
        "document": "Help! I’m leading a fundraiser for my kid’s school, where kids sell items (let’s say magazines), they collect the money, give the money to me, I place the order for the magazines that were purchased.\n\nMy problem is: I need a way to be able to list multiple items, and have people choose the quantity. Some kids sell one or two, some sell 80, so the traditional form that allows one to chose 1-5 isn’t enough options. I would also like to be able to have the form multiply the price by the quantity of item needed, so that the kids (parents) will be able to check ahead of time that they have the correct amount of money to turn in. Last year I did this manually, but this year multiple parents complained that a Google form would be so much easier. None of them have volunteered to help me with this though 😐\n\nDoes this make sense? Can someone help me figure this out?"
    }
]