[
    {
        "link": "https://tl.net/blogs/530018-game-design-in-dota-2-icefrogs-battle-with-posit",
        "document": "Show nested quote +\n\n On January 12 2018 03:47 Comeh wrote:\n\n \n\nI trained many years for this level of work.\n\n\n\nTruthfully I thought about using a better program and spending time, but that sounds like something I wouldn't do. I trained many years for this level of work.Truthfully I thought about using a better program and spending time, but that sounds like something I wouldn't do.\n\nshould have done it in excelgood read, it’s nice to see some people thinking about the more “game-designy” aspects of Dota since that’s so often overlooked in favor of discussions of the specific meta ay hand"
    },
    {
        "link": "https://reddit.com/r/DotA2/comments/jxqen9/dota_2_game_design_analysis",
        "document": "Archived post. New comments cannot be posted and votes cannot be cast."
    },
    {
        "link": "https://reddit.com/r/DotA2/comments/47cfyw/a_massive_guide_to_understanding_your_dota_2",
        "document": "A huge thanks to wFXx for fixing the formatting of this post!\n\nThere is a certain thrill that you get when you first pick up a game like Dota. So much to learn and so much opportunity to improve. The game is exciting when it’s new, and every game you play it seems like you’re learning so much. Eventually that fades though.\n\nEventually, we are in a position where progress becomes slow. We want to get better, we want to keep improving, but grinding out games with little or no improvement becomes draining.\n\nThis post is part 1 of 3 of a series I will be posting on Reddit.\n\nWhat will be covered in this series?\n• Why We Stop Improving in Dota\n• What You Should Know Before Trying To Change Your Play\n• A Bit Of Science Behind Improving Your Gaming Habits (Good to know the why!)\n• Step By Step Guide To Creating New Habits (with examples)\n• How To Stick To Your New Dota 2 Playstyle Overtime\n• The Impact Self-Image Plays In Our Gaming Development\n• How To Change Your Self-Perception\n• The Two Types of Habits\n• Common Problems When Sticking To New Habits\n• How To Get Back On Track\n• Why Bad Habits Must Be Replaced\n• How To Continue To Progress\n\nEach part will be posted on Reddit, and I will send out an update on my Twitter\n\nA Quick Note On Who I Am:\n\nMy name is Mike, I’ve been a competitive gamer my whole life. I play/played Dota, HoN, LoL, Dota 2, WoW, Starcraft, Starcraft II, Halo 2-5, Counter Strike, CoD, Rift, HearthStone, and any other game that has some competitive aspect to it.\n\nI’ve coached hundreds of players in competitive games develop a mindset to improve their gaming performance. I am the owner of Gamer's Training Ground, where I write weekly posts about developing your own gaming style to improve faster, enjoy gaming more, and stay motivated while playing. After being a competitive gamer for so long, my passion is no longer playing the games (though I still do a lot), but to teach those who are willing to learn how they can reach their gaming potential.\n\nI hope you all enjoy this post! Some of the parts of this post will get a little “sciency”, feel free to skip those parts.\n\nWhy Does Our Play Level Out?\n\nEvery time you enter a game, for the next 30-60 minutes you play, you will be ingraining your actions into your mind. These actions crystalize in your mind. Not in the part that actively thinks, but the subconscious part that makes us do things that we don’t realize. This process eventually turns into what we call our playstyle.\n\nWe can change our playstyle, but it takes action and time - in other words, effort. Do you ever notice yourself making the same mistakes, dying the same way, and reacting poorly in the same situations? This is because we have trained ourselves play a certain way and formed gaming habits.\n\nWith the gamers I have worked with, I see two common problems when trying to improve their play.\n• They notice they make a mistake or have an area they can improve (poor awareness, poor last hitting, poor stacking/warding), but that is all they do - just notice it. Being aware of where you need to improve is helpful, but nothing will change without the right knowledge and act on.\n• They read hero guides for a quick fix. Don’t flame on this just yet, hear me out first! I’m all for guides. I think they are informative, they help specialize in a hero, and give you deeper insight on certain heroes. The area where this is an issue is when a player reads a guide, copies the build, and sees improvement in their game and thinks that they got better.\n\nThe guides are almost like band aids. The item build or skill build may help you improve while the information is still relevant, but if the meta changes, the guide may become obsolete and you may find yourself back to square one.\n\nThe real goal should be to seek improvement in your fundamentals of the game first, not copying builds, but seeking understanding.\n\nAgain, I like guides. The main point I am trying to make here is this:\n\nDon’t confuse an increase in MMR from following a guide with a true increase in skill. Just because you learned one recipe, doesn't mean you turned into a chef!\n\nA Warning When Changing Your Habits and Play\n\nIf you choose to implement the information I am about to share into your game, I have one warning for you.\n\nDon’t try to do too much too soon.\n\nThis is one of the biggest reasons for failing when trying to change your playstyle and gaming habits. You may have tons of motivation when you start and want to spend long hours each day working on your play. The initial motivation will die. Make little changes and commitments that you can continue even if you don’t feel like it.\n\nMore on this later, but an example many can relate to:\n\nThe last hitting drill of loading up a game and last hitting for 10 minutes to practice CSing is great. Some people are ambitious and do this for an hour a day when they start. By day 5, it’s not fun anymore and they just stop completely.\n\nI always recommend setting a goal so easy you can’t fail. The idea is to build up the habit, not get the results right away.\n\n“Last hit for 2 minutes a day.” - If you don’t have 2 minutes in your day, you might be booking yourself too tight! Remember the focus is on building the habit at the beginning, not the results.\n\nThe best analogy I can give to understanding this principle:\n\nThe law of nature. A farmer cannot rush the production of crops. He cannot simply take shortcuts to produce results. Sure there are chemicals and growth hormones that can alter the production rate, but these also alter the final product - no longer in it’s purest form.\n\nSo, by law of nature, you cannot rush the growth of these new “playstyle seeds” you plant in your head. You just need to care for them consistently and let them grow. There are no shortcuts.\n\nThe ideas and philosophies behind understanding habits come from multiple sources. The biggest resource (highly recommended if you are into reading books) is from Charles Duhigg's Book, The Power of Habit.\n\nMany college professors and authors have researched this topic and reinforce the ideas of the three step process that Duhigg talks about. It is the most accepted concept and process for effectively building new habits.\n\nThe process to improving your play through habits follows a three step series. Here is the process with an example of a player who looks at their minimap every time they get a last hit.\n• Step One: The Trigger -> You get a last hit.\n• Step Two: The Action -> You look at the minimap.\n• Step Three: The Reward -> You see all the enemies on the minimap and know you are safe. You tell yourself, “Good Job!”.\n\nWhen the reward is beneficial, you know you can continue this habit. Let’s take a quick look at when there is something off with the process.\n• Step One: The Trigger -> You get stunned.\n• Step Two: The Action -> You instantly pop BKB and turn on the enemy.\n• Step Three: The Reward -> You get the kill with the help of two other teammates. You also see that there are 4 enemies across the map. You were never in danger but prematurely used the BKB and it is now on CD. You cut down a bit on your potential advantage.\n\nWhile it still worked out for our player in this case, he gave away part of the team's advantage by using his BKB when it wasn’t needed. This is actually a common issue that I see with a lot of players. The item is not always a BKB, but sometimes it’s using ulti’s when unneeded.\n\nYou can analyze every part of your play like this, and I will provide some examples at the end.\n\n-> Building The Habit (Read This If You’ve Been Skipping Around!) <-\n\nIn order to change your play, it is important to understand what triggers your actions. You will fail if you simply try to change a habit through only willpower (think of how hard some diet changes can be).\n\nSaying to yourself, “Look at the minimap more,” and trying harder at that will not produce beneficial results. In fact, it will most likely frustrate you more when you keep forgetting.\n\nThe better approach is to attach the action you want to take to a habit you already have. If you attach “looking at the minimap” after “getting a last hit” you will have a higher success rate.\n\nPro tip: Have some sort of visual or audio aid to make it easier to remind yourself. A sticky note on your computer (I also do this for other games on xbox) or an interval timer can help.\n\nAs mentioned before, you are doomed to fail if you try to implement a new habit with no system. Ever make a diet change and have it only last for a couple days?\n\nYour trigger should be a habit that you already have. It can be something as simple as clicking the “enter game” button at the start of each game.\n\nTo help you choose a trigger to attach your action to, follow these steps:\n• Write out a list of all the actions that you make during a game. (eg. Clicking enter game, opening the shop, right clicking to your lane, buying a ward, using an ability, etc…)\n• Write out a list of all the things that happen to you in a typical game. (eg. Hearing a ping on the map, hearing Roshan is dead, the game changing from day to night, etc…)\n\nPick one of these actions to become the trigger for the habit you want to build. What does that look like?\n\n“Every time I click the ‘enter game’ button, I will look at the heroes on the enemy team and try to determine what the lane matchups will be.”\n\nThis can help you determine what items to get. If you see that you may be up against a Bat Rider, it may be a good idea to grab a magic stick! Seems simple, but that is the point. If you already have a habit of being aware of team comp (surprisingly a lot of people don’t pay any attention to this) then you can build habits around other areas.\n\nMake small changes. Trying to change too much too soon will lead to failure. Doing this is going to cause you too much stress by drastically changing your game and trying to keep up with your changes consistently.\n\n(Think about dieting again. If a diet is too drastic of a change, it is almost impossible to consistently keep up with it).\n\nAgain keep in mind, don’t base the effectiveness of the habit on the results when you first begin. Base the effectiveness on how consistently you can perform it.\n\nPart of the reason why changing our habits is difficult is because we live in a world where everything is instant. Gamers want to do things that are going to give them results instantly, not what will be a bigger payout down the road.\n\nBeing able to delay your gratification for bigger rewards is a key point in successfully changing your habits. I don’t want to get into too much detail in this article on delayed gratification in gaming, but you can read more about it here.\n\nC) Examples Of Small Actions For Big Victories\n\nLike mentioned before using last hitting as an example:\n\nYou’d be better off building a habit of last hitting for 2 minutes a day. That’s it, just 2 minutes. The point is to condition your mind to this type of activity and then slowly build off of it. At the start, you may have tons of motivation and want to do more than 2 minutes. Don’t fall into this trap. Stick to just 2 minutes, even if you want to do more.\n\nPick a time each week to watch a replay. You don’t even need to analyze it. Just watch it from your perspective, you can even play it back on a faster speed. Again, we are building the habit. We can focus on the results after we have conditioned our mind.\n\n“Do the last hitting drill for 2 minutes, but look at your minimap after each last hit”\n\nAgain, simple. Do the last hitting drill, but the habit we will be building is to improve map awareness. No need to worry about it in real games yet, but make sure you do this each day to condition your mind.\n\nDon’t try and implement these all at once either. I like to just pick 1-2 things to work on for the same reasons as mentioned before - the motivation will die down a bit and you want to have a system that is so simple you can’t fail.\n\nWe like to do things that make us happy (pretty groundbreaking info I know). It sounds silly, but the smallest of rewards will go a long way.\n\nResearch on rewards has shown that something as simple as telling yourself something positive after sticking to your plan will go along way. Some examples are:\n\nThis little bit of positive reinforcement makes a big difference. There is essentially no effort or time required to say these little phrases in your head after completing your action, so don’t count them out!\n\nSome Dota 2 Habits You Can Build\n\nCongrats to all of you who read the whole post and still have your eyes in their sockets. I know that was a big wall of text but hopefully it packed your brain with some ideas to improve your gameplay.\n\nHere are a few habits you can implement to your game or improve on:\n• Map awareness - can be broken down further (eg. Looking at your map when someone calls miss, checking the map when you get stunned, warding habits, etc…)\n• Last hitting (this is also a topic I will cover in my skill development post)\n• Hero specific habits (if you want to work on a specific hero)\n\nThe list can go on and on about any area you want to improve. These are just some ideas to get you started. You can always improve old habits, you can always create new ones. Take some time to consider what changes in your game will make the biggest impact.\n\nIf you are interested in reading more of my content you can find me on Gamer's Training Ground. That is also the best place to contact me, but you can also leave comments here, and I will do my best to respond.\n\nPlease let me know in the comments if you have any feedback, questions, or comments of the material I covered. I write these posts to help gamers who want to get better and would love feedback on what I can do to improve the content I produce for you all.\n\nAlso I created a very brief infographic with the steps to creating a new habit here\n\nFor an update when part two is released, follow me on Twitter!\n\nShare it with any of your friends who could use the help! Good luck everyone! I'd be happy to answer any questions regarding the content!"
    },
    {
        "link": "https://dota2.fandom.com/wiki/Mechanics",
        "document": "are the inner workings of Dota 2. The following is a list of mechanics topics. Click on each topic to view how they are calculated, where they originate, as well as their complex interactions with other mechanics elements.\n\nThese properties are used by units in general, including heroes, creeps, and summons. Heroes possess a number of unique mechanics that other units don't.\n\nAdditional effects can be added to basic attacks. Some of these effects stack with each other in several ways, while others do not stack at all.\n\nStatus effects are a variety of conditions that can afflict units. They are caused by abilities and items.\n\nDispel refers to methods that remove buffs, debuffs, and status effects. This is an important topic to understanding the internal interactions of Dota 2.\n\nThis is a list of major functions that are not directly part of the game. It involves various features regarding player input, Steam, and others.\n\nGame settings allow users to change display, graphics, audio, and control settings.\n\nMatchmaking is the automated system that finds and matches players together, usually based on internal calculations of player skill. Casual and ranked matchmaking are both available.\n\nCosmetic items can be used to alter the appearance of heroes and various elements of the interface. They are purely cosmetic and do not affect game mechanics."
    },
    {
        "link": "https://quora.com/What-are-the-mechanics-behind-a-MOBA-game-I-e-LOL-Dota-2-Strife-HON",
        "document": "Something went wrong. Wait a moment and try again."
    },
    {
        "link": "https://reddit.com/r/gamedesign/comments/1ft6qlp/how_to_go_about_designing_the_ui_for_your_game",
        "document": "I’m building a game, and I want to start building out some basic UI for now.\n\nMy trouble is how does it work? How do I make a layout that just works for the game?\n\nI can program all the functionality myself, I just have no clue where to start from a UI-design perspective in games."
    },
    {
        "link": "https://unity.com/blog/games/ultimate-guide-to-creating-ui-interfaces",
        "document": ""
    },
    {
        "link": "https://forums.unrealengine.com/t/ui-design-best-practices/640538",
        "document": "I’m a UX/UI designer working for a Games Studio. We use the Unreal Engine for the game client and I am wondering if anyone has any tips for best practices when designing for Unreal?\n\nSpecifically, we are using Figma to construct layouts and prototypes, and currently designing screens at 1920x1080 but we’ve also heard that it’s better to start at 2560x1440?\n\nMy personal preference is to design at 1920x1080 and then just upscale 200% to 4k, this means that the multiples of 4 and 8 spacing remains consistent, where as upscaling to 2560x1440 breaks all the spacing."
    },
    {
        "link": "https://quora.com/What-should-I-study-to-develop-games-on-unity-or-Unreal-engine",
        "document": "Something went wrong. Wait a moment and try again."
    },
    {
        "link": "https://reddit.com/r/gamedev/comments/1dbg5vl/is_unity_better_than_unreal_for_game_development",
        "document": "Sorry for this rant today. Im maybe feeling a bit down today.\n\nConsidering changing engine from unreal to unity...\n\nOr maybe its the grass is always greener thing....\n\nIt took me a lot of work and effort to learn unreal in the last years.\n\nDid many tutorials, learned both blueprints and C++. How to work with the material editor. Niagara. Behavior trees. etc...etc... And lots of other idiosyncrasies of unreal engine.\n\nI say idiosyncrasies, because each one of these things are like learning a small little program inside a program...\n\nAnd for example, blueprints. Which i think its amazing for people who are allergic to code... maybe its good especially to get introduced to the engine...\n\nBut its worthless experience/practice outside of unreal...\n\nI have this feeling maybe im wrong, that had i worked with unity or godot till now i'd have produce 4 times more what i produced...\n\nIt seems the biggest complains about unity vs unreal. Is that unreal handles graphics and multiplayer better than unity...\n\nUnreal C++ is faster than Unity C#... And Unreal is better for archviz.\n\nThese were the reasons I chose Unreal over C#, back in the days.\n\nWhen the whole fee thing happened with unity, I was already thinking that unity must be 4x faster at producing games than unreal...\n\nBut then when that happens and i saw everyone trying to escape unity, i felt like well, maybe it wasnt such a bad choice to go for unreal.\n\nPeople say it doesnt matter the engine you choose. I think it matters and it's very very important.\n\nHad i chose unity back in the days, that would be completely different. Perhaps i would have made more games. Learned and practiced more coding.\n\nWhat i dislike the most about unreal, is the blueprint interaction with the C++ system. I think it doesnt work very well. It is just that we get used to it.\n\nIt is clunky to say the least. Really dislike having to close the editor everytime i need to compile something, and then reopen it. And other devs confirmed me and makes them even hesitate before doing some stuff, because of these little gymnastics always getting in the way.\n\nHaving realized that making 3D realistic games is not the best thing to do as a solo indie, I think the most important in making a game solo is to be able to do it fast, and pleasantly, and with as least obstacles and annoyances along the way.\n\nThe other day, I had to change a variable in a struct. First before i even did that i made a back up because i knew it could simply break apart.\n\nThen yes, stuff broke. And then i had to go to each blueprint that uses that struct, redo the node and plug it in everywhere. Okay done. But in the future everytime i change that struct will have to do the same thing again. Something that in code would be as simple as making a search, and then altering it like in 5 seconds....\n\nThis stuff builds up a lot and has a detrimental effect in productivity.\n\nIts super niche to learn how to work with unreal, meaning if you become an expert at unreal, you will have to work with unreal...\n\nBut if you work with unity you are using C# in a more straightforward way, am i correct here?\n\nSure you are programming using blueprints. Though excruciantingly slowly, and its not the same thing to your brain.\n\nAnd yes we can work with C++, but there's a reason half my projects are 100% blueprints. Its clunky to work with C++ in unreal.\n\nShould i try unity for these reasons? I love coding, and im starting to see blueprints as waste of time in terms of skill in the real world. Perhaps unity can make me produce games faster, and be more pleasant to work with?"
    }
]