[
    {
        "link": "https://github.com/PaperMC/Paper/issues/9537",
        "document": "I'm running a paper 1.19.4 server with a custom map of Italy (22k x 24k) so it's very big and our server has about 20/30 player's online. But when the players joins and they start to go across the map, the server begins to spam this warn with different coords every time. We understood that the problem is a try of the server to place a TileEntity (Skull), but it can't do that.\n\n Actually this process uses so Much RAM, and it increases as players keep joining.\n\nSo we tried everything but there are so many corrupted entity tiles, so i tried to use the same map downloaded from the original site on a 1.16.5 server, and i used the remove-corrupted-tile-entities option on paper.yml, and everything seems to work, but when i tried this on 1.19.4, i looked inside the paper-world-defaults.yml but there isn't an option similar to the 1.16.5 one.\n\nCan someone help me? Thanks\n\nThis server is running Paper version git-Paper-550 (MC: 1.19.4) (Implementing API version 1.19.4-R0.1-SNAPSHOT) (Git: on ver/1.19.4)"
    },
    {
        "link": "https://stickypiston.co/account/knowledgebase/86/Fixing-Ticking-Tile-Entity-Error.html",
        "document": "One of the most common issues on a modded Minecraft server, a ticking tile entity causes crashes, lag and potential corruption to player files if the cause is related. The solution for this issue can be found below as well as links to StickyPiston support. Be aware , this is a very long guide and a lot of reading, if you would like to skip that, you can just Contact Support and we will fix it for you!\n• Ticking Tile Entities\n• How do I Know It Is Happening?\n• Locating the Crash and Opening Crash Reports\n• Finding the Crash Report in the Multicraft Control Panel\n• Using FTP to View or Download the Crash Report\n• Using Notepad++ to View or Download the Crash Report\n• How to Remove a Ticking Tile Entity\n• Option 1: Teleport to the Tile Entity and Destroy It\n• Option 3: Use NBT Explorer To Remove the Tile Entity\n\nThis is a common error on Forge servers running modded Minecraft, but can also occur on unmodified Minecraft servers. A block placed in the world is causing an error during the world tick. Because the tick is unable to complete, the server crashes.\n\nHow do I Know It Is Happening?\n• When the error first happens, the server will crash and all the players will be kicked.\n• The server will attempt to restart.\n• If the tile entity is near the spawn area or in a chunk that is loaded, then it will be processed during the world tick and the server will crash again.\n• If the tile entity is somewhere else, then the server will crash when a player gets close to it, or logs in near it.\n\nIf you look at the server console when the server crashes, you will see a message displaying the path of the crash report:\n\nIf you are unsure of the file location, use this guide to find it: How do I find my Minecraft folder?\n\nFinding the Crash Report in the Multicraft Control Panel\n\nIf you have a server with StickyPiston, you can view the most recent crash reports in the Multicraft Control Panel by selecting then from the left hand menu. \n\n You will be given a list of crash reports with the most recent at the top. \n\n Click on one to view it.\n\nUsing FTP to View or Download the Crash Report\n• Login into your server using FTP. Go to the section of the side navigation, select and enter your FTP password.\n• View or download the file and open it in a text editor like Notepad++.\n• For more information on using FTP, see this article: How To: FTP Access to Download and Upload files.\n\nUsing Notepad++ to View or Download the Crash Report\n\nUse this short guide to install a plugin in Notepad++ that will allow you to view crash reports directly: Installing and configuring NppFTP for Notepad++\n\nBelow is a crash report with the section omitted as we won’t be needing it:\n\nThe on the fourth line confirms that it is a ticking tile entity. Below it is the Java exception that is occuring, in this case a followed by the stack trace leading up to the exception.\n\nSince the crash type is a ticking tile entity, the Crash Report contains a section called . This contains information that will help in removing the Tile Entity. We can see it’s :\n\nBut more importantly we also get the :\n\nWe can clearly see the location of the tile Entity in the <x>,<y>,<z> format: . We can also see the <x>,<z> coordinates for the Region: .\n\nHowever, we do not know which world it is, it could be in The Nether or another world added by a mod, like the Deep Dark. For that you need to look for the in the section.\n\nis the main overworld. is The Nether and is The End. Here’s where the files for these dimensions are usually located:\n\nThere are many causes to a Ticking Tile Entity. Here are some of the most common:\n• An item has been placed inside a modded block. The modded block tries to do something with the item and the item is not compatible.\n• Two modded blocks have been placed next to each other. One of them tries to do something with/to the other but they are incompatible.\n• Modded blocks that make up a network of some kind loops back on itself and triggers an inifinite loop.\n• A modded block that interacts with entities (Players, monsters, animals, dropped items) that are near it, tries to do something with/to an entity that is incompatible.\n\nOption 1: Teleport to the Tile Entity and Destroy It\n\nThis will only work if the server is not crashing during start up. \n\n You also only have a very small window of opportunity to break the block:\n• Make sure your player is (OP)ped \n\n See this article for assistance with (OP)ping: How to OP a Player on your Minecraft Server\n• Use the command to put yourself into Creative mode.\n• Use the command to go to the exact location of the Ticking Entity \n\n Replace the with the coordinates found in the crash report.\n\nThis method requires you to download the world using FTP and remove the tile entity using MCEdit.\n• How to Download World Files Using FTP\n• Open the world in MCEdit, from the main menu: \n\n 2a. Click \n\n 2b. Browse to the world folder \n\n 2c. Open the file.\n• Optional: Move to the correct dimension. If the Tile Entity is in the Nether or The End: \n\n 3a. At the top of the window, look for a button labelled , click it \n\n 3b. Click on the dimension you want to move to.\n• Go to the Ticking Entity’s location \n\n 4a. Click on > \n\n 4b. Enter the Tile Entity’s coordinates \n\n 4c. Click \n\n 4d. Close the menu by clicking again.\n• You will now be at the Tile Entity’s location. You can move around using the keys. You can look around by holding down the .\n• Move back slightly so that you can see the block.\n• Select an area around the block using the mouse and the left mouse button. \n\n 7a. The first click selects the first corner, the next click selects the second corner. \n\n 7b. You can select just the block you want by clicking on it twice. \n\n 7c. If you miss the block, you can use from the menu on the left.\n• To remove the blocks you have selected, click or press the key.\n• Save your changes by Opening the and choosing or by pressing .\n• Upload your world back to your server.\n• Optional: Delete the file for the dimension. \n\n This file keeps track of the chunks that are force loaded. Sometimes this needs to be deleted for the the fix to work. The server will recreate the file when it next starts.\n• You don’t have to download your entire world.\n• You only need the file and the correct region file.\n• The region file needs to be in the correct folder relative to the for MCEdit to load it properly.\n\nOption 3: Use NBT Explorer To Remove the Tile Entity\n\nThis method requires you to download the world using FTP and remove the entity using NBT Explorer. \n\n This method is not always successful as it only removes the tile entity from the chunk, but does not remove it from the Block data. \n\n This can result in the tile entity being recreated and causing the crash again.\n• Download the region file containing the tile entity \n\n 1a. The file is located in the region folder for the world that the tile entity is located in and has the format . (example: ) \n\n 1b. Region data for the ticking tile entity is found in the crash report as mentioned in the above example.\n• Find the local chunk coordinates \n\n The region file is separated into chunks, to find the local coordinates: \n\n 3a. From the menu, select > \n\n 3b. In the section, type in the and coordinates of the block. (example: and ) \n\n 3c. Make a note of the and values. (example: and ) \n\n 3d. Close the\n• In the list, locate the local chunk. (example: )\n• Click on the symbol to expand and view the contents of the chunk.\n• Inside that, find and expand . This will show all the tile entities in the chunk.\n• Find the Tile Entity that is crashing the server \n\n If there are only a few, expand each one and check that the x, y and z values match the ticking tile entity \n\n If there are a lot, you can search: \n\n 8a. Click on so that it is highlighted. This will restrict the search area \n\n 8b. From the menu, select > \n\n 8c. In the box type \n\n 8d. In the , type in the coordinate of the Ticking Tile Entity. (example: ) \n\n 8e. Click \n\n 8f. This will find the first TileEntity with a matching x coordinate, check if all three coordinates match \n\n 8g. Use > , or press the key to find the next matching Tile Entity.\n• Once you have found the right one, click on the root node for it (It’ll be named something like ) to highlight it.\n• Delete it using the key or by clicking the red cross on the toolbar.\n• Save your changes with > or by clicking the Disk icon on the toolbar.\n• Upload the Region File to your server, replacing the old one.\n• Optional: Delete the file for the dimension. \n\n This file keeps a track of the chunks that are force loaded. Sometimes this needs to be deleted for the the fix to work. The server will recreate the file when it next starts.\n• This is a drastic option as it will remove ALL the chunks within the region file.\n• Attempt the methods above and make a backup of your world before continuing with the method below.\n\nThe file is located in the region folder for the world that the tile entity is located in and has the format . (Example: )\n\nIf you are a StickyPiston server owner, we provide regular backups of your server and worlds. If none of the options above work you can restore your server from a backup, before the server started to crash, you can learn how to do this by reading: How to restore a Minecraft World From a Backup\n• How do I find my Minecraft folder?\n• How To: FTP Access to Download and Upload files\n• How to OP a Player on your Minecraft Server\n• How to: Backup your Minecraft World Folder\n• How to restore a Minecraft World From a Backup\n\nIf you use our services or not, we are always happy to help. Open a support ticket and our dedicated team will be in touch. \n\n\n\n Open Support Ticket"
    },
    {
        "link": "https://reddit.com/r/admincraft/comments/l9v7u9/minecraft_server_attempted_to_place_tile_entity",
        "document": "Hey uh, Ive been creating a minecraft server that uses paper spigot and it has a custom map(used in world painter I think) and whenever I go into a certain area I get the error line:\n\n\"com.destroystokyo.paper.exception.ServerInternalException: Attempted to place a tile entity (net.minecraft.server.v1_16_R3.TileEntitySign@30ceabb1) at -2622,82,4332 (Block{minecraft:air}) where there was no entity tile! \"\n\nIve experienced this error before and how I fixed it was going into paper.yml and allowing it to remove corrupted entities. That seemed to work before but now its back and uh way worse. Whenever that chunk is loaded the entire server crashes. Any help/suggestions?\n\nEdit: I have found the problem and fixed it! In 1.12, minecraft entity data could've been stored as anything really. It could have blanks, capital letters, etc BUT in 1.13 that was changed. For example, in 1.12 \"Minecraft:Flower Pot\" would work but in 1.13 that would need to be changed to \"minecraft:flower_pot\" In 1.13+, if any chunks are stored with entity data prior to 1.13 then it will crashed the server and give off the error \" Error: v: Non [a-z0-9/._-] character in path of location: minecraft:~entity name~ Exit Code: -1\" The reason why my error was different was because I was using Paper.\n\nI asked the map creator for the world painter file and checked the custom layers. I noticed that the area that was crashing only had 2 layers overlapping and then checked the objects in each layer. I found out that one of the objects in said layer created some flowerpots that \"replaced air.\" I then removed that object, exported that area to a new world, and loaded it in and then it was fixed. Thanks for all the suggestion/help!"
    },
    {
        "link": "https://docs.papermc.io/paper/basic-troubleshooting",
        "document": "This guide will help you diagnose your server's problem before reporting it to PaperMC or the plugin's author.\n\nStop Your Server And Take A Backup Before following this guide, stop your server first. Modifying server files while it is still running will corrupt them. Only a full server shutdown can prevent this. Also, if you don't follow this guide carefully or make a mistake while following this guide, you might corrupt your server. It is highly advised to back up your server before following this guide. It would be ideal to create a test server by copying your production server's file, but that's not always possible.\n\nIf your server encounters a problem, it will either print an error message on the server console, create a crash report and close itself, or do both.\n\nIf your server crashes, the crash report will be saved in the directory. If your server didn't crash, those error messages will be stored in the directory along with other messages.\n\nNote that the logs older than the latest will be compressed and not stored as plain text files.\n\nThe first thing you have to do is diagnose those messages.\n\nIf your error message looks like this, do not blindly report it to PaperMC as it says:\n\nThis can be caused by various things. Maybe your server's hardware is not capable of running Minecraft server. Maybe one of the plugins you use is causing lag on your server.\n\nThe thread dump from Paper Watchdog can be found below that line. If you find any plugin's name in there, talk to the plugin's author about that, not PaperMC.\n\nAlmost every problem you encounter will print error message lines, which are called \"stack trace\", on the server console. Examining the stack trace will help you find out what is causing problems on your server.\n\nThe stack trace starts with the error message, exception type, and exception message.\n\nBoth error messages and exception messages were put there by the developer of either your plugin or Paper. These messages tell you what problem your server experienced. An exception type like tells you the type of the exception. This will help the developer (and you) understand the type of problem.\n\nMany lines beginning with may appear beneath the exception message. These are the body of the stack trace. These lines tell you where the problem starts. The top line of the body of the stack trace will tell you exactly where the problem occurred and, if possible, display where it came from.\n\nIf you find any plugin's name in the stack trace, head to Check Plugin Updates and read from there. In most cases, the plugin, whose name is found on the stack trace, is causing the problem. If not, continue reading.\n\nHere are some examples of stack traces.\n\nIf you can't find the name of any plugin in the thread dump or stack trace, try these steps.\n\nTo determine if it is a plugin or Paper itself that is causing problems, disable all of your plugins first.\n\nYou can disable all of your plugins by renaming the directory to something else, such as , or by archiving the directory and deleting it.\n\nAfter that, try to run your server.\n\nIf the problem is resolved after removing the plugins, you know that it was a plugin that caused the issue. If you still experience problems, head to Paper Documentation. Maybe your server is misconfigured, and that is creating issues.\n\nTo efficiently search for the plugin that is causing the issue, you can do the following:\n• Split your plugins into two groups The size of the two groups can be different, but it is ideal if the difference is minimal. Make sure that plugins that depend on each other are grouped together.\n• Disable one of the two groups of plugins You can disable them by changing their extension from to something else, such as , or move them outside the directory and into a temporary directory.\n• Run your server and check if the problem still exists If the problem is resolved, the plugin that caused the issue is one of the disabled plugins. If the problem is not resolved, the plugin that is causing the issue is one of the active plugins.\n• Repeat from the start with the suspect plugin group Repeat the steps above with groups that have the plugin that is causing the issue.\n\nThere is a chance that your problem is already fixed in the latest release or latest build of the plugin.\n\nHead to your plugin's official download page and check if you are using the latest build or the latest release of the plugin. If not, update it to the latest version and try to run your server again to see if the problem is resolved.\n\nMany plugins use library plugins like ProtocolLib, and you have to download them and put them in directory.\n\nIf you don't update them to the latest version or latest build, you might experience problems related to plugins that use the library plugin.\n\nSome library plugins tell their users to use their latest development build for support of the latest Minecraft version. You should look carefully at the requirements of your plugin.\n\nIf you misconfigured your plugin or your server, it can also cause problems on your server.\n\nMany plugins provide their own documentation about how to set them up properly. Read those documents carefully and check if there is something wrong with the plugin's configuration.\n\nPaper can also be configured in a variety of ways. Check these documents for detailed explanations about each configuration.\n\nIf your problem is related to a plugin you use, and you still don't know how to solve it, you can try to reach out to the plugin's author. Many plugins have a way to contact their author, like a GitHub issue tracker, Discord support guild, Gitter, IRC, etc.\n\nIf your problem isn't related to any plugin, you can come to PaperMC's Discord server and ask for help, or create a new issue on our GitHub issue tracker."
    },
    {
        "link": "https://stickypiston.co/account/knowledgebase/86/Fixing-Ticking-Tile-Entity-Error.html?rp=%2Fknowledgebase%2F86%2FFixing-Ticking-Tile-Entity-Error.html&language=farsi",
        "document": "One of the most common issues on a modded Minecraft server, a ticking tile entity causes crashes, lag and potential corruption to player files if the cause is related. The solution for this issue can be found below as well as links to StickyPiston support. Be aware , this is a very long guide and a lot of reading, if you would like to skip that, you can just Contact Support and we will fix it for you!\n• Ticking Tile Entities\n• How do I Know It Is Happening?\n• Locating the Crash and Opening Crash Reports\n• Finding the Crash Report in the Multicraft Control Panel\n• Using FTP to View or Download the Crash Report\n• Using Notepad++ to View or Download the Crash Report\n• How to Remove a Ticking Tile Entity\n• Option 1: Teleport to the Tile Entity and Destroy It\n• Option 3: Use NBT Explorer To Remove the Tile Entity\n\nThis is a common error on Forge servers running modded Minecraft, but can also occur on unmodified Minecraft servers. A block placed in the world is causing an error during the world tick. Because the tick is unable to complete, the server crashes.\n\nHow do I Know It Is Happening?\n• When the error first happens, the server will crash and all the players will be kicked.\n• The server will attempt to restart.\n• If the tile entity is near the spawn area or in a chunk that is loaded, then it will be processed during the world tick and the server will crash again.\n• If the tile entity is somewhere else, then the server will crash when a player gets close to it, or logs in near it.\n\nIf you look at the server console when the server crashes, you will see a message displaying the path of the crash report:\n\nIf you are unsure of the file location, use this guide to find it: How do I find my Minecraft folder?\n\nFinding the Crash Report in the Multicraft Control Panel\n\nIf you have a server with StickyPiston, you can view the most recent crash reports in the Multicraft Control Panel by selecting then from the left hand menu. \n\n You will be given a list of crash reports with the most recent at the top. \n\n Click on one to view it.\n\nUsing FTP to View or Download the Crash Report\n• Login into your server using FTP. Go to the section of the side navigation, select and enter your FTP password.\n• View or download the file and open it in a text editor like Notepad++.\n• For more information on using FTP, see this article: How To: FTP Access to Download and Upload files.\n\nUsing Notepad++ to View or Download the Crash Report\n\nUse this short guide to install a plugin in Notepad++ that will allow you to view crash reports directly: Installing and configuring NppFTP for Notepad++\n\nBelow is a crash report with the section omitted as we won’t be needing it:\n\nThe on the fourth line confirms that it is a ticking tile entity. Below it is the Java exception that is occuring, in this case a followed by the stack trace leading up to the exception.\n\nSince the crash type is a ticking tile entity, the Crash Report contains a section called . This contains information that will help in removing the Tile Entity. We can see it’s :\n\nBut more importantly we also get the :\n\nWe can clearly see the location of the tile Entity in the <x>,<y>,<z> format: . We can also see the <x>,<z> coordinates for the Region: .\n\nHowever, we do not know which world it is, it could be in The Nether or another world added by a mod, like the Deep Dark. For that you need to look for the in the section.\n\nis the main overworld. is The Nether and is The End. Here’s where the files for these dimensions are usually located:\n\nThere are many causes to a Ticking Tile Entity. Here are some of the most common:\n• An item has been placed inside a modded block. The modded block tries to do something with the item and the item is not compatible.\n• Two modded blocks have been placed next to each other. One of them tries to do something with/to the other but they are incompatible.\n• Modded blocks that make up a network of some kind loops back on itself and triggers an inifinite loop.\n• A modded block that interacts with entities (Players, monsters, animals, dropped items) that are near it, tries to do something with/to an entity that is incompatible.\n\nOption 1: Teleport to the Tile Entity and Destroy It\n\nThis will only work if the server is not crashing during start up. \n\n You also only have a very small window of opportunity to break the block:\n• Make sure your player is (OP)ped \n\n See this article for assistance with (OP)ping: How to OP a Player on your Minecraft Server\n• Use the command to put yourself into Creative mode.\n• Use the command to go to the exact location of the Ticking Entity \n\n Replace the with the coordinates found in the crash report.\n\nThis method requires you to download the world using FTP and remove the tile entity using MCEdit.\n• How to Download World Files Using FTP\n• Open the world in MCEdit, from the main menu: \n\n 2a. Click \n\n 2b. Browse to the world folder \n\n 2c. Open the file.\n• Optional: Move to the correct dimension. If the Tile Entity is in the Nether or The End: \n\n 3a. At the top of the window, look for a button labelled , click it \n\n 3b. Click on the dimension you want to move to.\n• Go to the Ticking Entity’s location \n\n 4a. Click on > \n\n 4b. Enter the Tile Entity’s coordinates \n\n 4c. Click \n\n 4d. Close the menu by clicking again.\n• You will now be at the Tile Entity’s location. You can move around using the keys. You can look around by holding down the .\n• Move back slightly so that you can see the block.\n• Select an area around the block using the mouse and the left mouse button. \n\n 7a. The first click selects the first corner, the next click selects the second corner. \n\n 7b. You can select just the block you want by clicking on it twice. \n\n 7c. If you miss the block, you can use from the menu on the left.\n• To remove the blocks you have selected, click or press the key.\n• Save your changes by Opening the and choosing or by pressing .\n• Upload your world back to your server.\n• Optional: Delete the file for the dimension. \n\n This file keeps track of the chunks that are force loaded. Sometimes this needs to be deleted for the the fix to work. The server will recreate the file when it next starts.\n• You don’t have to download your entire world.\n• You only need the file and the correct region file.\n• The region file needs to be in the correct folder relative to the for MCEdit to load it properly.\n\nOption 3: Use NBT Explorer To Remove the Tile Entity\n\nThis method requires you to download the world using FTP and remove the entity using NBT Explorer. \n\n This method is not always successful as it only removes the tile entity from the chunk, but does not remove it from the Block data. \n\n This can result in the tile entity being recreated and causing the crash again.\n• Download the region file containing the tile entity \n\n 1a. The file is located in the region folder for the world that the tile entity is located in and has the format . (example: ) \n\n 1b. Region data for the ticking tile entity is found in the crash report as mentioned in the above example.\n• Find the local chunk coordinates \n\n The region file is separated into chunks, to find the local coordinates: \n\n 3a. From the menu, select > \n\n 3b. In the section, type in the and coordinates of the block. (example: and ) \n\n 3c. Make a note of the and values. (example: and ) \n\n 3d. Close the\n• In the list, locate the local chunk. (example: )\n• Click on the symbol to expand and view the contents of the chunk.\n• Inside that, find and expand . This will show all the tile entities in the chunk.\n• Find the Tile Entity that is crashing the server \n\n If there are only a few, expand each one and check that the x, y and z values match the ticking tile entity \n\n If there are a lot, you can search: \n\n 8a. Click on so that it is highlighted. This will restrict the search area \n\n 8b. From the menu, select > \n\n 8c. In the box type \n\n 8d. In the , type in the coordinate of the Ticking Tile Entity. (example: ) \n\n 8e. Click \n\n 8f. This will find the first TileEntity with a matching x coordinate, check if all three coordinates match \n\n 8g. Use > , or press the key to find the next matching Tile Entity.\n• Once you have found the right one, click on the root node for it (It’ll be named something like ) to highlight it.\n• Delete it using the key or by clicking the red cross on the toolbar.\n• Save your changes with > or by clicking the Disk icon on the toolbar.\n• Upload the Region File to your server, replacing the old one.\n• Optional: Delete the file for the dimension. \n\n This file keeps a track of the chunks that are force loaded. Sometimes this needs to be deleted for the the fix to work. The server will recreate the file when it next starts.\n• This is a drastic option as it will remove ALL the chunks within the region file.\n• Attempt the methods above and make a backup of your world before continuing with the method below.\n\nThe file is located in the region folder for the world that the tile entity is located in and has the format . (Example: )\n\nIf you are a StickyPiston server owner, we provide regular backups of your server and worlds. If none of the options above work you can restore your server from a backup, before the server started to crash, you can learn how to do this by reading: How to restore a Minecraft World From a Backup\n• How do I find my Minecraft folder?\n• How To: FTP Access to Download and Upload files\n• How to OP a Player on your Minecraft Server\n• How to: Backup your Minecraft World Folder\n• How to restore a Minecraft World From a Backup\n\nIf you use our services or not, we are always happy to help. Open a support ticket and our dedicated team will be in touch. \n\n\n\n Open Support Ticket"
    },
    {
        "link": "https://github.com/PaperMC/Paper/issues/9537",
        "document": "I'm running a paper 1.19.4 server with a custom map of Italy (22k x 24k) so it's very big and our server has about 20/30 player's online. But when the players joins and they start to go across the map, the server begins to spam this warn with different coords every time. We understood that the problem is a try of the server to place a TileEntity (Skull), but it can't do that.\n\n Actually this process uses so Much RAM, and it increases as players keep joining.\n\nSo we tried everything but there are so many corrupted entity tiles, so i tried to use the same map downloaded from the original site on a 1.16.5 server, and i used the remove-corrupted-tile-entities option on paper.yml, and everything seems to work, but when i tried this on 1.19.4, i looked inside the paper-world-defaults.yml but there isn't an option similar to the 1.16.5 one.\n\nCan someone help me? Thanks\n\nThis server is running Paper version git-Paper-550 (MC: 1.19.4) (Implementing API version 1.19.4-R0.1-SNAPSHOT) (Git: on ver/1.19.4)"
    },
    {
        "link": "https://spigotmc.org/threads/placing-blocks-entities-fast-like-in-fastasyncworldedit.520081",
        "document": ""
    },
    {
        "link": "https://docs.papermc.io/paper/dev/api",
        "document": "Welcome to the Paper API guide! This guide includes information for developers about how to use specific parts of the Paper API."
    },
    {
        "link": "https://reddit.com/r/admincraft/comments/1dp1ikf/is_there_a_plugin_to_allow_accurate_placement",
        "document": "I'm looking for a plugin that I can install on my Paper Server to allow the easyPlace mode to rotate all blocks in the correct way. Currently all directional blocks such as stairs etc. are placed in the direction the player is facing and I want them to be placed correctly like in the schematic. I know that there are Mods like Tweakeroo or Carpet which include that feature but I want to stay on Paper for now.\n\nI think the plugin needs to allow a feature called: \" accurate placement protocol \""
    },
    {
        "link": "https://jd.papermc.io/paper/1.21.4/allclasses-index.html",
        "document": "Deprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version.\n\nDeprecated, for removal: This API element is subject to removal in a future version."
    }
]