[
    {
        "link": "https://dev.to/plazarev/18-best-javascript-gantt-chart-components-2d78",
        "document": "In today's era of high technologies, distributed teams, and remote work, it has become essential for organizations to invest in project management applications. Choosing the right features to equip your project management app is crucial for your team's productivity and budget. According to the Capterra user rating data, project planning and scheduling is the key feature of project management software. The best way to make this feature a part of your project is to use a Gantt chart. Gantt charts give you full control over the project workflow and resource allocation.\n\nIn this article, we will consider popular commercial and open-source JavaScript Gantt components that will help you integrate a Gantt chart into your project management app much faster.\n\nFirst, let us look closely at paid-for Gantt options and highlight their main characteristics. Businesses frequently prefer such products since they have rich feature sets, get regular updates and technical support, and can be used with various JavaScript frameworks (React, Angular, Vue.js) and back-end technologies.\n\nDHTMLX Gantt is a mature and developer-friendly JavaScript library for creating Gantt charts of any complexity and with any number of tasks. With this tool at hand, you can easily add a Gantt chart to any web app and equip it with the right features to cover all of your project management needs. High working loads like 30 000+ tasks and the use of advanced features won’t downgrade the DHTMLX Gantt performance due to dynamic loading and smart rendering.\n\nIn basic usage scenarios, you can create projects with different types of tasks (regular and unscheduled), set task dependencies, sort and filter data, add project summaries with rollup tasks, and make changes on the fly with drag-n-drop, keyboard navigation, and inline editing.\n\nIf the achievement of your objectives requires more sophisticated tools, DHTMLX Gantt has a lot to offer to bring your project management experience to a new level. Here you can enjoy numerous powerful features such as automatic scheduling, critical path calculation, flexible time formatting, split tasks, task constraints, multiple charts on one page, and much more.\n\nDHTMLX Gantt is especially good at handling project resources assigned to tasks on a full- or part-time basis. There are two layout views showing resource workload and allocation – resource load diagram and histogram. These views get in sync with the main Gantt chart, and thus it is easy to balance the workload. You can also group tasks by resources, create working calendars for different resources (usually referring to employees), and merge them into one.\n\nThe comprehensive API of this JavaScript component allows you to make any Gantt element look and behave the way you like. You are free to add new timeline items (baselines, deadlines), custom tasks and time scales, and custom content in timeline cells or on top of Gantt. The UI is flexible and personalizable thanks to the availability of 7 predefined skins, including high-contrast ones, localization (32 locales), accessibility support, and RTL mode.\n\nThe DHTMLX team also offers useful add-ons to reinforce Gantt in your web apps. There are standalone export modules for safely exporting your charts to PDF or PNG format and converting Gantt data for use in popular software - MS Project and Primavera. A Node.js server module is indispensable for performing complex operations on the Gantt chart, integrating it with third-party systems, and providing flawless user experience for teams working simultaneously on multiple devices.\n\nOn top of that, DHTMLX Gantt can be easily integrated with other DHTMLX components such as Scheduler, Kanban, and To Do List for building a versatile web solution for your business.\n\nAbundant developer guides and samples allow you to quickly learn the essentials of working with the Gantt chart and make the most of its capabilities.\n\nDHTMLX Gantt has a flexible licensing model, which allows adjusting the license to the size of your development team and your requirements. Thus, it is perfect for companies of any size, from small startups to medium-sized and large corporations.\n\nBryntum Gantt is a lightweight JavaScript version of Bryntum’s Gantt for Ext JS delivered back in 2019. This product has some noteworthy peculiarities related to managing project data (tasks, resources, dependencies, etc.) on the backend and the presentation of this data in the UI.\n\nUnder the hood, it uses an in-house produced scheduling engine based on the company’s other technology called ChronoGraph for working on projects of different scales. The Gantt engine supports automatic scheduling, backward scheduling, task constraints, 4 scheduling modes, calendars (for projects, events, and resources), recurrent and fixed time intervals for calendars.\n\nThe UI part of the Gantt is based on the Bryntum Grid and inherits most of its features such as filtering, sorting, column resizing, and summarizing. The Gantt structure may include multiple, individually scrollable grid sections (on the right of the timeline). For instance, you can create new sections with inactive tasks or resources and then add these items to the project with drag-and-drop. Bryntum Gantt also allows using conflict resolution popups, baselines, labels, time range indicators, and progress lines in the Gantt timeline to make it more informative. There is also a built-in editor with a programmatic validation of any editing actions.\n\nIf necessary, you can override almost any part of the codebase and adjust Gantt elements to your needs. This component is shipped with five built-in customizable themes that allow specifying the general appearance of the Gantt chart.\n\nHaving a rich feature set, Bryntum Gantt has rather expensive licenses. To my mind, this library is suitable for complex projects in large enterprise companies with big budgets.\n\nWebix Gantt is a relatively new JavaScript widget included in the Webix UI Library. When integrated into a web project, this Gantt component allows creating tasks and subtasks, tracking their progress, assessing potential risks, and detecting bottlenecks in projects. The widget supports all the CRUD operations for handling project tasks.\n\nYou can flexibly configure the Gantt in accordance with your project requirements. If the basic feature set does not satisfy the needs of your project, you can add more advanced features. For instance, it is possible to expand the Gantt functionality with complex scales and zooming, marks on scales, division of tasks, critical path calculation, and more. Webix Gantt also provides instruments for working with project resources (Resource view) and tracking their workload (Resource diagram).\n\nThe widget is based on the Webix Jet micro-framework designed to speed up the development of Webix-based apps. With Webix Jet, the Gantt interface is divided into numerous stand-alone Webix components (views). Thus, you can modify, add, or even remove any part of the UI.\n\nDespite being a newcomer on the JavaScript Gantt landscape, this Gantt widget already has a decent feature set. However, there are not many licensing options for buying Webix Gantt without any extra tools.\n\n Useful resources: documentation, samples, blog, GitHub repository, YouTube channel\n\n Trial version: Webix Gantt\n\n Price: from $798\n\nSyncfusion Gantt is one of the numerous JavaScript controls included in the Essential JS 2 library and carries all of its general features. For instance, you can benefit from a modular architecture, touch support, multiple built-in themes, seamless data binding, and other useful things.\n\nAt the same time, this project management tool is equipped with a pack of features that are specifically dedicated to planning, scheduling, and monitoring one or several projects with involved resources within a single Gantt chart. The Gantt interface allows presenting tasks with their dependencies and manipulating them in different timeline modes (hour, week, month, and year). The timeline may have additional details (working days and holidays, baselines, event markers, tooltips, critical path), making it easier to understand and analyze data. There are many options for specifying the behavior of rows and columns in Gantt.\n\nUsing different template options, you can create custom headers, taskbars, cell contents, editors, and other items. Syncfusion Gantt provides two ways to ensure a good user experience with large volumes of data. You can apply the virtual scrolling to load hefty data sets and enable the immutable mode to bring editing changes to life without delays. If needed, the Gantt content can be exported to PDF and Excel formats.\n\nSyncfusion Gantt is a great solution for those who also plan to use other controls from the Essential JS 2 library since it cannot be purchased as a stand-alone tool. Otherwise, it is not the most favorable price offer when compared with other products.\n\nUseful resources: documentation, samples, blog, YouTube channel, GitHub repository\n\n Trial version: Essential JS 2\n\n Price: from $995 (for the full package of Essential JS 2 components)\n\nDlhSoft Gantt Chart Hyper Library is a package of JavaScript scheduling components for building business web applications. As its name suggests, the centerpiece of this product is the GanttChartView component that gives you an opportunity to add interactive JavaScript Gantt charts to your project.\n\nApart from standard Gantt features, this component allows expanding your project management capabilities with auto-scheduling, task splitting, critical path highlighting, and plain resource allocation. There are configuration options for setting the required time scale, zooming level, working and nonworking time, and some other parameters. Custom appearance settings are available for changing the look of the whole chart or individual items shown in the timeline.\n\nWhen loading and displaying a large number of items in the Gantt chart, it will continue working smoothly thanks to the virtualization feature enabled by default. To access the Gantt data offline, you can save it in PDF, Excel, and Microsoft Project XML files. On top of all that, you have an opportunity to create other types of charts (load chart, PERT chart, network diagram) by using Gantt chart elements or by defining data on the fly.\n\nDlhSoft Gantt Chart Hyper Library is not the most remarkable solution in terms of functional capabilities. But it can be purchased separately or in a bundle with other scheduling instruments at reasonable prices.\n\nUseful resources: documentation, samples, GitHub repository\n\n Trial version: DlhSoft Gantt Chart\n\n Price: from $455 (Mini edition with Gantt component only), from $848 (Standard edition with other scheduling components),\n\nAnyGantt is a JavaScript-based tool provided by the AnyChart company for embedding informative Gantt charts into applications. Using this solution, you can create two types of Gantt charts - Project and Resource. The first Gantt type is intended for visualizing scheduled project workflows, while the second one displays operational assets (workers, equipment, etc.) used for achieving certain goals over periods of time. These Gantts depict different timeline items, but at the same time, they have similar settings.\n\nAll elements of Gantt charts based on AnyGantt can be configured in the desired way via visual settings. When exploring the features directly associated with handling project tasks, you’ll find some useful, but common things, namely markers, tooltips, labels, milestones, etc. Anychart also offers a variety of formatting options for text-based elements and flexible settings for date and time formats. The Live Edit mode helps to introduce changes in the Gantt chart on the go.\n\nAnyGantt supports asynchronous rendering for convenient working with data-intensive charts. This Gantt component uses the GraphicsJS library for customizing timeline elements. Using this JavaScript graphics library, you can replace default items with custom ones in project and resource charts. It is possible to export charts to images (SVG, PNG, JPG), PDF or data files (CSV, Excel).\n\nIf you like what you see in AnyGantt at the moment and want to try it in a pre-revenue startup, you can buy the current version of the product just for $49. For all other scenarios, this product is quite expensive. Even if you want to use it in internal apps, you’ll have to pay $799. The enterprise and OEM license prices are available on request, but I can assume that they are even higher.\n\nUseful resources: documentation, samples, YouTube channel\n\n Trial version: AnyGantt\n\n Price: $49 for pre-revenue startups, from $799 for internal apps\n\nThe Kendo UI for jQuery library by Telerik provides a variety of UI components for implementing various functionalities on the client side, including Gantt charts. For displaying all necessary project planning info, the layout of the jQuery Gantt chart consists of two standard sections - GanttList and Timeline.\n\nThe GanttList section is an extended version of Kendo’s TreeList widget that inherits most of its capabilities and shows tasks, resources, owners, dates, and all other important data in a tabular form. If necessary, you can apply extra editing, filtering, expanding/collapsing, and visibility attributes to grid columns.\n\nUsing Gantt templates, it is not a problem to add new types of content in columns (e.g. images of task owners). The Timeline section serves for illustrating tasks with their duration and dependencies on different timescales (day, week, month). End-users can perform various operations on tasks such as rescheduling, deleting, editing, or changing dependencies between tasks.\n\nBeing a part of the Kendo UI for jQuery library, this jQuery Gantt supports all of its basic features. You can take advantage of customizable stock themes, DataSource library, exporting to PDF and Excel, and accessibility features.\n\nAll in all, I consider this Gantt component a decent investment only for building project management apps based on the Kendo UI library.\n\nUseful resources: documentation, samples, \n\n Trial version: Kendo UI for jQuery\n\n Price: from $899 (for the full package of Kendo UI components)\n\nThe Visual Scheduling Widget (VSW) is a jQuery Gantt component developed by Netronic to facilitate the integration of a multifunctional scheduling chart into enterprise applications. The user interface of this widget seems a bit old-fashioned and cumbersome, but still, there is an extensive function package for managing complex projects.\n\nA timescale is an essential part of any Gantt chart that should be flexible and easy to use, therefore the VSW widget allows changing this parameter dynamically. Resource management is another important feature of modern Gantt charts and VSW gives the possibility to detect resource capacity conflicts by embedding a histogram right in chart rows.\n\nWhen complex projects are split into smaller and more manageable subprojects, VSW will continue visualizing dependencies in a clear manner. Much of multi-level hierarchical data may be confusing for users, therefore VSW provides built-in animations for clarifying what’s happening on the screen. All unscheduled tasks and unassigned resources can be put together in the additional table (backlog) and simply dragged into the Gantt chart when needed.\n\nThe Visual Scheduling Widget (VSW) offers a great variety of possibilities for managing projects of any complexity via Gantt charts, but it may seem overpriced even for well-funded teams.\n\nDayPilot Pro for JavaScript is a JavaScript library comprising scheduling web components for business-oriented solutions. And as you probably guessed, it includes the Gantt component for visualizing different project management scenarios.\n\nDayPilot Gantt allows implementing essential features required for planning and managing project tasks: task types (regular, milestones, task groups), progress bars, bubble tooltips, context menus, etc. The Gantt component is fully customizable, thus you’ll be able to fine-tune Gantt elements to your liking. It also supports full CSS styling. The Gantt chart performance is optimized to process large data sets with the progressive rendering of rows, tasks, and cells during scrolling. If needed, Gantt charts can be saved as images in SVG, PNG, and JPEG formats.\n\nDayPilot offers two useful auxiliary tools for working with the library’s components. The CSS Theme Designer helps to build CSS themes for Gantt and other DayPilot components using the online WYSIWYG editor. The UI builder is used to quickly configure the Gantt UI and generate a downloadable project.\n\nThe Gantt component from DayPilot includes common features required for conveniently scheduling your projects. But I think that it can be a good option only if you need other project management tools included in the DayPilot Pro for JavaScript library (Scheduler, Event Calendar, and Monthly Calendar). The cheapest license option includes only 6 months maintenance subscription and it is not renewable.\n\nUseful resources: documentation, samples, tutorials, DayPilot knowledge base\n\n Trial version: DayPilot Pro for JavaScript\n\n Price: from $549 (for the full package of DayPilot components)\n\nDevExtreme Gantt is one of the latest additions to the collection of enterprise-specific UI widgets developed by DevExpress for building standard web and mobile apps. But it already has a standard set of features for managing project task flows and their dependencies over a certain period of time.\n\nThe DevExtreme Gantt component gives the possibility to avoid issues in task dependencies by defining your own validation rules. Filtering, sorting, and zooming features simplify the work with large Gantt charts. You can also display tasks in different time intervals (from hours to years) and highlight particular time spans in the timeline with strip lines. Moreover, it already allows making resource assignments. You are able to export the Gantt content to a PDF document.\n\nThis JavaScript widget also provides multiple customization capabilities. For example, you can play around with the general chart appearance (via settings or customizable themes), use templates for changing individual tasks, add custom controls to the toolbar, and adjust context menus.\n\nDevExtreme Gantt is a new product that currently lacks many useful features. So I would not hurry to spend money on it but rather give it time to become more mature (unless you are interested in other DevExtreme components as well).\n\nUseful resources: documentation, samples, blog, YouTube channel\n\n Trial version: DevExtreme\n\n Price: from $499 (for the full package of DevExtreme widgets)\n\nHighcharts Gantt is a JavaScript library built by Highsoft on top of the company’s popular charting library named HighchartsJS and in close collaboration with clients.\n\nIn Highcharts Gantt, many commonly used features such as task dependencies, milestones, progress indicators, etc. are available by default. When dealing with big tasks, it is possible to split them into smaller subtasks and group resources and manipulate items in the timeline with simple drag-and-drop actions.\n\nThis Gantt component displays well on devices of any size and supports navigation with touch gestures, a mouse, and a keyboard.\n\nWhen choosing Highcharts Gantt for your next project, you can benefit from the core features offered in all Highcharts products. Using the Highcharts export module, you can export charts to PNG, JPG, PDF, and SVG formats at the touch of a single button or print your Gantt chart right from the page. The WebGL-powered boost module will help to render big data. The Highcharts Debugger is one more instrument that will help to detect errors in your code and accelerate the development process.\n\nHighcharts Gant goes as an additional product to the HighchartsJS charting library, which is included in all license types. Taking into account this fact and current prices, this Gantt can be a viable option in projects where other types of charts from HighchartsJS are also necessary.\n\nUseful resources: documentation, samples, tutorials, YouTube channel, GitHub repository\n\n Trial version: HighCharts Gantt\n\n Price: for internal use - from $182 (annual license), from $420 (perpetual license), prices for OEM license are available on request\n\nFusionCharts is a well-known brand in the field of data visualization. Its flagship product FusionCharts Suite includes a wide variety of simple and complex charts. It also addresses the issue of creating a basic Gantt chart on the web page with the corresponding widget included in the FusionWidgets XT pack.\n\nThe Gantt widget does not support sophisticated features such as critical path calculation or auto-scheduling. But it still offers some useful things to help teams visually plan and track projects. The Gantt structure may include any number of additional columns for displaying extra parameters such as project resources. You can complement your Gantt chart with milestones, progress indicators for each task, trendlines to highlight specific dates ( \"Today\", \"Holiday\",etc.), tooltips, annotations, legends, and more. It is possible to ensure a consistent look of your chart using predefined themes and customize them if needed.\n\nThere are also other customization opportunities for this Gantt widget. The main Gantt elements (grid table, cells, dependency links, date formats) and additional timeline items (tooltips, milestones, legends, labels) can be adjusted to your requirements. The exporting feature will help to save your Gantt projects in JPG, PNG, SVG, and PDF formats.\n\nThis Gantt chart may be a nice option if you are building a dashboard displaying project data in a variety of ways. However, it lacks the major Gantt features necessary for full-fledged project management apps.\n\nUseful resources: documentation, samples, YouTube channel, GitHub repository\n\n Trial version: FusionCharts Suite \n\n Price: from $499 (annual), from $1,299 (perpetual) (prices are indicated for the full package of FusionCharts widgets)\n\nJSCharting is a JavaScript library that offers a way to add different types of charts to a web application, plus Gantt charts (JSGantt).\n\nThe Gantt chart interface may include some common elements for working with tasks as well as more advanced capabilities. For example, it is possible to calculate a critical path, apply auto-scheduling, add task completion indicators, etc. JSGantt is rendered with SVG and HTML5 in all major browsers. All project data can be loaded in the chart from JSON or the user’s database. Simple JavaScript settings allow configuring your Gantt chart as needed.\n\nYou can also count on a variety of general features available for all chart types included in JSCharting. The library is touch and mobile optimized, complies with the main accessibility standards, provides an official export server, supports various globalization and internationalization features, advanced visuals, etc.\n\nJust like with Fusioncharts, this Gantt is too basic to purchase it for a complex project management solution. But it can be a fine choice if you are looking for a collection of charts, where Gantt is just one of the data visualization options you need.\n\nUseful resources: documentation, samples, \n\n Trial version: JSCharting (+JSGantt)\n\n Price: from $995 (for the full package of JSCharting components)\n\nThe gantt-schedule-timeline-calendar (GSTC) is a JavaScript component that can be used in business apps as a universal planning solution. It brings together four tools commonly used in companies all over the world for arranging their day-to-day activities. At the moment, we are primarily interested in the Gantt part of this product.\n\nThe Gantt interface can contain movable and resizable items, collapsible and expandable groups of tasks, multiple items in one row, sortable and searchable list columns, etc. One of the main strengths of GSTC is its elasticity i.e. almost any part of the component from the DOM tree to logic can be adjusted to your requirements with config, state, and custom plugins. It is also not a problem to add any third-party libraries. The HTML Gantt content is modifiable via templates and slots. The use of BEM-based CSS rules makes it easier to change the appearance of your Gantt chart. Moreover, the component is mobile-ready and should perform well with large datasets.\n\nGSTC may not include some advanced features, but it is a four-in-one tool that can also be extended with custom plugins. Thus, GSTC may be a noteworthy instrument for building multi-faceted project management apps.\n\nIf you work on a non-commercial project with a limited budget, one of the following open source Gantts may suit you.\n\nGoogle Charts is a popular data visualization service with a rich selection of data visualization types, and a Gantt chart is one of them. The arsenal of functional capabilities for this chart type is not very diverse, but it provides everything you need for tackling common project management tasks. The Google Charts API comes with a range of configuration options, methods, and events for organizing your Gantt chart in the desired way. Charts are rendered in the browser using SVG technology.\n\nYou can set and edit the main parameters related to the timeframe of project tasks (start/end/duration). If any of these values are not specified by a user, they will be calculated automatically. The Gantt timeline can be displayed with or without dependency arrows. The Gantt chart built with Google displays relevant data on each task via tooltips. Depending on the Gantt configuration, the tooltip content may include the task timing, completion status (in %), project resources, and the presence of a given task on a critical path. Tasks dedicated to a particular area of the project can be combined into groups with resources. Styling settings allow depicting Gantt elements (tracks, dependency lines, critical path) in different colors.\n\nFrappe Gantt is an open source JavaScript library that serves for incorporating simple, interactive Gantt charts into web projects. From the standpoint of functionality, this free-to-use tool does not provide anything fancy, but it still supports some basic features for accurate planning and handling of projects.\n\nIt allows users to create tasks, change their schedule and duration with drag-and-drop, add dependency lines, and review extra information on tasks via tooltips. You can add multiple timescales to the chart. The list of possible options includes Quarter Day, Half Day, Full Day, Week, and Month. There are also some customization opportunities such as changing the tooltip content with custom HTML, modifying the appearance of task bars and dependency lines, and setting the default timescale. It should be noted that Frappe Gantt has two dependencies: momentjs and snapsvg.\n\nTwproject Gantt is an online JavaScript Gantt chart editor engineered by Open Lab as a stand-alone part of a more complex solution (Twproject) for visually planning and tracking projects. Based on jQuery, this tool helps to create an informative Gantt chart with the indication of core parameters such as assignments, dependencies between them, statuses of tasks, and milestones that can be edited at any moment.\n\nAt a more advanced level, the editor allows calculating a critical path to avoid bottlenecks and take care of project resources to ensure their balanced allocation. You can also use progress lines to see whether tasks are behind or right on schedule and compare the current state of the project with the initial plan using baselines. The print option allows saving the current Gantt project in PDF format. This product can be a good choice for those who have some prior experience with MS-Project.\n\nMermaidJS is a JavaScript library for dynamically generating popular types of charts and diagrams such as flowcharts, UML diagrams, pie charts, and of course, Gantt charts. When implementing a Gantt chart with Mermaid, you can set the margins for rendering the chart, split its structure into different sections, and define a date format. It supports common features required for managing tasks such as milestones, dependency lines, non-working days, \"today\" markers, etc. You can also leave comments within your Gantt chart - and the parser will ignore them.\n\n\n\n The Gantt appearance is modified by using customizable themes and defining a number of CSS classes. There are 3 rendering options for your Gantt chart: SVG, PNG, or a Markdown link that can be inserted into docs. Even people without any coding background can create a Gantt chart and other diagrams using the Mermaid Live Editor. Interestingly, GitHub added native support for Mermaid in order to help developers quickly generate diagrams in their open source projects.\n\nAs you can see, there are plenty of commercial as well as open source JavaScript Gantt libraries. And now the hardest part - choosing the right tool for your project. I just provided general information on the functional capabilities of Gantts available out there. What to do next? You should certainly get acquainted with the technical part of all products by using useful resources added for each of them. While pricing and licensing may not be the ultimate driver in your decision, these are still important factors to consider and I shared my thoughts on this matter for each commercial Gantt. And, of course, you cannot make the final decision without practical testing of tools that seem appealing to you."
    },
    {
        "link": "https://bryntum.com/blog/top-5-javascript-gantt-chart-libraries",
        "document": "Looking for a Gantt chart library to use in your project management app? You’ll want to consider how easy a […]\n\nLooking for a Gantt chart library to use in your project management app?\n\nYou’ll want to consider how easy a library is to get started with, what features it offers, and what it costs.\n\nWe compare five common libraries for creating Gantt charts and give you a list of pros and cons for each. We’ll look at the following libraries:\n\nThe Bryntum suite of commercial JavaScript web components for project management and resource scheduling includes Bryntum Gantt, which is easy to use with popular frontend frameworks like React, Vue, and Angular. Bryntum has a good selection of demos that show you how to use their products as web components and help you integrate Bryntum components with PHP or ASP.NET backends, Ionic for mobile app development, and Salesforce.\n\nYou have two options to install the Bryntum Gantt library:\n• Download the package and use the source files.\n\nTo install the Bryntum Gantt component using npm, you need to get access to the private Bryntum npm registry. Follow the Access to npm registry guide in the Bryntum docs to do so. Once you’ve logged in to the registry, install the Gantt component by following the guide here.\n\nTo make a Bryntum Gantt chart, you create an instance of the Gantt chart object and pass in a configuration object to the constructor function. The configuration determines what the Gantt chart looks like and where it gets data from:\n\nThe property is the DOM element that the Gantt chart will be added to as a child. The determines the layout of the timeline view and headers. The property allows you to modify the timeline headers. The property is used to define the data column on the left side of the Gantt.\n\nTo style the Gantt, you can use one of five themes. For example, you can import the Stockholm theme in your CSS file:\n\nYou can modify the themes or create your own custom theme.\n\nBasic Bryntum Gantt data consists of tasks and dependencies. You use the Bryntum Crud Manager to get and sync data changes with a backend. The Crud Manager uses AJAX for fetching and posting data and JSON for encoding data. You can configure the Crud Manager in the property of the Gantt configuration object. For example, in the code below, the property is used to populate the Gantt chart data stores:\n\nYou can configure to sync data changes to a specific URL. For more information, read the project data guide in the Bryntum docs.\n\nYou don’t have to use the Bryntum Crud Manager for data fetching in your Bryntum Gantt. Other methods are available, such as binding existing data to a component.\n\nBryntum Gantt has a lot of functionality out of the box, such as adding, editing, and deleting tasks and dependencies. The component is highly customizable and has extensive documentation that includes live code demos. Advanced features of Bryntum Gantt include:\n• Export and import from Microsoft Project and Primavera P6.\n• Easy integration with other Bryntum project management tools, like Bryntum Task Board.\n\nTake a look at a summary of the Bryntum Gantt features here and view demos of the features here.\n\nBryntum has an active blog where you can read tutorials like How to visualize your Google Sheets data with Bryntum Gantt and customer experiences of using Bryntum components.\n\nThe Bryntum Gantt chart is built with JavaScript ES6+, has no external dependencies, and uses a super-fast rendering engine, making it a performant option for your Gantt chart, even when working with large datasets.\n\nYou can purchase Bryntum components individually or as a discounted bundle. The Bryntum Gantt license starts at $900 per developer, and there are different licenses for small teams, large teams, non-commercial use, and commercial use. The internal, non-commercial EUL license is perpetual and includes free upgrades for one year and forum support. Discounts are offered for charity, environmental, and educational work, as well as for start-ups. Sign up for a free 45-day Bryntum trial here.\n\nBryntum Gantt offers a range of benefits that are ideal for the use in enterprise-grade applications:\n• The Bryntum suite of components have detailed documentation with live code examples and blog post tutorials.\n• A range of demos for Bryntum Gantt and other Bryntum components include source code and tips for integrating with various frameworks. You can search the Bryntum demos page by frontend framework or features, or using a text search.\n• Bryntum Gantt is highly customizable with a wide range of advanced features.\n• Bryntum Gantt is a high-performance library well suited to large datasets.\n• The luxurious Bryntum Gantt UX is a step above its competitors’. The Bryntum UI is clean and focused on critical project information so that you don’t lose essential tasks in customization options or large datasets.\n\nBryntum Grantt is built with both the developer and end user in mind, with a sleek, modern design that makes it a breeze to visually assign tasks and navigate intricate projects. Features like drag-and-drop resource allocation and instantaneous project management recalculations add value to the component that’s hard to beat.\n\nIf you only need a simple Gantt chart, Bryntum Gantt may be an expensive option.\n\nDHTMLX has a number of commercial web components for project management, data analysis, and content management. You can use the DHTMLX Gantt library with popular frontend frameworks React, Vue, and Angular, and the DHTMLX website hosts demos, documentation, and tutorials for various server-side integrations such as with Salesforce, PHP, Node, ASP.NET, and Ruby on Rails.\n\nYou have two options to install the DHTMLX Gantt library:\n• Download the package and use the source files.\n\nTo create a basic Gantt chart with DHTMLX Gantt, initialize the Gantt in an HTML container using the method. You can configure the look of the Gantt chart using the and properties. In the code example below, we define two columns for a Gantt chart:\n\nThe column adds a column with a “+” sign, which you use to create a new task. The and definition code should be above the Gantt initialization.\n\nStyle the Gantt using one of the eight DHTMLX Gantt skins. For example, you can import the default “Terrace” skin in your CSS file:\n\nYou can modify the skins or create your own custom skin by adjusting the CSS styling.\n\nTo load data into your DHTMLX Gantt chart, use the or methods:\n\nSync data changes to a backend using the DataProcessor API or the Gantt AJAX module.\n\nDHTMLX Gantt offers a lot of basic functionality, such as adding, editing, and deleting tasks and dependencies (or “links”, as dependencies are referred to in DHTMLX Gantt).\n\nDHTMLX Gantt is fully customizable and has substantial documentation. You can see the available features here and view demos of the features here. Advanced features include:\n• Integration with other DHTMLX project management tools, such as the DHTMLX To Do List.\n\nDHTMLX has an active blog where you’ll find tutorials like How to Create a JavaScript Gantt Chart with DHTMLX and customer spotlights detailing their experience with using DHTMLX components.\n\nThe DHTMLX Gantt chart is built with JavaScript and has no external dependencies.\n\nLicenses for DHTMLX components come with a year of support. Choose your license from the range of DHTMLX license options based on the size of your team and whether you’ll use the components in a SaaS product. A license for DHTMLX Gantt starts at $699, and you can take advantage of DHTMLX bundle offers if you’d like to use several DHTMLX components. The licensed libraries are the PRO versions. DHTMLX also has open-source standard library versions of their components that are free to use but have fewer features. You can see the differences between the standard and the PRO library features for DHTMLX Gantt here.\n• DHTMLX provides a selection of Gantt demos with source code, including integration with various frameworks. The demos page includes a text search filter.\n• DHTMLX Gantt is highly customizable with many advanced features.\n\nThe cons to DHTMLX Gantt are:\n• The predefined skins for styling DHTMLX Gantt charts look outdated and are not as attractive as the themes for the Syncfusion and Bryntum Gantt chart libraries.\n• The API docs are hard to browse.\n\nSyncFusion is a commercial UI component library for web, desktop, and mobile apps. It has UI components, including a Gantt chart, for the popular JavaScript frameworks React, Angular, and Vue. Syncfusion also supports the non-JavaScript frameworks Blazor and Flutter, which are used for frontend web development.\n\nYou have three options to install the SyncFusion Gantt:\n\nTo create a Gantt chart, you create an instance of the SyncFusion Gantt and pass in the configuration object, which determines how the Gantt will look and where it will get data from.\n\nThe property is used to define the data column on the left side of the Gantt. The method takes in the DOM element that the Gantt chart will be added to as a child.\n\nFor basic data fetching, you can use the browser fetch API and pass the data to the property:\n\nYou can use to simplify getting and syncing data from a backend:\n\nThe property is required to get task details from a data source. It maps task property names to the task property names of the data source. This allows for some variability in the structure of the data source.\n\nTo style the Gantt, import one of the theme CSS stylesheets:\n\nThere are nine themes to choose from, and you can also customize themes using the Theme Studio for Essential JS 2 GUI.\n\nThe Syncfusion Gantt chart is mobile touch-friendly, responsive, and built with accessibility in mind. It’s keyboard navigable and has WAI-ARIA accessibility support. The theme editor GUI makes for easy customization of the Gantt styling.\n\nSyncfusion has an active blog, and Syncfusion Gantt has comprehensive documentation and a demos page that shows the features of the Gantt.\n\nSyncfusion Gantt has many features that make it suitable for creating complex Gantt charts, including:\n\nSyncfusion UI components are sold as bundles. Team licenses start at $395 per month, or you can choose an annual license for a project, company, or company division. Paid-for licenses include 24-hour support, unlimited bug and feature requests, and access to remote support. There is a free community license for companies with less than $1 million in annual gross revenue, less than six developers, and that have not received more than $3 million in capital from an outside source. You can sign up for a 30-day free trial of Syncfusion, which includes the same support services as licensed customers.\n• The Syncfusion Gantt demos page includes source code and links to API documentation, and you can edit the demos on StackBlitz.\n• Syncfusion has comprehensive documentation for the Gantt component.\n• The Syncfusion Gantt is highly customizable with many advanced features.\n\nSyncfusion Gantt is an expensive choice if you don’t qualify for the community license or only want to use the Gantt chart or a few of the Syncfusion components.\n\nJSCharting is a commercial JavaScript chart library with over 150 types of charts, including Gantt. Like Frappe Gantt, JSCharting renders charts with SVG and HTML5. You can use JSCharting with the popular JavaScript frameworks React, Angular, and Vue, and it has a JSCharting PHP bundle to simplify connecting a JSCharting Gantt to a PHP backend that uses a MySQL database.\n\nYou have three options to install JSCharting:\n\nOnce you have installed JSCharting, you create a Gantt chart by creating an instance of the JS chart object using the function. The first argument of this function is the of the HTML element or the element object that this chart will be added to as a child. The second argument is the Gantt configuration object:\n\nThe property is set to for a Gantt chart. The stacked z-axis scale type makes series data points with the same x values take up the same space on the x-axis. JSCharting uses series data to represent tasks or events. Each item in the series data is a task or event with a specific start and end date.\n\nThe underscore syntax is a feature of JSCharting called code expansion that allows you to combine nested property paths into a single property name:\n\nThere are many other configuration properties, for example, to customize the legend, axes, and colors.\n\nTo fetch data, you can use the browser fetch API and pass the data to the property:\n\nJSCharting has utility functions for converting between JSON and delimiter-separated values such as CSV. You can convert data to chartable series and points with the nest object.\n\nJSCharting charts are optimized for touch screen and mobile devices, with responsive styling and good accessibility compliance.\n\nThe JSCharting Gantt chart demos page includes many examples you use as a starting point. Each demo has vanilla JavaScript source code, and you can use the JSCharting editing UI to change the demo code, as you can see in this complex Gantt chart demo. Some demos show advanced features like critical dependency paths and progress line overlays.\n\nThe JSCharting bundle license includes all 150+ chart types. The bundle costs $995 per developer and includes priority support, upgrades, and new releases for one year. You can buy the Gantt chart separately for $195 for one developer. \n\n\n\nYou can register on the JSCharting website to qualify for a free license for non-commercial use with no time restrictions. A Gantt chart created using the free JSCharting license features a small watermark icon that links to the JSCharting website.\n• The JSCharting touchscreen and mobile device optimization are a plus.\n• The JSCharting bundle includes many other charts that you may want to use.\n• You’ll find many example Gantt charts on the JSCharting demos page.\n• Because a JSCharting chart is an SVG, it’s not easy to customize, for example, changing the date rows of a chart.\n• The JSCharting Gantt is relatively simple and unsuitable for more complex Gantt charts.\n• The documentation for the JSCharting Gantt is not very detailed.\n\nFrappe Gantt is a simple, open-source Gantt chart library. Like JSCharting, Frappe Gantt renders charts with SVG and HTML5.\n\nYou can install the Frappe Gantt library using npm or Yarn. You also need to install SASS as a dependency.\n\nTo get started, create an element and give it an , then initialize a new Gantt object:\n\nThe first argument of the Gantt constructor function is the of the element that will be your Gantt chart. The second argument is the task data. The third argument is a configuration object that determines how the Gantt chart looks and functions.\n\nThe determines the view of the Gantt chart. The possible values are: “Quarter Day”, “Half Day”, “Day”, “Week”, and “Month”.\n\nYou can change using the method. You can also add event listeners or customize the HTML popup that displays when you click on a taskbar. If you want any other functionality, you’ll need to code it yourself.\n• Basic visual configuration options such as “bar_height”, “arrow_curve”, and “language”.\n\nFrappe Gantt offers is open source, free-to-use, and is a good option if you need a very basic Gantt chart.\n• The Frappe Gantt documentation is one short demo page and the GitHub repo readme.\n• Like the JSCharting Gantt chart, the Frappe Gantt chart is not easy to customize (for example, changing the date rows) because it is an SVG.\n• Frappe Gantt has a very simple API that lacks a lot of basic functionality that’s commonly used in Gantt charts, such as adding, editing, or deleting tasks. If you want extra functionality, you’ll have to build it yourself.\n• You can only use vanilla JavaScript with Frappe Gantt.\n\nBelow is a table comparing some of the features of the five Gantt chart libraries:\n\n* Only for the standard library, not the PRO library.\n\nOf the libraries we test drove, Bryntum Gantt has the most features out of the box with considered touches like summary rows and task-dependency management. Bryntum Gantt also has the most appealing UX and visual appearance, with Syncfusion coming in second.\n\nBryntum Gantt and Syncfusion Gantt both have built-in UIs to edit dependencies, but DHTMLX Gantt doesn’t.\n\nIf your budget is limited, the best free, open-source Gantt chart is the standard library version of the DHTMLX Gantt chart. Small start-ups that qualify for the free community license might prefer Syncfusion Gantt, but Syncfusion Gantt is an expensive option if you only need their Gantt chart component. Frappe Gantt is good if you want a simple Gantt chart and aren’t concerned about the UI appearance.\n\nDHTMLX Gantt was quite easy to link up with a backend, as its dataProcessor simplifies CRUD API endpoints, and there’s a single CRUD operation per API request. Bryntum Gantt and Syncfusion Gantt backend integrations use multiple CRUD operations per request, which can help improve performance.\n\nHowever, if you need to build complex Gantt charts or work with large datasets, Bryntum Gantt, DHTMLX Gantt, and Syncfusion Gantt are the most suitable options. Each library offers different features, so you’ll need to consider your requirements and check the features and demo pages of the various Gantt chart libraries to see which is most suitable."
    },
    {
        "link": "https://dhtmlx.com/docs/products/dhtmlxGantt",
        "document": "Overhauled Themes and New Dark Theme, Manually Scheduled Summaries, Built-in Baselines, and More in DHTMLX Gantt 9.0\n\nThousands of projects worldwide are managed with tools based on DHTMLX Gantt.\n\nDHTMLX Gantt enables end-users to allocate multiple resources, like personnel and facilities, to projects and tasks. It also helps to adjust the assignments accurately with the help of various load charts and histograms. It is possible to highlight the minimum duration of an entire project and determine the most vital tasks due to the built-in critical path calculation in DHTMLX Gantt. Moreover, the chart allows displaying the slack time and setting the lag and lead times. The DHTMLX JavaScript Gantt chart library includes automatic scheduling functionality. If an end-user changes the duration of a particular task, the auto-scheduling extension updates all due dates automatically, taking into account task dependencies. It is an indispensable tool for external integration with complex CRM or ERP systems, real-time collaboration with many people working simultaneously on the same timeline, and clientless integrations with calculations based on calendars and links performed on the fly. It is a standalone module that you can install locally to export Gantt charts of any size to PDF and PNG formats without the need to send your data to our server. In addition to PDF and PNG, it provides the ability to convert Gantt projects to iCal and Excel files. You can also deploy an export module for MS Project and Primavera P6 on your server. This module serves to export and import Gantt data to the most popular project management formats securely. The DHTMLX JavaScript Gantt chart supports diverse drag-and-drop operations. End-users can move several tasks, create tasks from scratch, and reorder columns in the grid with the help of drag and drop. Developers can control all the behavior via API. Due to a keyboard navigation mode, end-users are free to manage all tasks right in the grid via inline editing. Keyboard shortcuts allow the creation and update of project tasks and their relations. You can add tooltips to any DHTMLX Gantt elements like tasks, connectors, milestones, or anything else. Tooltips can contain any information you need. You can fully customize their appearance and behavior to meet your requirements.\n\nEven if you are not a JavaScript expert, starting your work with our HTML5 Gantt control is straightforward. You can quickly initialize it with a few lines of code and equip it with the desired features in no time. Guides, demos, and video tutorials have got you covered. Full-featured out of the box DHTMLX Gantt is the most complete JavaScript Gantt chart library for project management. It has all the necessary functionality including different task types, scheduling techniques, and resource management. Besides, it is beautiful out of the box. A rich and flexible API allows you to configure each and every JS Gantt chart element: customize time scale, define grid structure, style task bars, fine-tune editing form, and add any kind of custom HTML content. Robust and flawless performance is the key criterion for large projects with thousands of tasks. You can load any number of tasks to the JavaScript Gantt component and it will render them smoothly due to smart rendering and dynamic loading. DHTMLX Gantt is cross-browser and works in Chrome, Firefox, Safari, IE11, and all Chromium-based browsers (e.g., Microsoft Edge, Opera, Vivaldi). Being pure JS, our Gantt chart is compatible with any front-end and back-end technologies. Download the DHTMLX Gantt trial version and evaluate it free of charge for 30 days benefiting from the official technical support of our team.\n\nThe open source version of DHTMLX Gantt (Standard Edition) is distributed under the GPL v2.0 license. If you have an open-source project licensed under a GPLv2-compatible license and do not need PRO features, you may use DHTMLX Gantt Standard Edition for free. This version does not come with official technical support, but you can access assistance through the community forum."
    },
    {
        "link": "https://stackoverflow.com/questions/15711126/javascript-resource-planning-component-gantt-chart-with-editing-capabilities",
        "document": "I'm looking for a JS-based Resource Planning Component, where i have the available resources on the left and the resource load on the right.\n\nSo far i only found a few gantt chart implementation, which lack add, move and editing capabilitys. I wounder whether such a component exists."
    },
    {
        "link": "https://github.com/frappe/gantt",
        "document": "Gantt charts are bar charts that visually illustrate a project's tasks, schedule, and dependencies. With Frappe Gantt, you can build beautiful, customizable, Gantt charts with ease.\n\nYou can use it anywhere from hobby projects to tracking the goals of your team at the worksplace.\n\nWe needed a Gantt View for ERPNext. Surprisingly, we couldn't find a visually appealing Gantt library that was open source - so we decided to build it. Initially, the design was heavily inspired by Google Gantt and DHTMLX.\n• Customizable Views: customize the timeline based on various time periods - day, hour, or year, you have it. You can also create your own views.\n• Ignore Periods: exclude weekends and other holidays from your tasks' progress calculation.\n• Configure Anything: spacing, edit access, labels, you can control it all. Change both the style and functionality to meet your needs.\n• Multi-lingual Support: suitable for companies with an international base.\n\nInclude it in your HTML:\n\nOr from the CDN:\n\nFrappe Gantt offers a wide range of options to customize your chart.\n\nApart from these ones, two options - and (plural, not singular) - are available. They have \"sub\"-APIs, and thus are listed separately.\n\nThe option determines all the available view modes for the chart. It should be an array of objects.\n\nEach object can have the following properties:\n• (string) - the name of view mode.\n• - the interval of each column\n• (date format string or function) - the format for text in lower header. Blank string for none. The function takes in , , and , and should return a string.\n• (date format string or function) - the format for text in upper header. Blank string for none. The function takes in , , and , and should return a string.\n• (number) - how often the upper text has a value. Utilized in internal calculation to improve performance.\n• (function) - takes in , returns Boolean determining whether the line for that date should be thicker than the others.\n\nThree other options allow you to override general configuration for this view mode alone:\n• For details, see the above table.\n\nis a function. If it returns\n• , there will be no popup.\n• , the popup will be rendered based on manipulation within the function\n• a HTML string, the popup will be that string.\n\nThe function receives one object as an argument, containing:\n• - the task as an object\n• , , (functions) - get the relevant section as a HTML node.\n• , , (functions) - take in the HTML of the relevant section\n• (function) - accepts two parameters, and - respectively determining the HTML of the action and the callback when the action is pressed.\n\nFrappe Gantt exposes a few helpful methods for you to interact with the chart:\n\nIf you want to contribute enhancements or fixes:\n• to build files - or to build and watch for changes.\n• Make your code changes and test them."
    },
    {
        "link": "https://dzone.com/articles/top-gantt-chart-solutions-for-react",
        "document": "React has gained considerable popularity among both web enthusiasts and large enterprises that value high performance and reliable web applications. Currently, there’s no shortage of React components of different levels of complexity. Today, we’d like to shed some light on a specific kind of such tools — React Gantt charts.\n\nTo make this article useful for the broadest possible public, we’ll focus on two types of Gantt charts. First of all, we’ll take a look at lightweight charts that provide basic functionality and can fit small companies. After that, we’ll consider those that offer dozens of features and can be a good choice for large companies. Such management tools are well suited for complex projects and help to ensure that no detail will escape the attention of a project manager.\n\nReact Google Charts is a wrapper that allows you to use a plethora of charts developed by Google. The Gantt Chart is rendered using SVG. The list of available features is pretty basic, but you’ll get everything you need to track the state of a project divided into subtasks. This tool from Google allows displaying task duration along with the start and end dates. Also, you can receive some additional info when you hover over a task. Depending on the chart configuration, this information may include the percentage of completion, duration, and resources. Additionally, the tool helps to define whether a particular task is on a critical path or not.\n\nUsing arrows, you can show dependencies between different tasks. Alternatively, you can use the mode without any dependencies displayed. The grouping feature allows you to group similar tasks together. Critical path is a must-have feature for all modern Gantt charts. Google knows it well and provides you with the possibility to define the tasks that affect the project time the most.\n\nThe style of Google Gantt Charts is adjustable, which allows you to change the appearance of arrows marking dependencies between tasks and tracks. Google Gantt Charts provide you with pretty much everything that you may need to create a lightweight, neat, and good-looking chart. If you plan to build a web application that uses a lot of different charts and keep it lightweight yet full-functional, React Google Charts may be a pretty decent choice.\n\nFrappe Gantt React is a wrapper that allows you to use a Gantt chart from Frappe distributed under the MIT license. It’s a simple and lightweight open-source JavaScript Gantt Chart with features such as drag-and-drop, resizing, dependency creation, and time scales. You can create tasks and drag them across the timeline or resize them to change the duration. By clicking a particular task, you can receive some additional info, such as duration and current progress.\n\nThe available view modes include Quarter Day, Half Day, Full Day, Week, and Month. Event listeners allow you to define how your app will react to the user’s actions. Using custom HTML in popups, you can change the format of the information appearing in tool tips. At the moment, the list of features looks pretty humble. But still, if you do not expect much from a Gantt chart, this minimalist tool will work just fine for you.\n\nAfter the Gantt charts that provide basic functionality, let’s take a look at something that can satisfy the requirements of the most demanding users. DHTMLX Gantt is a full-featured Gantt chart for cross-browser and cross-platform applications. It’s a fully customizable chart, in which a flexible API enables the configuration of each element.\n\nYou can customize everything from taskbars to the grid structure. Using the zooming feature, you can focus on a particular part of a project. You can switch between months, days, and hours. Baselines will be pretty helpful to ensure that you meet your deadlines. You can use them to mark the initial plan for your project and compare it with its current state. The auto-scheduling feature can free you from the need to make all the changes manually and apply the required changes to the schedule automatically. This feature allows updating the start date of the dependent task if the end date of the task depends on changes.\n\nResource allocation enables you to implement advanced management capabilities. Users can allocate resources to tasks and track the workload with the help of resource usage diagrams, histograms, and resource calendars:\n\nThe Critical Path method, which was mentioned earlier, allows significantly simplifying the work on projects. This method enables defining the sequence of tasks that determine the overall duration of the project. If you’re not happy with the amount of information provided by the Gantt chart, you can add some custom content. For example, an S-curve can show the project's progress. Besides the possibility of using this Gantt chart in your React projects, you can also benefit from integration with Vue.js, Angular, jQuery, and such server-side technologies as Laravel, Node.js, ASP.NET, and others.\n\nDHTMLX also provides a separate Gantt chart library written in pure React. It perfectly fits into any React-based application without any dependencies or compatibility obstacles. High performance allows you to conveniently work with thousands of tasks. But the main advantage of this native React Gantt chart is its reactivity, meaning that any changes in the code or UI are instantly displayed in the chart. However, it should be mentioned that this React Gantt chart currently comes only with a standard feature set. Therefore, if you want to apply more advanced features like resource management or auto-scheduling, it will be necessary to take DHTMLX JavaScript Gantt and employ its integration guides.\n\nThe DHTMLX Gantt Chart is constantly evolving, and it’s hard to describe all its features in one article. If you want to learn more about its possibilities, you can visit the homepage of the project or try the demo on GitHub.\n\nLast but not least is React Gantt Chart made by Bryntum, a company that is well known for its high-quality plugins for the Ext JS framework. The scheduling engine is called Chronograph and was built from scratch to provide excellent performance. Asynchronous rescheduling can handle any number of tasks. After moving a task, the resulting changeset is animated into place so users can track how one change affects others more easily.\n\nDevelopers have implemented every feature that you may need for effective project management. Drag-and-drop support allows resizing and creating tasks using the mouse or touch devices. Programmatic validation of editing actions helps to avoid possible errors and ensure the accuracy of the provided information. Customizable tooltips allow using HTML to define which extra details on a specific task will be provided to users.\n\nA built-in customizable context menu helps to implement the functionality required by a specific business. You can filter the available tasks on any condition and change the scale. Critical path calculation is available as well. The use of leads and lags helps to make the project management process flexible. You can create various types of dependencies between tasks (FF/FS/SF/SS).\n\nAll elements can be styled easily using just plain CSS. Row height is customizable and can be changed dynamically, and each timeline element can be rendered with your own custom template. Developers also implemented some server/database integration features that allow you to work with PHP, Java, ASP.NET, and other technologies."
    },
    {
        "link": "https://stackoverflow.com/questions/43154022/gantt-editable-chart-for-reactjs",
        "document": "Closed. This question is seeking recommendations for software libraries, tutorials, tools, books, or other off-site resources. It does not meet This question is seeking recommendations for software libraries, tutorials, tools, books, or other off-site resources. It does not meet Stack Overflow guidelines . It is not currently accepting answers. We don’t allow questions seeking recommendations for software libraries, tutorials, tools, books, or other off-site resources. You can edit the question so it can be answered with facts and citations.\n\nI'm looking for an editable Gantt chart component that can be used in ReactJS. The need is to plot a resource Gantt chart where the user can change tasks on the time axis and also between the resources."
    },
    {
        "link": "https://htmlelements.com/angular/ganttchart",
        "document": "Smart.GanttChart represents a type of bar chart that illustrates a project schedule with dependency links between each individual task and their current status. The chart lists the tasks to be performed on the vertical axis, and time intervals on the horizontal axis. The width of the task bars inside the Timeline shows the duration of each activity. The timeline is devided in multiple cells. Each cell represents a time interval depending on the timeline view. Basically, the Gantt Chart is a project management UI component that provides a Microsoft Project-like user interface to display and work with hierarchical tasks with timeline details. Learn about all gantt chart features here. To get started with the Angular Gantt Chart, see Angular Gantt Chart Docs \n\n \n\n \n\n Bind data easily with various local and remote data sources, such as Array, CSV, TSV, JSON, XML. \n\n Smart.GanttChart's tasks can be edited via the window editor. The editor represents a Window component that appears when the user double clicks on a task or a connection inside the Timeline. The Angular Gantt Chart provides support to create, read, update, and delete (CRUD) operations \n\n The Angular Gantt Chart is responsive and has a device-optimized look and behavior on PCs, tablets and mobile phones. \n\n Smart Gantt Chart's tasks represent real life processes and operations that can be managed. As such they have people or materials assigned to them. GanttChat's Resource Management allows to assign resources to tasks and monitor they workflow. Learn more here \n\n Task Connections describe the relations between the tasks. Each task has an connections attribute that is used to which tasks to connect to. Connections attribute is applicable to all types of tasks. However there are several restrictions when it comes to task connections: \n\n Only one connection can exist between two tasks - if a connection exists between two tasks and the user creates a new one, the previous is deleted.\n\n Looping connections when autoSchedule is enabled are not allowed - when autoSchedule is enabled the tasks are repositioned depending on the connections. Tasks connected in a loop are not allowed becase they can't exist meaningfully inside the timeline.\n\n Connections show which tasks start/end after another. This gives the possibility to automate the planning process. \n\n Smart.GanttChart component allows filtering & sorting of tasks and resources. In order to filter the GanttChart items the user has to use the filter input(s) that are displayed inside the Table header when filtering is enabled. Sorting is enabled by setting the property and the sorting could be by one or multiple columns. \n\n Auto schedule re-calculates the starting dates of all connected tasks and re-schedules them in order to meet the requirements defined by the connections. When autoSchedule is set scheduled tasks have date restrictions in order to assure that a task doesn't start or end on an invalid date. When changing the duration or start/end dates of a task that is connected to another, it's siblings are re-scheduled when the operation is completed.. Export the Angular Gantt Chart data in various file formats such as Excel, PDF, CSV, TSV. Row height can be customized based on the Angular application's requirements. It is also possible to set row height conditionally.. The UI Themes used in the Gantt Chart component follows the Google's Material Design best practises. You can choose from 7 built-in themes available in both Light & Dark modes Users from different locales can format numbers, dates, currency, etc. to suit their language preferences. Each string used in the Gantt Chart can be localized. That happens by using two properties - 'locale' and 'messages'. . Right-to-left rendering changes the rendering of texts, scrolling and columns layout in the Gantt Chart. This improves the UX for RTL languages.\n\nLook how our components can be transformed into modern and eye-catching apps\n• Admin Dashboard Template with contrast between the navigation and content areas. The demo shows Dashboards, Forms, Client Lists, User Profiles and more.\n• Admin Dashboard Template with Bootstrap. The demo shows Dashboards, Forms, Client Lists, User Profiles and more.\n• This project tracker template can collect all your work in one place and gives the ability to create different views of your project management workflow. So all team members, as well as the managers could stay up to date with their individual tasks and also the overal project's status..\n• Doctors Dashboard Template. The Template shows an integration between Grid, Chart, ListBox & Calendar.\n• Admin Dashboard Template with Modern look and feel. The demo shows Dashboards, Forms, Client Lists, User Profiles and more. \n\n\n\n\n\n\n\nWhat customers say about us\n• National Instruments has partnered with JQWidgets Ltd. to bring HTMLElements to NI’s suite of engineering tools and development environments including LabVIEW NXG and SystemLink. Our goal has to bring the ubiquity and accessibility of the web to automated test and measurement applications. To do so we required a partner who could create fully featured controls that met the performance and UI requirements of demanding engineering applications. JQWidgets has built a technology stack with the flexibility to fit into multiple different applications frameworks and visual styles while also providing assurances of the long term sustainability by leverage the latest W3C Custom Element standard.\n• After more than thirty years as a software developer it is always a pleasant surprise to receive such thorough and efficient pre-sales support. Any questions I had were dealt with quickly and courteously and all issues resolved. I have examined the competition and have decided on jQWidgets due to the speed and elegance of the components, clarity and consistency of the API, adherence to standards, regular new feature releases and active support forum."
    },
    {
        "link": "https://telerik.com/kendo-react-ui/gantt-chart",
        "document": "\n• The React Gantt is a UI component that illustrates a project schedule. It allows users to plan, organize and track various tasks. Users can also see how different tasks are related and what task is dependent on other tasks in the project plan. Tasks have a visual bar to indicate their start and end date, how long each task should take to complete, how far along a particular task is, whether the task is on-time or late and much more.\n• With sorting enabled, the React Gantt can reorganize all available tasks to be sorted by a specific data field, such as task start date or task type. Sorting can be enabled via a single configuration option and users can sort by clicking the header of a field. Clicking multiple times allows users to sort the items in an ascending order, descending order or no sort order at all, giving them the option to remove any applied sorting. React developers can also programmatically set sorting and sort order, which means columns can be sorted upon initial render.\n• Thanks to the built-in filtering options of the KendoReact Gantt component, users can quickly reduce the number of tasks displayed at once. Filtering can be done via a dedicated filter menu or by using fields such as text and dates as filters. Additionally, you can configure conditional filters, such as \"starts with\", \"contains\" and more, on a column-by-column basis to give users maximum flexibility to manage their planning.\n• To easily manage the relationships between different tasks, the KendoReact Gantt component provides four different dependency types: the finish to finish type, the finish to start type, the start to start type, and the start to finish type. Using these dependency types, you can ensure that the tasks are properly defined in their Gantt component and users can plan projects in the correct sequence of events.\n• Since the React Gantt component is meant to help manage projects, and no two projects are the same, there may be a need for more granular control over the intervals that tasks are displayed over. Whether tasks are done by the minute or by the day or week, or if the requirements call for shorter or longer slot widths, the duration of these slots and the width can be controlled across the entire KendoReact Gantt.\n• Dates and time are a central part of the KendoReact Gantt component. Whenever time is involved, time zones can significantly complicate matters. With the built-in support for time zones, the React Gantt component makes this complex situation a breeze to deal with. If no specific time zone is set, the KendoReact Gantt component defaults to the local time zone of the browser. If a time zone is set, then the Gantt component will display all tasks according to that time zone.\n• The KendoReact Gantt Chart component provides extensive accessibility support and enables users with disabilities to have complete control over its features. The Gantt Chart component is compliant with the Web Content Accessibility Guidelines (WCAG) 2.1 AA standards and Section 508 requirements. It also follows the Web Accessibility Initiative - Accessible Rich Internet Applications (WAI-ARIA) best practices for implementing the keyboard navigation for its component role, and provides different options for managing its focus. Learn more about the React Gantt Chart Accessibility"
    },
    {
        "link": "https://dev.to/plazarev/18-best-javascript-gantt-chart-components-2d78",
        "document": "In today's era of high technologies, distributed teams, and remote work, it has become essential for organizations to invest in project management applications. Choosing the right features to equip your project management app is crucial for your team's productivity and budget. According to the Capterra user rating data, project planning and scheduling is the key feature of project management software. The best way to make this feature a part of your project is to use a Gantt chart. Gantt charts give you full control over the project workflow and resource allocation.\n\nIn this article, we will consider popular commercial and open-source JavaScript Gantt components that will help you integrate a Gantt chart into your project management app much faster.\n\nFirst, let us look closely at paid-for Gantt options and highlight their main characteristics. Businesses frequently prefer such products since they have rich feature sets, get regular updates and technical support, and can be used with various JavaScript frameworks (React, Angular, Vue.js) and back-end technologies.\n\nDHTMLX Gantt is a mature and developer-friendly JavaScript library for creating Gantt charts of any complexity and with any number of tasks. With this tool at hand, you can easily add a Gantt chart to any web app and equip it with the right features to cover all of your project management needs. High working loads like 30 000+ tasks and the use of advanced features won’t downgrade the DHTMLX Gantt performance due to dynamic loading and smart rendering.\n\nIn basic usage scenarios, you can create projects with different types of tasks (regular and unscheduled), set task dependencies, sort and filter data, add project summaries with rollup tasks, and make changes on the fly with drag-n-drop, keyboard navigation, and inline editing.\n\nIf the achievement of your objectives requires more sophisticated tools, DHTMLX Gantt has a lot to offer to bring your project management experience to a new level. Here you can enjoy numerous powerful features such as automatic scheduling, critical path calculation, flexible time formatting, split tasks, task constraints, multiple charts on one page, and much more.\n\nDHTMLX Gantt is especially good at handling project resources assigned to tasks on a full- or part-time basis. There are two layout views showing resource workload and allocation – resource load diagram and histogram. These views get in sync with the main Gantt chart, and thus it is easy to balance the workload. You can also group tasks by resources, create working calendars for different resources (usually referring to employees), and merge them into one.\n\nThe comprehensive API of this JavaScript component allows you to make any Gantt element look and behave the way you like. You are free to add new timeline items (baselines, deadlines), custom tasks and time scales, and custom content in timeline cells or on top of Gantt. The UI is flexible and personalizable thanks to the availability of 7 predefined skins, including high-contrast ones, localization (32 locales), accessibility support, and RTL mode.\n\nThe DHTMLX team also offers useful add-ons to reinforce Gantt in your web apps. There are standalone export modules for safely exporting your charts to PDF or PNG format and converting Gantt data for use in popular software - MS Project and Primavera. A Node.js server module is indispensable for performing complex operations on the Gantt chart, integrating it with third-party systems, and providing flawless user experience for teams working simultaneously on multiple devices.\n\nOn top of that, DHTMLX Gantt can be easily integrated with other DHTMLX components such as Scheduler, Kanban, and To Do List for building a versatile web solution for your business.\n\nAbundant developer guides and samples allow you to quickly learn the essentials of working with the Gantt chart and make the most of its capabilities.\n\nDHTMLX Gantt has a flexible licensing model, which allows adjusting the license to the size of your development team and your requirements. Thus, it is perfect for companies of any size, from small startups to medium-sized and large corporations.\n\nBryntum Gantt is a lightweight JavaScript version of Bryntum’s Gantt for Ext JS delivered back in 2019. This product has some noteworthy peculiarities related to managing project data (tasks, resources, dependencies, etc.) on the backend and the presentation of this data in the UI.\n\nUnder the hood, it uses an in-house produced scheduling engine based on the company’s other technology called ChronoGraph for working on projects of different scales. The Gantt engine supports automatic scheduling, backward scheduling, task constraints, 4 scheduling modes, calendars (for projects, events, and resources), recurrent and fixed time intervals for calendars.\n\nThe UI part of the Gantt is based on the Bryntum Grid and inherits most of its features such as filtering, sorting, column resizing, and summarizing. The Gantt structure may include multiple, individually scrollable grid sections (on the right of the timeline). For instance, you can create new sections with inactive tasks or resources and then add these items to the project with drag-and-drop. Bryntum Gantt also allows using conflict resolution popups, baselines, labels, time range indicators, and progress lines in the Gantt timeline to make it more informative. There is also a built-in editor with a programmatic validation of any editing actions.\n\nIf necessary, you can override almost any part of the codebase and adjust Gantt elements to your needs. This component is shipped with five built-in customizable themes that allow specifying the general appearance of the Gantt chart.\n\nHaving a rich feature set, Bryntum Gantt has rather expensive licenses. To my mind, this library is suitable for complex projects in large enterprise companies with big budgets.\n\nWebix Gantt is a relatively new JavaScript widget included in the Webix UI Library. When integrated into a web project, this Gantt component allows creating tasks and subtasks, tracking their progress, assessing potential risks, and detecting bottlenecks in projects. The widget supports all the CRUD operations for handling project tasks.\n\nYou can flexibly configure the Gantt in accordance with your project requirements. If the basic feature set does not satisfy the needs of your project, you can add more advanced features. For instance, it is possible to expand the Gantt functionality with complex scales and zooming, marks on scales, division of tasks, critical path calculation, and more. Webix Gantt also provides instruments for working with project resources (Resource view) and tracking their workload (Resource diagram).\n\nThe widget is based on the Webix Jet micro-framework designed to speed up the development of Webix-based apps. With Webix Jet, the Gantt interface is divided into numerous stand-alone Webix components (views). Thus, you can modify, add, or even remove any part of the UI.\n\nDespite being a newcomer on the JavaScript Gantt landscape, this Gantt widget already has a decent feature set. However, there are not many licensing options for buying Webix Gantt without any extra tools.\n\n Useful resources: documentation, samples, blog, GitHub repository, YouTube channel\n\n Trial version: Webix Gantt\n\n Price: from $798\n\nSyncfusion Gantt is one of the numerous JavaScript controls included in the Essential JS 2 library and carries all of its general features. For instance, you can benefit from a modular architecture, touch support, multiple built-in themes, seamless data binding, and other useful things.\n\nAt the same time, this project management tool is equipped with a pack of features that are specifically dedicated to planning, scheduling, and monitoring one or several projects with involved resources within a single Gantt chart. The Gantt interface allows presenting tasks with their dependencies and manipulating them in different timeline modes (hour, week, month, and year). The timeline may have additional details (working days and holidays, baselines, event markers, tooltips, critical path), making it easier to understand and analyze data. There are many options for specifying the behavior of rows and columns in Gantt.\n\nUsing different template options, you can create custom headers, taskbars, cell contents, editors, and other items. Syncfusion Gantt provides two ways to ensure a good user experience with large volumes of data. You can apply the virtual scrolling to load hefty data sets and enable the immutable mode to bring editing changes to life without delays. If needed, the Gantt content can be exported to PDF and Excel formats.\n\nSyncfusion Gantt is a great solution for those who also plan to use other controls from the Essential JS 2 library since it cannot be purchased as a stand-alone tool. Otherwise, it is not the most favorable price offer when compared with other products.\n\nUseful resources: documentation, samples, blog, YouTube channel, GitHub repository\n\n Trial version: Essential JS 2\n\n Price: from $995 (for the full package of Essential JS 2 components)\n\nDlhSoft Gantt Chart Hyper Library is a package of JavaScript scheduling components for building business web applications. As its name suggests, the centerpiece of this product is the GanttChartView component that gives you an opportunity to add interactive JavaScript Gantt charts to your project.\n\nApart from standard Gantt features, this component allows expanding your project management capabilities with auto-scheduling, task splitting, critical path highlighting, and plain resource allocation. There are configuration options for setting the required time scale, zooming level, working and nonworking time, and some other parameters. Custom appearance settings are available for changing the look of the whole chart or individual items shown in the timeline.\n\nWhen loading and displaying a large number of items in the Gantt chart, it will continue working smoothly thanks to the virtualization feature enabled by default. To access the Gantt data offline, you can save it in PDF, Excel, and Microsoft Project XML files. On top of all that, you have an opportunity to create other types of charts (load chart, PERT chart, network diagram) by using Gantt chart elements or by defining data on the fly.\n\nDlhSoft Gantt Chart Hyper Library is not the most remarkable solution in terms of functional capabilities. But it can be purchased separately or in a bundle with other scheduling instruments at reasonable prices.\n\nUseful resources: documentation, samples, GitHub repository\n\n Trial version: DlhSoft Gantt Chart\n\n Price: from $455 (Mini edition with Gantt component only), from $848 (Standard edition with other scheduling components),\n\nAnyGantt is a JavaScript-based tool provided by the AnyChart company for embedding informative Gantt charts into applications. Using this solution, you can create two types of Gantt charts - Project and Resource. The first Gantt type is intended for visualizing scheduled project workflows, while the second one displays operational assets (workers, equipment, etc.) used for achieving certain goals over periods of time. These Gantts depict different timeline items, but at the same time, they have similar settings.\n\nAll elements of Gantt charts based on AnyGantt can be configured in the desired way via visual settings. When exploring the features directly associated with handling project tasks, you’ll find some useful, but common things, namely markers, tooltips, labels, milestones, etc. Anychart also offers a variety of formatting options for text-based elements and flexible settings for date and time formats. The Live Edit mode helps to introduce changes in the Gantt chart on the go.\n\nAnyGantt supports asynchronous rendering for convenient working with data-intensive charts. This Gantt component uses the GraphicsJS library for customizing timeline elements. Using this JavaScript graphics library, you can replace default items with custom ones in project and resource charts. It is possible to export charts to images (SVG, PNG, JPG), PDF or data files (CSV, Excel).\n\nIf you like what you see in AnyGantt at the moment and want to try it in a pre-revenue startup, you can buy the current version of the product just for $49. For all other scenarios, this product is quite expensive. Even if you want to use it in internal apps, you’ll have to pay $799. The enterprise and OEM license prices are available on request, but I can assume that they are even higher.\n\nUseful resources: documentation, samples, YouTube channel\n\n Trial version: AnyGantt\n\n Price: $49 for pre-revenue startups, from $799 for internal apps\n\nThe Kendo UI for jQuery library by Telerik provides a variety of UI components for implementing various functionalities on the client side, including Gantt charts. For displaying all necessary project planning info, the layout of the jQuery Gantt chart consists of two standard sections - GanttList and Timeline.\n\nThe GanttList section is an extended version of Kendo’s TreeList widget that inherits most of its capabilities and shows tasks, resources, owners, dates, and all other important data in a tabular form. If necessary, you can apply extra editing, filtering, expanding/collapsing, and visibility attributes to grid columns.\n\nUsing Gantt templates, it is not a problem to add new types of content in columns (e.g. images of task owners). The Timeline section serves for illustrating tasks with their duration and dependencies on different timescales (day, week, month). End-users can perform various operations on tasks such as rescheduling, deleting, editing, or changing dependencies between tasks.\n\nBeing a part of the Kendo UI for jQuery library, this jQuery Gantt supports all of its basic features. You can take advantage of customizable stock themes, DataSource library, exporting to PDF and Excel, and accessibility features.\n\nAll in all, I consider this Gantt component a decent investment only for building project management apps based on the Kendo UI library.\n\nUseful resources: documentation, samples, \n\n Trial version: Kendo UI for jQuery\n\n Price: from $899 (for the full package of Kendo UI components)\n\nThe Visual Scheduling Widget (VSW) is a jQuery Gantt component developed by Netronic to facilitate the integration of a multifunctional scheduling chart into enterprise applications. The user interface of this widget seems a bit old-fashioned and cumbersome, but still, there is an extensive function package for managing complex projects.\n\nA timescale is an essential part of any Gantt chart that should be flexible and easy to use, therefore the VSW widget allows changing this parameter dynamically. Resource management is another important feature of modern Gantt charts and VSW gives the possibility to detect resource capacity conflicts by embedding a histogram right in chart rows.\n\nWhen complex projects are split into smaller and more manageable subprojects, VSW will continue visualizing dependencies in a clear manner. Much of multi-level hierarchical data may be confusing for users, therefore VSW provides built-in animations for clarifying what’s happening on the screen. All unscheduled tasks and unassigned resources can be put together in the additional table (backlog) and simply dragged into the Gantt chart when needed.\n\nThe Visual Scheduling Widget (VSW) offers a great variety of possibilities for managing projects of any complexity via Gantt charts, but it may seem overpriced even for well-funded teams.\n\nDayPilot Pro for JavaScript is a JavaScript library comprising scheduling web components for business-oriented solutions. And as you probably guessed, it includes the Gantt component for visualizing different project management scenarios.\n\nDayPilot Gantt allows implementing essential features required for planning and managing project tasks: task types (regular, milestones, task groups), progress bars, bubble tooltips, context menus, etc. The Gantt component is fully customizable, thus you’ll be able to fine-tune Gantt elements to your liking. It also supports full CSS styling. The Gantt chart performance is optimized to process large data sets with the progressive rendering of rows, tasks, and cells during scrolling. If needed, Gantt charts can be saved as images in SVG, PNG, and JPEG formats.\n\nDayPilot offers two useful auxiliary tools for working with the library’s components. The CSS Theme Designer helps to build CSS themes for Gantt and other DayPilot components using the online WYSIWYG editor. The UI builder is used to quickly configure the Gantt UI and generate a downloadable project.\n\nThe Gantt component from DayPilot includes common features required for conveniently scheduling your projects. But I think that it can be a good option only if you need other project management tools included in the DayPilot Pro for JavaScript library (Scheduler, Event Calendar, and Monthly Calendar). The cheapest license option includes only 6 months maintenance subscription and it is not renewable.\n\nUseful resources: documentation, samples, tutorials, DayPilot knowledge base\n\n Trial version: DayPilot Pro for JavaScript\n\n Price: from $549 (for the full package of DayPilot components)\n\nDevExtreme Gantt is one of the latest additions to the collection of enterprise-specific UI widgets developed by DevExpress for building standard web and mobile apps. But it already has a standard set of features for managing project task flows and their dependencies over a certain period of time.\n\nThe DevExtreme Gantt component gives the possibility to avoid issues in task dependencies by defining your own validation rules. Filtering, sorting, and zooming features simplify the work with large Gantt charts. You can also display tasks in different time intervals (from hours to years) and highlight particular time spans in the timeline with strip lines. Moreover, it already allows making resource assignments. You are able to export the Gantt content to a PDF document.\n\nThis JavaScript widget also provides multiple customization capabilities. For example, you can play around with the general chart appearance (via settings or customizable themes), use templates for changing individual tasks, add custom controls to the toolbar, and adjust context menus.\n\nDevExtreme Gantt is a new product that currently lacks many useful features. So I would not hurry to spend money on it but rather give it time to become more mature (unless you are interested in other DevExtreme components as well).\n\nUseful resources: documentation, samples, blog, YouTube channel\n\n Trial version: DevExtreme\n\n Price: from $499 (for the full package of DevExtreme widgets)\n\nHighcharts Gantt is a JavaScript library built by Highsoft on top of the company’s popular charting library named HighchartsJS and in close collaboration with clients.\n\nIn Highcharts Gantt, many commonly used features such as task dependencies, milestones, progress indicators, etc. are available by default. When dealing with big tasks, it is possible to split them into smaller subtasks and group resources and manipulate items in the timeline with simple drag-and-drop actions.\n\nThis Gantt component displays well on devices of any size and supports navigation with touch gestures, a mouse, and a keyboard.\n\nWhen choosing Highcharts Gantt for your next project, you can benefit from the core features offered in all Highcharts products. Using the Highcharts export module, you can export charts to PNG, JPG, PDF, and SVG formats at the touch of a single button or print your Gantt chart right from the page. The WebGL-powered boost module will help to render big data. The Highcharts Debugger is one more instrument that will help to detect errors in your code and accelerate the development process.\n\nHighcharts Gant goes as an additional product to the HighchartsJS charting library, which is included in all license types. Taking into account this fact and current prices, this Gantt can be a viable option in projects where other types of charts from HighchartsJS are also necessary.\n\nUseful resources: documentation, samples, tutorials, YouTube channel, GitHub repository\n\n Trial version: HighCharts Gantt\n\n Price: for internal use - from $182 (annual license), from $420 (perpetual license), prices for OEM license are available on request\n\nFusionCharts is a well-known brand in the field of data visualization. Its flagship product FusionCharts Suite includes a wide variety of simple and complex charts. It also addresses the issue of creating a basic Gantt chart on the web page with the corresponding widget included in the FusionWidgets XT pack.\n\nThe Gantt widget does not support sophisticated features such as critical path calculation or auto-scheduling. But it still offers some useful things to help teams visually plan and track projects. The Gantt structure may include any number of additional columns for displaying extra parameters such as project resources. You can complement your Gantt chart with milestones, progress indicators for each task, trendlines to highlight specific dates ( \"Today\", \"Holiday\",etc.), tooltips, annotations, legends, and more. It is possible to ensure a consistent look of your chart using predefined themes and customize them if needed.\n\nThere are also other customization opportunities for this Gantt widget. The main Gantt elements (grid table, cells, dependency links, date formats) and additional timeline items (tooltips, milestones, legends, labels) can be adjusted to your requirements. The exporting feature will help to save your Gantt projects in JPG, PNG, SVG, and PDF formats.\n\nThis Gantt chart may be a nice option if you are building a dashboard displaying project data in a variety of ways. However, it lacks the major Gantt features necessary for full-fledged project management apps.\n\nUseful resources: documentation, samples, YouTube channel, GitHub repository\n\n Trial version: FusionCharts Suite \n\n Price: from $499 (annual), from $1,299 (perpetual) (prices are indicated for the full package of FusionCharts widgets)\n\nJSCharting is a JavaScript library that offers a way to add different types of charts to a web application, plus Gantt charts (JSGantt).\n\nThe Gantt chart interface may include some common elements for working with tasks as well as more advanced capabilities. For example, it is possible to calculate a critical path, apply auto-scheduling, add task completion indicators, etc. JSGantt is rendered with SVG and HTML5 in all major browsers. All project data can be loaded in the chart from JSON or the user’s database. Simple JavaScript settings allow configuring your Gantt chart as needed.\n\nYou can also count on a variety of general features available for all chart types included in JSCharting. The library is touch and mobile optimized, complies with the main accessibility standards, provides an official export server, supports various globalization and internationalization features, advanced visuals, etc.\n\nJust like with Fusioncharts, this Gantt is too basic to purchase it for a complex project management solution. But it can be a fine choice if you are looking for a collection of charts, where Gantt is just one of the data visualization options you need.\n\nUseful resources: documentation, samples, \n\n Trial version: JSCharting (+JSGantt)\n\n Price: from $995 (for the full package of JSCharting components)\n\nThe gantt-schedule-timeline-calendar (GSTC) is a JavaScript component that can be used in business apps as a universal planning solution. It brings together four tools commonly used in companies all over the world for arranging their day-to-day activities. At the moment, we are primarily interested in the Gantt part of this product.\n\nThe Gantt interface can contain movable and resizable items, collapsible and expandable groups of tasks, multiple items in one row, sortable and searchable list columns, etc. One of the main strengths of GSTC is its elasticity i.e. almost any part of the component from the DOM tree to logic can be adjusted to your requirements with config, state, and custom plugins. It is also not a problem to add any third-party libraries. The HTML Gantt content is modifiable via templates and slots. The use of BEM-based CSS rules makes it easier to change the appearance of your Gantt chart. Moreover, the component is mobile-ready and should perform well with large datasets.\n\nGSTC may not include some advanced features, but it is a four-in-one tool that can also be extended with custom plugins. Thus, GSTC may be a noteworthy instrument for building multi-faceted project management apps.\n\nIf you work on a non-commercial project with a limited budget, one of the following open source Gantts may suit you.\n\nGoogle Charts is a popular data visualization service with a rich selection of data visualization types, and a Gantt chart is one of them. The arsenal of functional capabilities for this chart type is not very diverse, but it provides everything you need for tackling common project management tasks. The Google Charts API comes with a range of configuration options, methods, and events for organizing your Gantt chart in the desired way. Charts are rendered in the browser using SVG technology.\n\nYou can set and edit the main parameters related to the timeframe of project tasks (start/end/duration). If any of these values are not specified by a user, they will be calculated automatically. The Gantt timeline can be displayed with or without dependency arrows. The Gantt chart built with Google displays relevant data on each task via tooltips. Depending on the Gantt configuration, the tooltip content may include the task timing, completion status (in %), project resources, and the presence of a given task on a critical path. Tasks dedicated to a particular area of the project can be combined into groups with resources. Styling settings allow depicting Gantt elements (tracks, dependency lines, critical path) in different colors.\n\nFrappe Gantt is an open source JavaScript library that serves for incorporating simple, interactive Gantt charts into web projects. From the standpoint of functionality, this free-to-use tool does not provide anything fancy, but it still supports some basic features for accurate planning and handling of projects.\n\nIt allows users to create tasks, change their schedule and duration with drag-and-drop, add dependency lines, and review extra information on tasks via tooltips. You can add multiple timescales to the chart. The list of possible options includes Quarter Day, Half Day, Full Day, Week, and Month. There are also some customization opportunities such as changing the tooltip content with custom HTML, modifying the appearance of task bars and dependency lines, and setting the default timescale. It should be noted that Frappe Gantt has two dependencies: momentjs and snapsvg.\n\nTwproject Gantt is an online JavaScript Gantt chart editor engineered by Open Lab as a stand-alone part of a more complex solution (Twproject) for visually planning and tracking projects. Based on jQuery, this tool helps to create an informative Gantt chart with the indication of core parameters such as assignments, dependencies between them, statuses of tasks, and milestones that can be edited at any moment.\n\nAt a more advanced level, the editor allows calculating a critical path to avoid bottlenecks and take care of project resources to ensure their balanced allocation. You can also use progress lines to see whether tasks are behind or right on schedule and compare the current state of the project with the initial plan using baselines. The print option allows saving the current Gantt project in PDF format. This product can be a good choice for those who have some prior experience with MS-Project.\n\nMermaidJS is a JavaScript library for dynamically generating popular types of charts and diagrams such as flowcharts, UML diagrams, pie charts, and of course, Gantt charts. When implementing a Gantt chart with Mermaid, you can set the margins for rendering the chart, split its structure into different sections, and define a date format. It supports common features required for managing tasks such as milestones, dependency lines, non-working days, \"today\" markers, etc. You can also leave comments within your Gantt chart - and the parser will ignore them.\n\n\n\n The Gantt appearance is modified by using customizable themes and defining a number of CSS classes. There are 3 rendering options for your Gantt chart: SVG, PNG, or a Markdown link that can be inserted into docs. Even people without any coding background can create a Gantt chart and other diagrams using the Mermaid Live Editor. Interestingly, GitHub added native support for Mermaid in order to help developers quickly generate diagrams in their open source projects.\n\nAs you can see, there are plenty of commercial as well as open source JavaScript Gantt libraries. And now the hardest part - choosing the right tool for your project. I just provided general information on the functional capabilities of Gantts available out there. What to do next? You should certainly get acquainted with the technical part of all products by using useful resources added for each of them. While pricing and licensing may not be the ultimate driver in your decision, these are still important factors to consider and I shared my thoughts on this matter for each commercial Gantt. And, of course, you cannot make the final decision without practical testing of tools that seem appealing to you."
    }
]