[
    {
        "link": "http://nknabe.dk/database/documents/PDox%20Survival%20Guide.pdf",
        "document": ""
    },
    {
        "link": "https://sheepdogguides.com/dt3e.htm",
        "document": "There's a search button at the bottom of the page.\n\nPlease don't dismiss it because it isn't full of graphics, scripts, cookies, etc!\n\nThis tutorial was first written a long time ago. Since then, I have become a happy user of the excellent free database that is part of the free office suite \"Open Office\". Did I mention it is free? Don't dismiss it as being worth what you pay for it until you've tried it. You can even export things to formats accessible by those still in Microsofts' thrall.\n\nHaving caught your database, begin the Delphi program....\n\nAd from page's editor: Yes.. I do enjoy compiling these things for you. I hope they are helpful. However... this doesn't pay my bills!!! Sheepdog Software (tm) is supposed to help do that, so if you found this stuff useful, (and you run a Windows or MS-DOS PC) please visit my freeware and shareware page, download something, and circulate it for me? Links on your page to this page would also be appreciated!\n\nPage WILL BE tested for compliance with INDUSTRY (not MS-only) standards, using the free, publicly accessible validator at validator.w3.org"
    },
    {
        "link": "https://give.globaluniversity.edu/58421789/lcampaignsy/zneedsc/bcarrysh/delphi+database+developer+guide.pdf",
        "document": ""
    },
    {
        "link": "https://stackoverflow.com/questions/4366988/problem-with-insert-query-to-paradox-table-using-c-sharp",
        "document": "I have Paradox 5.x tables I need to connect to in order to select and update. I am using OLEDBConnection.\n\nselecting from the tables I have no problem. while trying to insert into the tables I met a problem when I entered hardcoded the fields names I got an error: The INSERT INTO statement contains the following unknown field name: ... so I used OleDbDataReader.GetName(...) to get fields names. now I use the fields names received from table in order to insert into table and I still get the same error.\n\nI think the problem is with the field name: 'Truck #1 Serial Number' Table name: 'Vehicles'\n\nI tried using [], .\"\", .[] and .[\"\"].\n\nI have read about the need of Borland engine but I'm not sure this is the issue. Thanks upfront.\n\np.s I cannot change name of tables since its a customer DB I need to connect.\n\nIm adding the C# code I use:\n\nEDIT: Just wanted to add my solution at end: At the end the best solution I could get was to use accesses as the connection point using linked tables to the paradox tables, at end handling it as an accesses DB..... Hope it helps someone."
    },
    {
        "link": "https://theswissbay.ch/pdf/Gentoomen%20Library/Programming/Delphi/Delphi/Delphi%20-%20Database%20Application%20Developer%27s%20Book%20-%20Delphi%20for%20Windows.pdf",
        "document": ""
    },
    {
        "link": "https://stackoverflow.com/questions/9596749/paradox-database-with-bde-forcing-changes-to-disk-while-database-table-open",
        "document": "We have a Paradox Database table that we want to mirror across the network using something like DSynchronize.\n\nThe issue that I am seeing is that Paradox through the BDE (Borland Database Engine) does not update the file system until the table is either closed, or some buffer its using gets full.\n\nI have used a flush buffers call, which has no affect on the files on disk. Calling close on the table forces the update I am looking for, however is a very large sledge hammer to this issue.\n\nAm I simply missing some BDE setting somewhere?\n\nLastly sharing this database over the network using the correct NetDir settings makes the change visible to another machine. The files still appear untouched. The two systems only have the NetDir folder and Data Folder shared. I simply don't understand how the changes can be getting across without the files being altered, which they don't appear to be.\n\nAny tips would be very much appreciated."
    },
    {
        "link": "https://stackoverflow.com/questions/11336183/paradox-to-delphi",
        "document": "I have a legacy Paradox application that has been running successfully for almost 20 years using the Borland Database Engine. Data is entered into the main program by many different order takers, who then daily put the data onto a memory stick for use by laptops in many service trucks, which also use Paradox.\n\nI just finished rewriting the used-to-be Paradox program that runs on the laptops, using Delphi XE2 Professional and TClientDataSet (briefcase model).\n\nNow I need to upgrade the main application to a client-server model, using a Firebird server. The question is, what is the best approach, since I don't have the Enterprise Edition. I see quite a few different 3rd party tools available, or would the tools provided in the Professional Edition be sufficient?"
    },
    {
        "link": "http://nknabe.dk/database/bde32help/bdeprogrammingindelphi.htm",
        "document": "This step-by-step demonstration of Borland Database Engine (BDE) programming in Delphi uses BDE API functions to retrieve a field value from a table. Most of the time, use of BDE API functions in Delphi applications will be limited to a call to a single function. For instance, an application might call the DbiPackTable function to pack a dBASE table and use no other BDE API functions. In Delphi, data access using the BDE is encapsulated in the objects of the Visual Component Library (VCL). Using the VCL, the Delphi database programmer may never need to make direct calls to BDE API functions. The purpose of this demonstration is to impart an understanding of the BDE by writing programs using direct calls to these API functions.\n\nThe BDE code is contained in a single procedure. This procedure initializes the BDE, opens a database, opens a table, retrieves a record, extracts a single field value, closes the table and database, and exits the BDE. The procedure also displays the retrieved field value in the Caption property of a TLabel. This demonstration uses the sample Paradox table Customer.db, in the DBDEMOS alias.\n\nThe topics below describe the various aspects of the BDE program.\n•Project setup This section covers the preparation of the Delphi project for using this example routine.\n•Basic procedure An overview of the basic steps required to create a simple application that retrieves a field from a table. From each step you can jump to a detailed description of the BDE API functoion (with code examples) or to the sample template program.\n•Template program A sample BDE program structure you can use as a convenient template for creating your own applications."
    },
    {
        "link": "https://supportcenter.devexpress.com/ticket/details/q309905/how-to-setup-a-paradox-connection-with-or-without-bde",
        "document": "You have yet to view any tickets.\n\nYour search criteria do not match any tickets.\n\nA server error occurred while processing your request. Please try again at a later time."
    },
    {
        "link": "https://en.delphipraxis.net/topic/6129-which-version-bde",
        "document": "I am using Delphi 7 and BDE to make program, but have now trouble to get the program I make to work on windows 10. So I wounder, which version is the latest to upgrade to and still using BDE??\n\nYou can still get the depricated BDE with the 11.0. \" but have now trouble to get the program I make to work on windows 10.\" - you need to work out if your problem is related to Delphi 7 issues or to the database interface using BDE. If it is just the Delphi 7 holding you back then in theory you can solve it by using 11.0 and continue using the BDE. But you are on a road to problems. I would suggest change your interface to FireDAC and never look back ......\n\nIs it easy to convert from Delphi7 with BDE to the nevest Delphi/Embarcadero version with FireDAC, or must I rewrite all my code?? FireDAC was written to be replacement for the BDE and there is a script that converts the properties. It really depends the database and methods from BDE you are using in your code. Unfortunately if you're using persistent fields you will have to recreate them as most probably FD will require another class.\n\nYou mean DBD32.Exe and the 2 errors about directories? Well, I don't use, it but you have to know some clues The location of the BDE \"Working\" and \"Private\" directories are stored in HKEY_CURRENT_USER\\Software\\Borland\\DBD\\7.0\\Configuration\\WorkDir and HKEY_CURRENT_USER\\Software\\Borland\\DBD\\7.0\\Configuration\\PrivDir respectively. Each directory default value stores the data containing So my first suggestion is to check this. Other solution is to install D7 with the same hints as BDE (but you will get some trouble with coexistence, I ran into during a demo, TClientDataset) and use the DBD32.exe of this version. But, I have a doubt, if you need this old program, did you mean that you still use Paradox/DBase tables?"
    }
]