[
    {
        "link": "https://support.microsoft.com/en-us/office/create-workbook-links-c98d1803-dd75-4668-ac6a-d7cca2a9b95f",
        "document": "You can reference cells or a defined name in another workbook or the same workbook. Understand the difference between a source and destination workbook The workbook that contains the links is called the destination workbook, and the workbook that it's linked to is called the source workbook. You can link multiple source workbooks to a single destination workbook.\n• The destination workbook contains the workbook link.\n• The workbook link refers to a cell or range in a source workbook.\n• The source workbook has the values returned to the destination workbook. Create a workbook link between cells in different workbooks\n• Open the destination workbook that will contain the external reference and the source destination workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• If you want to use a function, such as SUM, then type the function name followed by an opening parenthesis. For example, =SUM(.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or cells that you want to link to and press Enter. Note: If you select multiple cells, like =[SourceWorkbook.xlsx]Sheet1!$A$1:$A$10, and have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel will return you to the destination workbook and display the values from the source workbook.\n• Note that Excel will return the link with absolute references, so if you want to copy the formula to other cells, you'll need to remove the dollar ($) signs: If you close the source workbook, Excel will automatically append the file path to the formula:\n• Open the destination workbook that will contain the workbook link and the source workbook that contains the data that you want to link to.\n• In the source workbook, select the cell or cells you want to link.\n• Press Ctrl+C or go to Home > Clipboard > Copy.\n• Switch to the destination workbook, and then click the worksheet where you want the linked data to be placed.\n• Select the cell where you want to place the linked data, and select Home > Clipboard > Paste > Paste Link.\n• Excel returns the data you copied from the source workbook. If you change it, it will automatically change in the destination workbook. Create a workbook link to a defined name in another workbook\n• Open the destination workbook that will contain the external reference and the source workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Press F3, select the name that you want to link to and press Enter. Note: If the named range references multiple cells, and you have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel will return you to the destination workbook and display the values from the named range in the source workbook. Define a name that contains a workbook link to cells in another workbook\n• Open the destination workbook and the source workbook.\n• In the destination workbook, select Formulas > Defined Names > Define Name.\n• In the New Name dialog box, in the Name box, type a name for the range.\n• In the Refers to box, delete the contents, and then keep the cursor in the box. If you want the name to use a function, enter the function name, and then position the cursor where you want the external reference. For example, type =SUM(), and then position the cursor between the parentheses.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or range of cells that you want to link, and click OK. What a workbook link to another workbook looks like There are different ways Formulas with workbook links are displayed. When the source workbook is open, the workbook link in the destination workbook includes the workbook name in square brackets ([ ]), followed by the worksheet name, an exclamation point (!), and the cells that the formula depends on. For example: When the source workbook is not open, the workbook link in the destination workbook includes the entire path. For example: Note: If the name of the other worksheet or workbook contains spaces or non-alphabetical characters, you must enclose the name (or the path) within single quotation marks as in the example above. Excel will automatically add these for you when you select the source range. Formulas that link to a defined name in another workbook use the workbook name followed by an exclamation point (!) and the defined name. For example:\n\nWhen you create a workbook link, both workbooks must be saved in an online location you can reach with your Microsoft 365 account. Important: Workbook links are considered potentially unsafe and must be enabled when you open a formula workbook. When you open a formula workbook, click Enable Content in the Message Bar to allow the workbook links to function. If you don't, Excel keeps the most recent values and disables refreshing the links with values from the data workbook. Create a workbook link between cells in different workbooks\n• Open the destination workbook that will contain the external reference and the source destination workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• If you want to use a function, such as SUM, then type the function name followed by an opening parenthesis. For example, =SUM(.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or cells that you want to link to and press Enter. Note: If you select multiple cells, like =[SourceWorkbook.xlsx]Sheet1!$A$1:$A$10, and have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel saves the formula in the destination workbook but cannot change the tab back to the destination workbook.\n• Note that Excel will return the link with absolute references, so if you want to copy the formula to other cells, you'll need to remove the dollar ($) signs. Full cloud file path is used in the URL:\n• Open the destination workbook that will contain the workbook link and the source workbook that contains the data that you want to link to.\n• In the source workbook, select the cell or cells you want to link.\n• Press Ctrl+C or go to Home > Clipboard > Copy.\n• Switch to the destination workbook, and then click the worksheet where you want the linked data to be placed.\n• Select the cell where you want to place the linked data, and select Home > Clipboard > Paste > Paste Link.\n• Excel returns the data you copied from the source workbook. If you change it, it will automatically change in the destination workbook when you refresh your browser window."
    },
    {
        "link": "https://reddit.com/r/excel/comments/f3a3hj/best_practices_for_working_together_in_one_excel",
        "document": "5-10 users need to work together in an excel file found in Teams - they all have access to it/ has been shared etc\n\nAny best practices ? for example one user just got booted out and it said save a copy or discard changes when someone else made a change.. not sure why this happened.\n\nOr any best practices with filters? e.g. seems can only have one user apply a filter on it. Any other recommendations to make everyones life easier with co-authoring?"
    },
    {
        "link": "https://support.microsoft.com/en-us/office/manage-workbook-links-fcbf4576-3aab-4029-ba25-54313a532ff1",
        "document": "Here's how to ensure that you are retrieving the latest values from your source workbooks.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Refresh all at the top of the pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select the workbook from the list and select Refresh. Note: Desktop workbooks don't have the Refresh Automatically command because this operation normally occurs with automatic recalculation when opening the workbook. For more information, see Change formula recalculation, iteration, or precision in Excel.\n\n You can decide whether the links in this workbook are refreshed when opening the file according to the user's setting, not refreshed when opening the file, or refreshed automatically without prompting the user. This option affects all users of the workbook. If you choose not to refresh links, and not to prompt, users of the workbook will not know that the data is out of date.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select and expand Refresh settings at the top right corner of the pane and select one of the following:\n• Ask to refresh Asks the user to refresh or not when the workbook opens.\n• Always refresh Automatically refreshes all links when the workbook opens.\n• Don't refresh Doesn't refresh on open and doesn't ask the user. When you open a destination workbook, and the source workbook is not open, you may be alerted by the Trust Bar to update the links. You can control whether the Trust Bar alerts you, and whether to update all links when the alert does not appear. You can also choose to update only certain links if the workbook contains more than one. Manually update all or none of the workbook links\n• Close all source workbooks. If one source workbook is open, and others are closed, the updates will not be uniform.\n• In the Unsafe links warning dialog, select Update. This updates all the data links in the workbook. If you only want to update specific links, select Don't Update, and see Change the source workbook below. When you get a Security Warning bar opening a workbook If you get a Security Warning bar when you first open a workbook, it means the workbook is not yet trusted. To trust the workbook:\n• Select Enable Content. This makes the workbook trusted for this session, and updates the links.\n• If you get a dialog asking to make it a trusted document, select Yes to avoid the Security Warning bar in the future. If you select No, you'll get the Security Warning bar the next time you open the workbook. Note: Depending on your settings, you may also see the Unsafe links warning dialog. Sometimes, you need to change the source workbook, a workbook link breaks, or you may no longer need the workbook link. You may want to examine and inspect the source workbook first, before making significant changes.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Open workbook. To change the source workbook for all references within the destination workbook:\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, under Recent, select the new source workbook. Or select Browse, and from the dialog box, open the new source file. To change the source workbook for a particular reference within the destination workbook:\n• Find the workbook that you want to use as the new source for the external reference and note its location.\n• In the destination workbook, select the cell with the external reference that you want to change.\n• In the formula bar, look for a reference to another workbook, such as C:\\Reports\\[Budget.xlsx], and replace that reference with the location of the new source workbook.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the data workbook with links you want to fix, then select Change source.\n• In the Change Source dialog box, browse to the location of the file containing the linked data.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Break links.\n• When you break a link to the source workbook of an workbook link, all formulas that use the value in the source workbook are converted to their current values. For example, if you break the link to the workbook link =SUM([Budget.xls]Annual!C10:C25), the SUM formula is replaced by the calculated value—whatever that may be. Also, because this action cannot be undone, you may want to save a version of the destination workbook as a backup.\n• If you use an external data range, a parameter in the query may be using data from another workbook. You may want to check for and remove any of these type of links.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Break all at the top of the pane. There is no automatic way to find all workbook links in a workbook. You need to look differently in formulas, defined names, objects (like text boxes or shapes), chart titles, and chart data series. There may be several workbook links in a workbook. Here's how to locate the one you want.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select the workbook from the list and select Find next.\n• Press Ctrl+F to launch the Find and Replace dialog.\n• In the Find what box, enter .xl.\n• In the Within box, click Workbook.\n• In the Look in box, click Formulas.\n• In the list box that is displayed, look in the Formula column for formulas that contain .xl. In this case, Excel found multiple instances of Budget Master.xlsx.\n• To select the cell with a workbook link, click the cell address link for that row in the list box. Tip: Click any column header to sort the column, and group all of the workbook links together.\n• On the Formulas tab, in the Defined Names group, click Name Manager.\n• Check each entry in the list and look in the Refers To column for workbook links. Workbook links contain a reference to another workbook, such as [Budget.xlsx].\n• Click any column header to sort the column, and group all of the workbook links together.\n• You can group multiple items with the Shift or Ctrl keys and Left-click if you want to delete multiple items at once. Find workbook links used in objects, text boxes, or shapes\n• Press Ctrl+G, the shortcut for the Go To dialog, then click Special > Objects > OK. This will select all objects on the active worksheet.\n• Press the Tab key to move between each of the selected objects, and then look in the formula bar for a reference to another workbook, such as [Budget.xlsx].\n• Click the chart title on the chart that you want to check.\n• In the formula bar , look for a reference to another workbook, such as [Budget.xls].\n• Select the chart that you want to check.\n• On the Layout tab, in the Current Selection group, click the arrow next to the Chart Elements box, and then click the data series that you want to check.\n• In the formula bar , look for a reference to another workbook, such as [Budget.xls] in the SERIES function. The legacy Edit Links command is replaced by the Workbook Links command. However, you can get the old Edit Links command back by adding the legacy Edit Links command to your custom group in the ribbon. You can't add the Edit Links command to the Queries and Connections group. Using Customize the Ribbon, you need to create your custom group and only then you can add Edit Links to your custom group in ribbon as follows:\n• Right-click the ribbon and select Customize the Ribbon.\n• In the Choose commands from drop-down, select All Commands.\n• Click New Group and then select Add. Edit Links is added to your customized group. You can also add Edit Links to the Quick Access Toolbar. For more information, see Customize the Quick Access Toolbar. The Edit Links command is dimmed if your workbook does not contain workbook links. When you open the Edit Links dialog box, you're presented with several options for dealing with existing links. You can select individual workbooks with Ctrl+click, or all of them with Ctrl+A. This will update all selected workbooks. This option is useful when you want to point existing links to another source. For instance, you might have a prior year workbook, and need to point to a new workbook when a new year starts. Selecting Change source will launch a file explorer dialog box, where you can browse to the new source workbook. If the workbook has more than one worksheet, you will be prompted to specify which one to link to - just click the sheet you want and click OK. Note: It is possible to point a workbook back to itself by selecting it from the Change source dialog. This will sever any formula links to the originally linked source workbook. This will open the source workbook. Important: When you break a link to a source, all formulas that use the source are converted to their current value. For example, the link =SUM([Budget.xlsx]Annual!C10:C25) would be converted to the sum of the values in the source workbook. Because this action cannot be undone, you may want to save a version of the file first.\n• In the Edit Links dialog box, in the Source list, click the link that you want to break. You can select individual workbooks with Ctrl+click, or all of them with Ctrl+A.\n• If the link used a defined name, you may also want to delete the name. To delete a name:\n• On the Formulas tab, in the Defined Names group, click Name Manager.\n• In the Name column, click the name that you want to delete, and then click Delete. Note: If you use an external data range, a parameter of a query may also use data from another workbook. You may want to check for and remove any of these types of links.​​​​​​​ This simply displays a notification in the Edit Links pane whether a linked workbook is still a valid source. It should display OK, but if it doesn't then you'll need to check on the source workbook. In many cases, a source workbook may have been moved or deleted, cutting the link. If the workbook still exists, you can use the Change Source option to relink the workbook. Why do I see new links in my workbook? Previous versions of Excel hide the links in names that are not currently in use in the workbook. The links have always existed and are no longer hidden. To remove the link, select Break Links for the selected workbook in the Workbook Links pane. Can I replace a single formula with its calculated value? Yes. When you replace a formula with its value, Excel permanently removes the formula. If you accidentally replace a formula with a value and you want to restore the formula, select Home and choose Undo or press Ctrl+Z immediately after you enter or paste the value.\n• Press Ctrl+C to copy the cell with the formula.\n• Press Alt+E+S+V to paste the formula as its value, or select Home > Clipboard > Paste > Paste Values. What if I'm not connected to the source? Select Don't Update in the Unsafe links warning dialog. Excel cannot update from a source that is not connected. For example, the source may be on a network, and you may not be connected to that network. What if I don't want my current data replaced with new data? How can I update without it taking so long? Select Don't Update in the Unsafe links warning dialog. If the data does not need to be the most current, you can save time by not updating all of the links. After opening the workbook, go to the Data tab and select Workbook Links in the Queries & Connections group, and then update the links only from the sources that you need. How can I not see this prompt after someone else created the workbook? Select Don't Update in the Unsafe links warning dialog and contact workbook's owner. You can also investigate which links are in the workbook. On the Data tab, in the Queries & Connections group, select Workbook Links. How can I not see the prompt again if I prompt the same way every time? You can select and expand Refresh settings at the top right corner of the Workbook Links pane and select in a consistent way and avoid seeing the startup prompt for this workbook. How do I not prompt for all workbooks I open, and update the links automatically? This option affects every workbook opened on the computer. Users who open the workbook on another computer are not affected.\n• On the File tab, select Options and choose Advanced.\n• In the General section, clear Ask to update automatic links. When this check box is cleared, the links are automatically updated, and no alert is displayed. How do I prompt in the same way for every user of this workbook? Warning: This option affects all users of the workbook. If you choose to not update links and not to prompt, users of the workbook will not know that the data is out of date. Select and expand Refresh settings at the top right corner of the Workbook Links pane and select the required option. Note: You will still be notified if there are any broken links. What if I'm using a parameter query? A link to a parameter query cannot be updated unless the source workbook is open. Why can't I choose \"Manual\" as an update option for a specific external link? Formula links are always set to Automatic.\n\nIn the Excel web app, you can manage workbook links to ensure that your data is up to date and accurate. This article explains how to manage workbook links, including how to refresh and update them, how to fix broken links, and how to work with the new security warning feature. You will get a security warning when you open a workbook with workbook links on the Excel webapp. This warning means that the workbook is not yet trusted. To trust the workbook, select Trust workbook links. This will make the workbook trusted for this session and update the data from links. Trusting workbook for the links is a prerequisite for refreshing data from the links. You will continue to see the security warning when you open the workbook next time. If you would like the app to remember the trust for a workbook beyond that session, you should go to the Manage workbook link task pane settings and select Always trust workbook links. You can use the Link refresh preferences to control how workbook links are updated when you open a file. These options are applied to the workbook and will reflect all users who use this workbook. You can access the Link Refresh preferences for a workbook from, Workbook Links pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links > Settings.\n• Select one of the following Link refresh preferences,\n• Always refresh links: Automatically refreshes all links when the workbook opens.\n• Ask before refreshing links: Asks the user to refresh or not when the workbook opens.\n• Don't refresh links: Doesn't refresh on open and doesn't ask the user. You will have to user the Refresh button on the Workbook links pane to manually refresh.\n\n\n\n Note: On the web, a refresh operation occurs approximately every few minutes. You may not see the results right away. The currently displayed workbook has a last refresh message.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Refresh All at the top of the pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Refresh.\n\n\n\n Note: On the web, a refresh operation occurs approximately every few minutes. You may not see the results right away. The currently displayed workbook has a last refresh message. Sometimes, you need to change the source workbook, a workbook link breaks, or you may no longer need the workbook link. You may want to examine and inspect the source workbook first, before making significant changes.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Open workbook. To change the source workbook for all references within the destination workbook:\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, under Recent, select the new source workbook. Or select Browse, and from the dialog box, open the new source file. To change the source workbook for a particular reference within the destination workbook:\n• Find the workbook that you want to use as the new source for the external reference and note its location.\n• In the destination workbook, select the cell with the external reference that you want to change.\n• In the formula bar, look for a reference to another workbook, such as C:\\Reports\\[Budget.xlsx], and replace that reference with the location of the new source workbook.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, browse to the location of the file containing the linked data.\n• You can also select Suggested to view the renamed files. You can select one of them if you want to. Note: The Suggested feature is only available for the Web.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Break links.\n• When you break a link to the source workbook of an workbook link, all formulas that use the value in the source workbook are converted to their current values. For example, if you break the link to the workbook link =SUM([Budget.xls]Annual!C10:C25), the SUM formula is replaced by the calculated value—whatever that may be. For the Web app, this action can be undone.\n• If you use an external data range, a parameter in the query may be using data from another workbook. You may want to check for and remove any of these type of links.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Options at the top right corner of the pane and select Break all links.\n\n\n\n There is no automatic way to find all workbook links in a workbook. Here's how to locate the next workbook link.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Find next link next to the required workbook. Can I replace a single formula with its calculated value? Yes. When you replace a formula with its value, Excel permanently removes the formula. If you accidentally replace a formula with a value and you want to restore the formula, click Undo immediately after you enter or paste the value.\n• Press Alt+E+S+V to paste the formula as its value, or select Home > Clipboard > Paste > Paste Values. Why do I get a \"Not logged in\" error when refreshing links? Excel for web does not support refreshing links from a different domain, including cross-geography and cross-tenant scenarios. You need to use desktop to refresh these links."
    },
    {
        "link": "https://reddit.com/r/excel/comments/wgtrly/best_practice_to_link_cells_between_workbooks",
        "document": "I have a few work spreadsheets that I want to feed into eachother. PQ doesn't make sense to me yet, I've found a work around but I want to know if I need to figure out PQ, if something else would be smoother or if I've nailed it (unlikely). In this example, I'm trying to link the Petty Cash total (yellow, row 46) into the Cash Book (green, column D). I've figured out how to get the INDIRECT function to point to the right sheet based on the name in column A, so that's nice. My problem is the yellow workbook needs to be open. My plan is to have the LINK sheet to be filled with the indirect formula, once the month is complete, copy and paste the values into a formula-free sheet (July 2022). This example isn't too bad but for payroll I have 3 yellow sheets that feed 40 indirects per person into another workbook and it's messy to say the least. Is there a better way to do this?\n\nETA: forgot to mention a key issue, I can’t figure out how to get the full file path to work because the workbooks are all stored on One Drive/SharePoint. Their accessed by multiple people so I don’t want to use a local version. I haven’t been able to get a web link to work in the INDIRECT formula. I bumped into a similar issue testing PQ since the Mac version of excel doesn’t have a handy “get data from SharePoint folder”\n\nYellow row 46 feeds into green column D, it knows which yellow sheet based on green column A being named the same (proud of myself for getting that to work)"
    },
    {
        "link": "https://prophix.com/blog/how-to-consolidate-data-in-excel-everything-you-need-to-know",
        "document": "What does it mean to consolidate data in Excel? Consolidation in Excel is a function that allows you to pull data from multiple sheets or tables and combine it with a formula. You can choose the exact cells, the function, and the labels to be used in the end product. Why might you need to consolidate data in Excel? One example is the creation of a total expense sheet. By consolidating multiple expense sheets with a sum formula, you create a single table with the totals of all the others. Because this is a formula, any changes in the sources will be reflected in the total.\n\nHow to consolidate data in Excel Excel has a built-in consolidation feature. This lets you quickly take large amounts of data and apply a function to it. Keep in mind that this functionality is currently only available in the desktop version of Excel. For those working with Excel Online, you can achieve similar results using a Pivot Table. Microsoft’s documentation on the consolidate function is a little thin, so let’s get a little more detail. First, select the top left cell of the destination for the consolidated data.\n\nFor all the following examples, these first steps will be the same. The way you select your references and labels determines how the data will be displayed at the end. Here are a few examples of how to use the consolidation function in Excel for different use cases. Here we have a simple list of items, and their quantities. Though we have only two columns here, this can work with more than one column.\n\nThis will let you use your file explorer to select an entire workbook to use. If you only need to use a portion of data from another workbook, you can open the two workbooks at the same time, open the Consolidate window from the destination workbook, and select your references in the other:\n\nHere, Pam's data has been moved to Book 1 but has been selected in the original workbook. You will know that the selection is outside of the workbook when the name of the workbook is referenced first. If the selection is from the same workbook, it will be the Sheet name that appears first in the reference address.\n\nWhile Excel is the backbone of business finance and accounting, it doesn’t mean that ‘the way it’s always been done’ is necessarily the best or most efficient way. Managing massive amounts of data with spreadsheets, even when using all of the formulas and features it has to offer, still leaves room for improvement. A purpose-built financial performance platform like Prophix One offers data integration and automation so you don’t have to do the manual work of consolidated data from spreadsheets. Instead, you can take your unwieldy workbooks as your data source, integrate with Prophix One, a Financial Performance Platform, and reap the benefits of an agile, efficient, and automated process.\n\nCommon questions about using Excel to consolidate data The data consolidation function lets you create amalgamated data very quickly. These functions are not limited to one sheet, or workbook, allowing the possibility of using an Excel consolidation with data from multiple sources. These are best suited for small sets of data, and for tasks that may not be repeated frequently. For repeat tasks, you may want to consider using Excel’s Pivot Tables. What if the data sources have different items? Depending on the kind of consolidation options you choose, items can be treated differently. In this example above, the item names were used as the labels for the total count, but the different items remained separate in the consolidated table. If the items themselves are different, the Excel consolidation will keep each different item discreet.\n\n This can be a nuisance when the item names are nearly the same. Fortunately, Excel will successfully consolidate items with capitalization differences. How to consolidate data from multiple columns? Columns are oddly different from rows when it comes to consolidating in Excel. In fact, they are much easier. Instead of using the consolidate function like the above examples, all you will need to use is a formula. First, select the cells you wish to calculate, as well as the empty cells you wish to fill with the result of the calculation. The selection below will add all the cells in a row and total them in the F column."
    },
    {
        "link": "https://support.microsoft.com/en-us/office/manage-workbook-links-fcbf4576-3aab-4029-ba25-54313a532ff1",
        "document": "Here's how to ensure that you are retrieving the latest values from your source workbooks.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Refresh all at the top of the pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select the workbook from the list and select Refresh. Note: Desktop workbooks don't have the Refresh Automatically command because this operation normally occurs with automatic recalculation when opening the workbook. For more information, see Change formula recalculation, iteration, or precision in Excel.\n\n You can decide whether the links in this workbook are refreshed when opening the file according to the user's setting, not refreshed when opening the file, or refreshed automatically without prompting the user. This option affects all users of the workbook. If you choose not to refresh links, and not to prompt, users of the workbook will not know that the data is out of date.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select and expand Refresh settings at the top right corner of the pane and select one of the following:\n• Ask to refresh Asks the user to refresh or not when the workbook opens.\n• Always refresh Automatically refreshes all links when the workbook opens.\n• Don't refresh Doesn't refresh on open and doesn't ask the user. When you open a destination workbook, and the source workbook is not open, you may be alerted by the Trust Bar to update the links. You can control whether the Trust Bar alerts you, and whether to update all links when the alert does not appear. You can also choose to update only certain links if the workbook contains more than one. Manually update all or none of the workbook links\n• Close all source workbooks. If one source workbook is open, and others are closed, the updates will not be uniform.\n• In the Unsafe links warning dialog, select Update. This updates all the data links in the workbook. If you only want to update specific links, select Don't Update, and see Change the source workbook below. When you get a Security Warning bar opening a workbook If you get a Security Warning bar when you first open a workbook, it means the workbook is not yet trusted. To trust the workbook:\n• Select Enable Content. This makes the workbook trusted for this session, and updates the links.\n• If you get a dialog asking to make it a trusted document, select Yes to avoid the Security Warning bar in the future. If you select No, you'll get the Security Warning bar the next time you open the workbook. Note: Depending on your settings, you may also see the Unsafe links warning dialog. Sometimes, you need to change the source workbook, a workbook link breaks, or you may no longer need the workbook link. You may want to examine and inspect the source workbook first, before making significant changes.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Open workbook. To change the source workbook for all references within the destination workbook:\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, under Recent, select the new source workbook. Or select Browse, and from the dialog box, open the new source file. To change the source workbook for a particular reference within the destination workbook:\n• Find the workbook that you want to use as the new source for the external reference and note its location.\n• In the destination workbook, select the cell with the external reference that you want to change.\n• In the formula bar, look for a reference to another workbook, such as C:\\Reports\\[Budget.xlsx], and replace that reference with the location of the new source workbook.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the data workbook with links you want to fix, then select Change source.\n• In the Change Source dialog box, browse to the location of the file containing the linked data.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select More Commands (...) next to the required workbook and then select Break links.\n• When you break a link to the source workbook of an workbook link, all formulas that use the value in the source workbook are converted to their current values. For example, if you break the link to the workbook link =SUM([Budget.xls]Annual!C10:C25), the SUM formula is replaced by the calculated value—whatever that may be. Also, because this action cannot be undone, you may want to save a version of the destination workbook as a backup.\n• If you use an external data range, a parameter in the query may be using data from another workbook. You may want to check for and remove any of these type of links.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Break all at the top of the pane. There is no automatic way to find all workbook links in a workbook. You need to look differently in formulas, defined names, objects (like text boxes or shapes), chart titles, and chart data series. There may be several workbook links in a workbook. Here's how to locate the one you want.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select the workbook from the list and select Find next.\n• Press Ctrl+F to launch the Find and Replace dialog.\n• In the Find what box, enter .xl.\n• In the Within box, click Workbook.\n• In the Look in box, click Formulas.\n• In the list box that is displayed, look in the Formula column for formulas that contain .xl. In this case, Excel found multiple instances of Budget Master.xlsx.\n• To select the cell with a workbook link, click the cell address link for that row in the list box. Tip: Click any column header to sort the column, and group all of the workbook links together.\n• On the Formulas tab, in the Defined Names group, click Name Manager.\n• Check each entry in the list and look in the Refers To column for workbook links. Workbook links contain a reference to another workbook, such as [Budget.xlsx].\n• Click any column header to sort the column, and group all of the workbook links together.\n• You can group multiple items with the Shift or Ctrl keys and Left-click if you want to delete multiple items at once. Find workbook links used in objects, text boxes, or shapes\n• Press Ctrl+G, the shortcut for the Go To dialog, then click Special > Objects > OK. This will select all objects on the active worksheet.\n• Press the Tab key to move between each of the selected objects, and then look in the formula bar for a reference to another workbook, such as [Budget.xlsx].\n• Click the chart title on the chart that you want to check.\n• In the formula bar , look for a reference to another workbook, such as [Budget.xls].\n• Select the chart that you want to check.\n• On the Layout tab, in the Current Selection group, click the arrow next to the Chart Elements box, and then click the data series that you want to check.\n• In the formula bar , look for a reference to another workbook, such as [Budget.xls] in the SERIES function. The legacy Edit Links command is replaced by the Workbook Links command. However, you can get the old Edit Links command back by adding the legacy Edit Links command to your custom group in the ribbon. You can't add the Edit Links command to the Queries and Connections group. Using Customize the Ribbon, you need to create your custom group and only then you can add Edit Links to your custom group in ribbon as follows:\n• Right-click the ribbon and select Customize the Ribbon.\n• In the Choose commands from drop-down, select All Commands.\n• Click New Group and then select Add. Edit Links is added to your customized group. You can also add Edit Links to the Quick Access Toolbar. For more information, see Customize the Quick Access Toolbar. The Edit Links command is dimmed if your workbook does not contain workbook links. When you open the Edit Links dialog box, you're presented with several options for dealing with existing links. You can select individual workbooks with Ctrl+click, or all of them with Ctrl+A. This will update all selected workbooks. This option is useful when you want to point existing links to another source. For instance, you might have a prior year workbook, and need to point to a new workbook when a new year starts. Selecting Change source will launch a file explorer dialog box, where you can browse to the new source workbook. If the workbook has more than one worksheet, you will be prompted to specify which one to link to - just click the sheet you want and click OK. Note: It is possible to point a workbook back to itself by selecting it from the Change source dialog. This will sever any formula links to the originally linked source workbook. This will open the source workbook. Important: When you break a link to a source, all formulas that use the source are converted to their current value. For example, the link =SUM([Budget.xlsx]Annual!C10:C25) would be converted to the sum of the values in the source workbook. Because this action cannot be undone, you may want to save a version of the file first.\n• In the Edit Links dialog box, in the Source list, click the link that you want to break. You can select individual workbooks with Ctrl+click, or all of them with Ctrl+A.\n• If the link used a defined name, you may also want to delete the name. To delete a name:\n• On the Formulas tab, in the Defined Names group, click Name Manager.\n• In the Name column, click the name that you want to delete, and then click Delete. Note: If you use an external data range, a parameter of a query may also use data from another workbook. You may want to check for and remove any of these types of links.​​​​​​​ This simply displays a notification in the Edit Links pane whether a linked workbook is still a valid source. It should display OK, but if it doesn't then you'll need to check on the source workbook. In many cases, a source workbook may have been moved or deleted, cutting the link. If the workbook still exists, you can use the Change Source option to relink the workbook. Why do I see new links in my workbook? Previous versions of Excel hide the links in names that are not currently in use in the workbook. The links have always existed and are no longer hidden. To remove the link, select Break Links for the selected workbook in the Workbook Links pane. Can I replace a single formula with its calculated value? Yes. When you replace a formula with its value, Excel permanently removes the formula. If you accidentally replace a formula with a value and you want to restore the formula, select Home and choose Undo or press Ctrl+Z immediately after you enter or paste the value.\n• Press Ctrl+C to copy the cell with the formula.\n• Press Alt+E+S+V to paste the formula as its value, or select Home > Clipboard > Paste > Paste Values. What if I'm not connected to the source? Select Don't Update in the Unsafe links warning dialog. Excel cannot update from a source that is not connected. For example, the source may be on a network, and you may not be connected to that network. What if I don't want my current data replaced with new data? How can I update without it taking so long? Select Don't Update in the Unsafe links warning dialog. If the data does not need to be the most current, you can save time by not updating all of the links. After opening the workbook, go to the Data tab and select Workbook Links in the Queries & Connections group, and then update the links only from the sources that you need. How can I not see this prompt after someone else created the workbook? Select Don't Update in the Unsafe links warning dialog and contact workbook's owner. You can also investigate which links are in the workbook. On the Data tab, in the Queries & Connections group, select Workbook Links. How can I not see the prompt again if I prompt the same way every time? You can select and expand Refresh settings at the top right corner of the Workbook Links pane and select in a consistent way and avoid seeing the startup prompt for this workbook. How do I not prompt for all workbooks I open, and update the links automatically? This option affects every workbook opened on the computer. Users who open the workbook on another computer are not affected.\n• On the File tab, select Options and choose Advanced.\n• In the General section, clear Ask to update automatic links. When this check box is cleared, the links are automatically updated, and no alert is displayed. How do I prompt in the same way for every user of this workbook? Warning: This option affects all users of the workbook. If you choose to not update links and not to prompt, users of the workbook will not know that the data is out of date. Select and expand Refresh settings at the top right corner of the Workbook Links pane and select the required option. Note: You will still be notified if there are any broken links. What if I'm using a parameter query? A link to a parameter query cannot be updated unless the source workbook is open. Why can't I choose \"Manual\" as an update option for a specific external link? Formula links are always set to Automatic.\n\nIn the Excel web app, you can manage workbook links to ensure that your data is up to date and accurate. This article explains how to manage workbook links, including how to refresh and update them, how to fix broken links, and how to work with the new security warning feature. You will get a security warning when you open a workbook with workbook links on the Excel webapp. This warning means that the workbook is not yet trusted. To trust the workbook, select Trust workbook links. This will make the workbook trusted for this session and update the data from links. Trusting workbook for the links is a prerequisite for refreshing data from the links. You will continue to see the security warning when you open the workbook next time. If you would like the app to remember the trust for a workbook beyond that session, you should go to the Manage workbook link task pane settings and select Always trust workbook links. You can use the Link refresh preferences to control how workbook links are updated when you open a file. These options are applied to the workbook and will reflect all users who use this workbook. You can access the Link Refresh preferences for a workbook from, Workbook Links pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links > Settings.\n• Select one of the following Link refresh preferences,\n• Always refresh links: Automatically refreshes all links when the workbook opens.\n• Ask before refreshing links: Asks the user to refresh or not when the workbook opens.\n• Don't refresh links: Doesn't refresh on open and doesn't ask the user. You will have to user the Refresh button on the Workbook links pane to manually refresh.\n\n\n\n Note: On the web, a refresh operation occurs approximately every few minutes. You may not see the results right away. The currently displayed workbook has a last refresh message.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Refresh All at the top of the pane.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Refresh.\n\n\n\n Note: On the web, a refresh operation occurs approximately every few minutes. You may not see the results right away. The currently displayed workbook has a last refresh message. Sometimes, you need to change the source workbook, a workbook link breaks, or you may no longer need the workbook link. You may want to examine and inspect the source workbook first, before making significant changes.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Open workbook. To change the source workbook for all references within the destination workbook:\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, under Recent, select the new source workbook. Or select Browse, and from the dialog box, open the new source file. To change the source workbook for a particular reference within the destination workbook:\n• Find the workbook that you want to use as the new source for the external reference and note its location.\n• In the destination workbook, select the cell with the external reference that you want to change.\n• In the formula bar, look for a reference to another workbook, such as C:\\Reports\\[Budget.xlsx], and replace that reference with the location of the new source workbook.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Change source.\n• In the Change Source dialog box, browse to the location of the file containing the linked data.\n• You can also select Suggested to view the renamed files. You can select one of them if you want to. Note: The Suggested feature is only available for the Web.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Link options (...) next to the required workbook and then select Break links.\n• When you break a link to the source workbook of an workbook link, all formulas that use the value in the source workbook are converted to their current values. For example, if you break the link to the workbook link =SUM([Budget.xls]Annual!C10:C25), the SUM formula is replaced by the calculated value—whatever that may be. For the Web app, this action can be undone.\n• If you use an external data range, a parameter in the query may be using data from another workbook. You may want to check for and remove any of these type of links.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Options at the top right corner of the pane and select Break all links.\n\n\n\n There is no automatic way to find all workbook links in a workbook. Here's how to locate the next workbook link.\n• To open the Workbook Links pane, select Data > Queries and Connections > Workbook Links.\n• Select Find next link next to the required workbook. Can I replace a single formula with its calculated value? Yes. When you replace a formula with its value, Excel permanently removes the formula. If you accidentally replace a formula with a value and you want to restore the formula, click Undo immediately after you enter or paste the value.\n• Press Alt+E+S+V to paste the formula as its value, or select Home > Clipboard > Paste > Paste Values. Why do I get a \"Not logged in\" error when refreshing links? Excel for web does not support refreshing links from a different domain, including cross-geography and cross-tenant scenarios. You need to use desktop to refresh these links."
    },
    {
        "link": "https://support.microsoft.com/en-us/office/work-with-links-in-excel-7fc80d8d-68f9-482f-ab01-584c44d72b3e",
        "document": "\n• On a worksheet, click the cell where you want to create a link. You can also select an object, such as a picture or an element in a chart, that you want to use to represent the link. You can also right-click the cell or graphic and then select Link on the shortcut menu, or you can press Ctrl+K.\n• Under Link to, click Create New Document.\n• In the Name of new document box, type a name for the new file. Tip: To specify a location other than the one shown under Full path, you can type the new location preceding the name in the Name of new document box, or you can click Change to select the location that you want and then click OK.\n• Under When to edit, click Edit the new document later or Edit the new document now to specify when you want to open the new file for editing.\n• In the Text to display box, type the text that you want to use to represent the link.\n• To display helpful information when you rest the pointer on the link, click ScreenTip, type the text that you want in the ScreenTip text box, and then click OK. Create a link to an existing file or web page\n• On a worksheet, click the cell where you want to create a link. You can also select an object, such as a picture or an element in a chart, that you want to use to represent the link. You can also right-click the cell or object and then select Link on the shortcut menu, or you can press Ctrl+K.\n• Under Link to, select Existing File or Web Page.\n• \n• To select a file, select Current Folder, and then select the file that you want to link to. You can change the current folder by selecting a different folder in the Look in list.\n• To select a web page, select Browsed Pages and then select the web page that you want to link to.\n• To select a file that you recently used, select Recent Files, and then select the file that you want to link to.\n• To enter the name and location of a known file or web page that you want to link to, type that information in the Address box.\n• To locate a web page, select Browse the Web , open the web page that you want to link to, and then switch back to Excel without closing your browser.\n• If you want to create a link to a specific location in the file or on the web page, select Bookmark, and then double-click the bookmark that you want. Note: The file or web page that you are linking to must have a bookmark.\n• In the Text to display box, type the text that you want to use to represent the link.\n• To display helpful information when you rest the pointer on the link, select ScreenTip, type the text that you want in the ScreenTip text box, and then select OK. To link to a location in the current workbook or another workbook, you can either define a name for the destination cells or use a cell reference.\n• To use a name, you must name the destination cells in the destination workbook. How to name a cell or a range of cells\n• Select the cell, range of cells, or nonadjacent selections that you want to name.\n• Click the Name box at the left end of the formula bar .\n• In the Name box, type the name for the cells, and then press Enter. Note: Names can't contain spaces and must begin with a letter.\n• On a worksheet of the source workbook, click the cell where you want to create a link. You can also select an object, such as a picture or an element in a chart, that you want to use to represent the link. You can also right-click the cell or object and then select Link on the shortcut menu, or you can press Ctrl+K.\n• Under Link to, do one of the following:\n• To link to a location in your current workbook, select Place in This Document.\n• To link to a location in another workbook, select Existing File or Web Page, locate and select the workbook that you want to link to, and then select Bookmark.\n• \n• In the Or select a place in this document box, under Cell Reference, click the worksheet that you want to link to, type the cell reference in the Type in the cell reference box, and then select OK.\n• In the list under Defined Names, select the name that represents the cells that you want to link to, and then select OK.\n• In the Text to display box, type the text that you want to use to represent the link.\n• To display helpful information when you rest the pointer on the link, select ScreenTip, type the text that you want in the ScreenTip text box, and then select OK. Create a custom link by using the HYPERLINK function Use the HYPERLINK function to create a link to a document or other resource on a network server, an intranet, or the Internet. When you click the cell that contains the HYPERLINK function, Excel opens the linked item. The syntax for the HYPERLINK function is \n\n =HYPERLINK(link_location, [friendly_name])\n• link_location is the URL or path to the link destination\n• friendly_name is the text that will display in the cell\n\n Here are some Hyperlink examples:\n• Hyperlink to a webpage\n\n =HYPERLINK(\"https://www.example.com\", \"Visit Example\")\n\n This will display \"Visit Example\" as the clickable text.\n• Hyperlink to specific cells within the worksheet\n\n =HYPERLINK(\"#A10\", \"Go to Cell A10\")\n• Hyperlink to another worksheet within the same workbook\n\n =HYPERLINK(\"#Sheet2!A1\", \"Go to Sheet2\")\n• Hyperlink to another workbook =HYPERLINK(\"C:\\\\Users\\\\YourName\\\\Documents\\\\AnotherWorkbook.xlsx\", \"Open Another Workbook\")\n• Link to a specific file on your drive\n\n =HYPERLINK(\"C:\\\\Users\\\\YourName\\\\Documents\\\\Report.docx\", \"Open Report\") When you click a link to an email address, your email program automatically starts and creates an email message with the correct address in the To box, provided that you have an email program installed.\n• On a worksheet, click the cell where you want to create a link. You can also select an object, such as a picture or an element in a chart, that you want to use to represent the link. You can also right-click the cell or object and then select Link on the shortcut menu, or you can press Ctrl+K.\n• In the E-mail address box, type the email address that you want.\n• In the Subject box, type the subject of the email message. Note: Some web browsers and email programs won't recognize the subject line.\n• In the Text to display box, type the text that you want to use to represent the link.\n• To display helpful information when you rest the pointer on the link, select ScreenTip, type the text that you want in the ScreenTip text box, and then select OK. You can also create a link to an email address in a cell by typing the address directly in the cell. For example, a link is created automatically when you type an email address, such as someone@example.com. Create an external reference link to worksheet data on the web You can insert one or more external reference (also called links) from a workbook to another workbook that is located on your intranet or on the Internet. The workbook must not be saved as an HTML file.\n• Open the source workbook and select the cell or cell range that you want to copy.\n• Switch to the worksheet that you want to place the information in, and then click the cell where you want the information to appear.\n• Excel creates an external reference link for the cell or each cell in the cell range. Note: You may find it more convenient to create an external reference link without opening the workbook on the web. For each cell in the destination workbook where you want the external reference link, click the cell, and then type an equal sign (=), the URL address, and the location in the workbook. For example: To select a hyperlink without activating the link to its destination, do one of the following:\n• Click the cell that contains the link, hold the mouse button until the pointer becomes a cross , and then release the mouse button.\n• Use the arrow keys to select the cell that contains the link.\n• If the link is represented by a graphic, hold down Ctrl, and then select the graphic. You can change an existing link in your workbook by changing its destination, its appearance, or the text or graphic that is used to represent it.\n• Select the cell or graphic that contains the link that you want to change. Tip: To select a cell that contains a link without going to the link destination, click the cell and hold the mouse button until the pointer becomes a cross , and then release the mouse button. You can also use the arrow keys to select the cell. To select a graphic, hold down Ctrl and select the graphic. You can also right-click the cell or graphic and then select Edit Link on the shortcut menu, or you can press Ctrl+K.\n• In the Edit Hyperlink dialog box, make the changes that you want. Note: If the link was created by using the HYPERLINK worksheet function, you must edit the formula to change the destination. Select the cell that contains the link, and then select the formula bar to edit the formula. You can change the appearance of all link text in the current workbook by changing the cell style for links.\n• Under Data and Model, do the following:\n• To change the appearance of links that have not been clicked to go to their destinations, right-click Hyperlink, and then select Modify.\n• To change the appearance of links that have been clicked to go to their destinations, right-click Followed Hyperlink, and then select Modify. Note: The Link cell style is available only when the workbook contains a link. The Followed Link cell style is available only when the workbook contains a link that has been clicked.\n• On the Font tab and Fill tab, select the formatting options that you want, and then select OK.\n• The options that you select in the Format Cells dialog box appear as selected under Style includes in the Style dialog box. You can clear the check boxes for any options that you don't want to apply.\n• Changes that you make to the Link and Followed Link cell styles apply to all links in the current workbook. You can't change the appearance of individual links. Change the text or graphic for a link\n• Select the cell or graphic that contains the link that you want to change. Tip: To select a cell that contains a link without going to the link destination, click the cell and hold the mouse button until the pointer becomes a cross , and then release the mouse button. You can also use the arrow keys to select the cell. To select a graphic, hold down Ctrl and select the graphic.\n• Do one or more of the following:\n• To change the link text, click in the formula bar, and then edit the text.\n• To change the format of a graphic, right-click it, and then select the option that you need to change its format.\n• To change text in a graphic, double-click the selected graphic, and then make the changes that you want.\n• To change the graphic that represents the link, insert a new graphic, make it a link with the same destination, and then delete the old graphic and link.\n• Right-click the hyperlink that you want to copy or move, and then select Copy or Cut on the shortcut menu.\n• Right-click the cell that you want to copy or move the link to, and then select Paste on the shortcut menu. Set the base address for the links in a workbook By default, unspecified paths to hyperlink destination files are relative to the location of the active workbook. Use this procedure when you want to set a different default path. Each time that you create a link to a file in that location, you only have to specify the file name, not the path, in the Insert Hyperlink dialog box.\n• In the Summary tab, in the Hyperlink base text box, type the path that you want to use. Note: You can override the link base address by using the full, or absolute, address for the link in the Insert Hyperlink dialog box. To delete a link, do one of the following:\n• To delete a link and the text that represents it, right-click the cell that contains the link, and then click Clear Contents on the shortcut menu.\n• To delete a link and the graphic that represents it, hold down Ctrl and click the graphic, and then press Delete.\n• To turn off a single link, right-click the link, and then click Remove Link on the shortcut menu. A link opens another page or file when you click it. The destination is frequently another web page, but it can also be a picture, an email address, or a program. The link itself can be text or a picture. When a site user clicks the link, the destination is shown in a Web browser, opened, or run, depending on the type of destination. For example, a link to a page shows the page in the web browser, and a link to an AVI file opens the file in a media player. You can use links to do the following:\n• Navigate to a file or web page on a network, intranet, or Internet\n• Navigate to a file or web page that you plan to create in the future\n• Start a file transfer, such as downloading or an FTP process When you point to text or a picture that contains a link, the pointer becomes a hand , indicating that the text or picture is something that you can click. What a URL is and how it works When you create a link, its destination is encoded as a Uniform Resource Locator (URL), such as: A URL contains a protocol, such as HTTP, FTP, or FILE, a Web server or network location, and a path and file name. The following illustration defines the parts of the URL: An absolute URL contains a full address, including the protocol, the Web server, the path, and file name. A relative URL has one or more missing parts. The missing information is taken from the page that contains the URL. For example, if the protocol and web server are missing, the web browser uses the protocol and domain, such as .com, .org, or .edu, of the current page. It is common for pages on the web to use relative URLs that contain only a partial path and file name. If the files are moved to another server, any links will continue to work as long as the relative positions of the pages remain unchanged. For example, a link on Products.htm points to a page named apple.htm in a folder named Food; if both pages are moved to a folder named Food on a different server, the URL in the link will still be correct. In an Excel workbook, unspecified paths to link destination files are by default relative to the location of the active workbook. You can set a different base address to use by default so that each time that you create a link to a file in that location, you only have to specify the file name, not the path, in the Insert Hyperlink dialog box.\n• On a worksheet, select the cell where you want to create a link.\n• You can also right-click the cell and then select Hyperlink... on the shortcut menu, or you can press Ctrl+K.\n• Under Display Text:, type the text that you want to use to represent the link.\n• Under URL:, type the complete Uniform Resource Locator (URL) of the webpage you want to link to. Create a link to a specific location in the current workbook To link to a location in the current workbook, you can either define a name for the destination cells or use a cell reference.\n• To use a name, you must name the destination cells in the workbook. How to define a name for a cell or a range of cells \n\n Note: In Excel for the Web, you can't create named ranges. You can only select an existing named range from the Named Ranges control. Alternately, you can open the file in the Excel desktop app, create a named range there, and then access this option from Excel for the web.\n• Select the cell or range of cells that you want to name.\n• On the Name Box box at the left end of the formula bar , type the name for the cells, and then press Enter. Note: Names can't contain spaces and must begin with a letter.\n• On the worksheet, select the cell where you want to create a link.\n• You can also right-click the cell and then select Hyperlink... on the shortcut menu, or you can press Ctrl+K.\n• Under Display Text:, type the text that you want to use to represent the link.\n• Under Place in this document:, enter the defined name or cell reference. When you click a link to an email address, your email program automatically starts and creates an email message with the correct address in the To box, provided that you have an email program installed.\n• On a worksheet, select the cell where you want to create a link.\n• You can also right-click the cell and then select Hyperlink... on the shortcut menu, or you can press Ctrl+K.\n• Under Display Text:, type the text that you want to use to represent the link.\n• Under E-mail address:, type the email address that you want. You can also create a link to an email address in a cell by typing the address directly in the cell. For example, a link is created automatically when you type an email address, such as someone@example.com. Create a custom link by using the HYPERLINK function You can use the HYPERLINK function to create a link to a URL. Note: The Link_location can be a text string enclosed in quotation marks or a reference to a cell that contains the link as a text string. To select a hyperlink without activating the link to its destination, do any of the following:\n• Select a cell by clicking it when the pointer is an arrow.\n• Use the arrow keys to select the cell that contains the link. You can change an existing link in your workbook by changing its destination, its appearance, or the text that is used to represent it.\n• Select the cell that contains the link that you want to change. Tip: To select a hyperlink without activating the link to its destination, use the arrow keys to select the cell that contains the link.\n• You can also right-click the cell or graphic and then select Edit Hyperlink... on the shortcut menu, or you can press Ctrl+K.\n• In the Edit Hyperlink dialog box, make the changes that you want. Note: If the link was created by using the HYPERLINK worksheet function, you must edit the formula to change the destination. Select the cell that contains the link, and then select the formula bar to edit the formula.\n• Right-click the hyperlink that you want to copy or move, and then select Copy or Cut on the shortcut menu.\n• Right-click the cell that you want to copy or move the link to, and then select Paste on the shortcut menu. To delete a link, do one of the following:\n• To delete a link, select the cell and press Delete.\n• To turn off a link (delete the link but keep the text that represents it), right-click the cell and then select Remove Hyperlink."
    },
    {
        "link": "https://support.microsoft.com/en-us/excel",
        "document": "Bring your ideas to life and streamline your work by starting with professionally designed, fully customizable templates from Microsoft Create. Find customizable templates to take your project to the next level\n\nAsk questions about your data without having to write complicated formulas. Not available in all locales. Use Analyze Data to make data analysis simpler, faster, and more intuitive\n\nVisit the small business help & learning page to learn how you can use Microsoft 365 in your small business. Explore ways to help your small business grow, finish projects faster, and do more\n\nEnd of support for Excel 2016 and Excel 2019 Support for Excel 2016 and Excel 2019 will end on October 14, 2025. Learn what end of Excel 2016 and Excel 2019 support means for you. Get details about the end of support for Office 2016 and Office 2019"
    },
    {
        "link": "https://support.microsoft.com/en-us/office/create-workbook-links-c98d1803-dd75-4668-ac6a-d7cca2a9b95f",
        "document": "You can reference cells or a defined name in another workbook or the same workbook. Understand the difference between a source and destination workbook The workbook that contains the links is called the destination workbook, and the workbook that it's linked to is called the source workbook. You can link multiple source workbooks to a single destination workbook.\n• The destination workbook contains the workbook link.\n• The workbook link refers to a cell or range in a source workbook.\n• The source workbook has the values returned to the destination workbook. Create a workbook link between cells in different workbooks\n• Open the destination workbook that will contain the external reference and the source destination workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• If you want to use a function, such as SUM, then type the function name followed by an opening parenthesis. For example, =SUM(.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or cells that you want to link to and press Enter. Note: If you select multiple cells, like =[SourceWorkbook.xlsx]Sheet1!$A$1:$A$10, and have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel will return you to the destination workbook and display the values from the source workbook.\n• Note that Excel will return the link with absolute references, so if you want to copy the formula to other cells, you'll need to remove the dollar ($) signs: If you close the source workbook, Excel will automatically append the file path to the formula:\n• Open the destination workbook that will contain the workbook link and the source workbook that contains the data that you want to link to.\n• In the source workbook, select the cell or cells you want to link.\n• Press Ctrl+C or go to Home > Clipboard > Copy.\n• Switch to the destination workbook, and then click the worksheet where you want the linked data to be placed.\n• Select the cell where you want to place the linked data, and select Home > Clipboard > Paste > Paste Link.\n• Excel returns the data you copied from the source workbook. If you change it, it will automatically change in the destination workbook. Create a workbook link to a defined name in another workbook\n• Open the destination workbook that will contain the external reference and the source workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Press F3, select the name that you want to link to and press Enter. Note: If the named range references multiple cells, and you have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel will return you to the destination workbook and display the values from the named range in the source workbook. Define a name that contains a workbook link to cells in another workbook\n• Open the destination workbook and the source workbook.\n• In the destination workbook, select Formulas > Defined Names > Define Name.\n• In the New Name dialog box, in the Name box, type a name for the range.\n• In the Refers to box, delete the contents, and then keep the cursor in the box. If you want the name to use a function, enter the function name, and then position the cursor where you want the external reference. For example, type =SUM(), and then position the cursor between the parentheses.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or range of cells that you want to link, and click OK. What a workbook link to another workbook looks like There are different ways Formulas with workbook links are displayed. When the source workbook is open, the workbook link in the destination workbook includes the workbook name in square brackets ([ ]), followed by the worksheet name, an exclamation point (!), and the cells that the formula depends on. For example: When the source workbook is not open, the workbook link in the destination workbook includes the entire path. For example: Note: If the name of the other worksheet or workbook contains spaces or non-alphabetical characters, you must enclose the name (or the path) within single quotation marks as in the example above. Excel will automatically add these for you when you select the source range. Formulas that link to a defined name in another workbook use the workbook name followed by an exclamation point (!) and the defined name. For example:\n\nWhen you create a workbook link, both workbooks must be saved in an online location you can reach with your Microsoft 365 account. Important: Workbook links are considered potentially unsafe and must be enabled when you open a formula workbook. When you open a formula workbook, click Enable Content in the Message Bar to allow the workbook links to function. If you don't, Excel keeps the most recent values and disables refreshing the links with values from the data workbook. Create a workbook link between cells in different workbooks\n• Open the destination workbook that will contain the external reference and the source destination workbook that contains the data to which you want to create the workbook link.\n• Select the cell or cells where you want to create the external reference.\n• If you want to use a function, such as SUM, then type the function name followed by an opening parenthesis. For example, =SUM(.\n• Switch to the source workbook, and then click the worksheet that contains the cells that you want to link.\n• Select the cell or cells that you want to link to and press Enter. Note: If you select multiple cells, like =[SourceWorkbook.xlsx]Sheet1!$A$1:$A$10, and have a current version of Microsoft 365, then you can simply press ENTER to confirm the formula as a dynamic array formula. Otherwise, the formula must be entered as a legacy array formula by pressing CTRL+SHIFT+ENTER. For more information on array formulas, see Guidelines and examples of array formulas.\n• Excel saves the formula in the destination workbook but cannot change the tab back to the destination workbook.\n• Note that Excel will return the link with absolute references, so if you want to copy the formula to other cells, you'll need to remove the dollar ($) signs. Full cloud file path is used in the URL:\n• Open the destination workbook that will contain the workbook link and the source workbook that contains the data that you want to link to.\n• In the source workbook, select the cell or cells you want to link.\n• Press Ctrl+C or go to Home > Clipboard > Copy.\n• Switch to the destination workbook, and then click the worksheet where you want the linked data to be placed.\n• Select the cell where you want to place the linked data, and select Home > Clipboard > Paste > Paste Link.\n• Excel returns the data you copied from the source workbook. If you change it, it will automatically change in the destination workbook when you refresh your browser window."
    },
    {
        "link": "https://intellezy.com/blog/how-to-enable-automatic-update-of-links-in-excel-365",
        "document": ""
    }
]