[
    {
        "link": "https://vectra.ai/detections/smb-account-scan",
        "document": "\n• A host rapidly makes use of multiple accounts via the SMB protocol which can be used for file sharing, RPC and other activity\n• An attacker is trying to determine the existence of accounts in order to progress to the next step in the attack\n• The attacker is working through a list of accounts with well-known default passwords in an attempt to find a working account/password combination\n• This host provides services through a portal and many users are using the portal by logging in and requesting services which require an SMB connection to fulfill\n• An account scan is an effective way for an attacker to determine what accounts are available inside an organization’s network\n• Reconnaissance within a network is a precursor to active attacks which ultimately exposes an organization to substantial risk of data acquisition and exfiltration\n• This form of reconnaissance is often a lot less noticeable than a port sweep or a port scan so attackers feel they can use it with relatively little risk of detection\n• If logs of user session activity are available, examine the logs for a more detailed view of activity by this host\n• Inquire whether the host should be utilizing the user accounts listed in the detection\n• Verify that the host from which authentication is attempted is not a shared resource as this could generate a sufficient variety of account usage to resemble an account scan\n\nWhat exactly is SMB scanning and why is it significant?\n\nSMB scanning involves probing a network for open SMB ports or identifying active SMB services. It's significant because it can indicate either legitimate administrative activities or malicious reconnaissance efforts.\n\nHow does SMB scanning differ when done for legitimate vs. malicious purposes?\n\nLegitimate SMB scanning is conducted by network administrators for managing resources or ensuring authorized SMB services. Malicious SMB scanning is performed by attackers to find entry points into a network or exploit vulnerabilities.\n\nWhat are some common signs of an SMB account scan?\n\nSigns include rapid account access attempts, login attempts from multiple IP addresses, unusual activity times, access to multiple resources, high traffic volume, use of common credentials, security tool alerts, repeated account lockouts, and geographic irregularities.\n\nAttackers scan SMB accounts for credential harvesting, identifying vulnerabilities, network mapping, lateral movement within a network, installing malware, data exfiltration, and service disruption.\n\nWhat are the business implications of an SMB account scan?\n\nImplications include security breaches, operational disruption, ransomware/malware attacks, resource drain, compliance and legal issues, reputational damage, intellectual property theft, and financial losses.\n\nWhat are some investigative measures to address SMB account scans?\n\nMeasures include analyzing logs, verifying account usage, and assessing if the scanning host is a shared resource that might mimic scanning activity.\n\nHow can SMB scanning lead to lateral movement within a network?\n\nOnce inside a network, attackers use SMB scanning to locate other vulnerable systems or accounts, allowing them to spread the attack and gain deeper access.\n\nAttackers use SMB account scanning to identify valid user credentials through brute-force attacks or credential stuffing.\n\nWhat role do outdated SMB protocols play in these scans?\n\nOlder SMB versions, like SMBv1, have known vulnerabilities that can be easily exploited, making them prime targets in SMB scanning.\n\nHow can organizations protect against SMB account scans?\n\nOrganizations should regularly update and patch systems, implement strong authentication mechanisms, monitor network traffic, and educate employees about security best practices.\n\nWhat should be the immediate response upon detecting an SMB account scan?\n\nImmediately investigate the origin and nature of the scan, assess the extent of access or damage, and initiate appropriate security measures to contain and mitigate the threat."
    },
    {
        "link": "http://docs.rapid7.com/nexpose/database-credential-requirements-for-scanning-policies",
        "document": "Credentials provide Nexpose with the necessary access to scan an asset. Several types of authentication are supported for vulnerability and policy scanning, including authentication for databases such as Microsoft SQL Server (MSSQL), DB2, MySQL, and Oracle.\n\nYou add credentials for databases the same way you create shared credentials for authenticated scans. You'll need to add two sets of credentials: one for the database itself and one for the asset host.\n\nFor example, if you have Oracle installed on a Linux machine, you'll need to provide the credentials to log in to the Linux machine as well as credentials for the database. If you are scanning a SQL server, you'll need to specify the CIFS/SMB credentials that are needed to connect to the Windows asset.\n\nRapid7 recommends using Windows authentication to run authenticated scans on MSSQL databases.\n\nIf you intend to use Windows authentication, your user account must have permissions for the following tables (permissions are grouped according to MSSQL version):\n\nIf you choose not to use Windows authentication, you must use the System Administrator (SA) account.\n\nUsage of SA account may be against some policy rules While the SA account provides all the access you need to scan your MSSQL database, some policies may regard the usage of the SA account as a violation of policy rules. This is why we recommend using Windows authentication.\n\nWhen configuring this credential in the Security Console, the following information is required for MSSQL databases:\n• Service - The service identifies the type of database you want to add credentials for. In this case, you need to set this option to “Microsoft SQL Server”.\n• Database - This is the name of the MSSQL database you’re using. The database field by default is set to .\n• Domain - If you choose to use Windows authentication, you need to provide the Windows domain name.\n• Username - The name of the user's account which is used for authenticating to the database. Depending on your authentication option, this will either be your own user account with the necessary permissions, or the SA account.\n• Password - The password for the user's account which is used for authenticating to the database.\n\nPostgreSQL credentials are the credentials used to access the database, not the credentials used to access the system hosting the database.\n\nThe credentials have the following fields:\n• Database - This field can be left blank and will default to “template1” or the value provided in the scan template. This needs to be any valid database to allow us to connect. “template1” is a database template available in all Postgres installations unless it has been explicitly removed.\n• Domain - This is unused and should not be present in the UI.\n• Username - The username for the database login.\n\nFor DB2 databases, the following information is required:\n• Service - The service identifies the type of database you want to add credentials for. For DB2, set this option to \"DB2\".\n• Database - This is the name of the DB2 database you're using. The default database for DB2 is \"DB2COPY1\".\n• Domain - This field is optional and only applicable if Windows authentication is enabled. Leave this field blank if the database is not using Windows authentication.\n• Username - This is the username for the account that will be used for authenticating to the database. The default username is \"db2admin\" for Windows and \"db2inst1\" for Linux and AIX.\n• Password - This is the password for the account that will be used for authenticating to the database.\n\nFor MySQL databases, the following information is required for authentication:\n• Database - This is the name of the MySQL database you're using.\n• User name - The user name for the account that will be used for authenticating to the database.\n• Password - The password for the account that will be used for authenticating to the database.\n• Permissions - Nexpose requires and permissions to the following tables:\n\nFor Oracle databases, the following information is required for authentication:\n• Service - The service identifies the type of database you want to add credentials for. In this case, you need to set this option to \"Oracle\" for authentication by SID or to \"Oracle Service Name\" to authenticate by Service Name.\n• SID - The SID represents the unique name for the database. The default SID is \"orcl\". If your Oracle environment has been set up to use multiple SIDs, choose the Oracle Net Listener Password option and enter your listener password to enumerate SIDs from your environment. For more information on configuring your Oracle Net Listener password, see Oracle’s help documentation.\n• If you want the scan to enumerate all the SIDS found, you need to specify the SIDs. Use the root credentials provided for the scan instead of the listener password for SID enumeration. The Oracle Listener password on Oracle 12c is not supported.\n• Service Name - The Service Name is an alias for the Oracle Database instance.\n• Username - The username for the account that will be used for authenticating to the database. You can use the account, which is a default admin account that is created during installation.\n• Password - The password for the account that will be used for authenticating to the database.\n• Permissions - Nexpose requires access to the following tables:\n\nWhile Nexpose will scan your database when configured to log in as a highly privileged role such as \"sysdba,\" it is not recommended. You can create a user with more limited access by running the following commands:\n\nAfter you create this account, you can configure a site to use your new Oracle credentials.\n\nPolicy scanning for Sybase is currently not available."
    },
    {
        "link": "https://coresecurity.com/blog/4-ways-use-siem-smb",
        "document": ""
    },
    {
        "link": "https://linkedin.com/advice/1/what-most-effective-ways-secure-smb-protocol-skills-cybersecurity",
        "document": "A sixth way to secure the SMB protocol is to educate SMB users, which means raising the awareness and knowledge of the SMB users about the security risks and best practices of the SMB protocol. SMB users can be educated by using various methods, such as training, guidelines, or policies. Training can provide the SMB users with the necessary skills and information to use the SMB protocol safely and securely, such as how to update SMB versions, enable SMB signing, or restrict SMB access. Guidelines can provide the SMB users with the clear and consistent instructions and procedures for using the SMB protocol, such as how to monitor SMB activity, harden SMB configuration, or report SMB incidents. Policies can provide the SMB users with the rules and expectations for using the SMB protocol, such as what SMB resources they can access, what SMB actions they can perform, or what SMB consequences they can face. Help others by sharing more (125 characters min.)\n• CEO at ParanoidLab | Compromised Credentials monitoring for MSSPs and SOCs Cyber Security is always about a human factor, and the same applies to SMB security. Securing SMB goes beyond systems - it’s about enlightening users. Empower them with training on safe practices, like updating SMB versions or enabling signing. Provide clear guidelines on monitoring activity and hardening configurations, and establish firm policies on resource access and usage rules. Education isn’t just sharing info, but arming users in the cybersecurity battle.\n• Chief Cyber Risk Officer at MTI | Advancing Cybersecurity and AI Through Constant Learning The finest technological defenses can be undermined by uninformed users. Regular and updated cybersecurity training sessions are invaluable. Simulating real-world phishing and ransomware attacks can provide insights into user behavior, enabling tailored training approaches. An educated user base acts as vigilant sentinels, often spotting and reporting potential threats before they escalate."
    },
    {
        "link": "https://compudata.com/5-essential-cybersecurity-strategies-to-keep-your-smb-protected",
        "document": "Small and medium-sized businesses (SMBs) face unique cybersecurity challenges, which often make them prime targets for cyberattacks. Limited budgets, outdated systems, and longer technology refresh cycles create security gaps that cybercriminals are quick to exploit.\n\nThe good news? Securing your business doesn’t have to be overwhelming. With the right strategy and a trusted technology provider, you can strengthen your defenses, minimize risks, and build long-term resilience—without disrupting daily operations.\n\nIn this blog, we’ll cover 5 cybersecurity strategies to help your SMB stay protected.\n\nOutdated technology is one of the biggest security risks for SMBs. Many businesses rely on legacy systems that are essential to daily operations, but these platforms often run on unsupported software, leaving them vulnerable to cyberattacks.\n\nWhile replacing legacy systems isn’t always a quick process, you don’t have to leave them exposed. A practical solution is sandboxing—which involves isolating older systems from your main network to minimize risk while keeping them operational.\n\nFor example, if your business relies on an outdated accounting system that can’t be upgraded immediately, keeping it connected to your primary network could put sensitive financial data at risk. Instead, placing it in a secure, restricted environment ensures only authorized users can access it, reducing exposure until a migration plan is in place.\n\nSince legacy systems remain critical to daily operations, implementing this approach can be complex. Working with a technology provider ensures these systems stay secure and accessible, helping you transition smoothly to newer platforms without disruption.\n\nSMBs operating across multiple locations often rely on VPNs to connect networks and facilitate data sharing. While these connections improve efficiency, they also introduce security risks. If a hacker gains access to one location, they can move laterally across the entire network, potentially compromising sensitive data or disrupting operations.\n\nTo strengthen security, you should firewall traffic between locations. Instead of leaving networks open, deny all traffic by default and only allow necessary, approved connections. This limits the impact of a breach and prevents cybercriminals from moving freely across your entire network.\n\nMany businesses overlook this crucial step, so partnering with an expert is key. An experienced partner can assess network vulnerabilities and implement a segmented security approach to minimize risk across your locations.\n\nEmail is one of the most common attack vectors for cybercriminals. Phishing scams and malicious attachments often bypass traditional email filters, leaving your end-users as your last line of defense.\n\nOlder email filtering systems rely on static databases of known threats, scanning attachments and links against predefined blacklists. The issue is that cybercriminals are constantly evolving their tactics—new phishing links can slip through traditional filters if they haven’t yet been flagged as malicious.\n\nAI-powered email security solutions offer a smarter, more adaptive defense for your business. Instead of simply matching links and attachments to a blacklist, these advanced systems analyze email behavior, sender patterns, and contextual clues to detect suspicious activity. AI-driven filters can spot anomalies like emails sent at unusual times, messages with inconsistent language, or login attempts from unexpected locations.\n\nAdditionally, traditional email filters often block legitimate emails to avoid risks, leading to employee frustration. With AI-driven filtering, you can block phishing attempts, reduce false positives, and enhance overall email security.\n\nPasswords remain one of the weakest links in cybersecurity. They can be easily stolen, guessed, or exposed through phishing attacks. Once an attacker gains access to login credentials, they can move freely through your organization’s network.\n\nTo address this, many businesses are adopting passwordless authentication methods, which eliminates the need for traditional passwords. Instead, you can use biometric authentication (fingerprint or facial recognition), smart cards, or passkeys tied to physical devices. These methods significantly reduce the risk of hackers gaining access, as there’s no password to steal.\n\nWhile transitioning to passwordless authentication may seem daunting, working with a technology provider can help develop a phased roadmap for implementation. This roadmap involves assessing your current authentication systems, determining the right passwordless solutions for your needs, and gradually introducing them across your organization. A strategic approach ensures minimal disruption, smooth integration with existing systems, and ongoing employee training to facilitate a seamless transition.\n\nMany SMBs trust third-party providers for backups but fail to assess whether the strategy truly meets their needs. A common mistake is assuming that backups occur frequently enough to restore critical data during an attack, only to discover their recovery options are limited when an incident occurs.\n\nTo prevent this, you must regularly review your backup and recovery policies. Understanding how often backups are made and how quickly data can be restored is crucial to ensuring recovery meets your business needs. For example, if a breach requires rolling back data from an hour ago, but backups are only taken once a day, this gap in protection can become a serious issue.\n\nYour business should reevaluate backup strategies annually to ensure recovery timeframes are realistic and that all critical functions are protected. Instead of leaving full control to an IT provider, it’s important to actively participate in defining and adjusting backup requirements.\n\nProtect Your Business with the Right Partner\n\nMany businesses hesitate to invest in cybersecurity due to concerns about cost, complexity, or potential disruptions. However, the biggest risk is doing nothing—cyber threats can lead to financial losses, downtime, and reputational damage.\n\nPartnering with a trusted technology provider lets you focus on running your business while ensuring your security needs are met. The right partner understands that SMBs need practical, cost-effective solutions that don’t compromise on protection.\n\nFor over 50 years, CBIZ CompuData has delivered tailored security solutions designed to meet the unique needs of SMBs. Our expert team works to keep your business secure with strategies that align with your budget and operational goals.\n\nReady to secure your SMB from cyber threats? Contact CBIZ CompuData today for a free security audit and take the first step toward protecting your business!"
    },
    {
        "link": "https://docs.rapid7.com/insightvm/configuring-scan-credentials",
        "document": "Scanning with credentials allows you to gather information about your network and assets that you could not otherwise access. You can inspect assets for a wider range of vulnerabilities or security policy violations. Additionally, authenticated scans can check for software applications and packages and verify patches. When you scan a site with credentials, target assets in that site authenticate the Scan Engine as they would an authorized user.\n\nTopics in this section explain how to set up and test credentials for a site as well as shared scan credentials, which you can use in multiple sites. Certain authentication options, such as SSH public key and LM/NTLM hash, require additional steps, which are covered in related topics. You can also learn best practices for getting the most out of credentials, such as expanding authentication with elevated permissions.\n\nTwo types of scan credentials can be created in the application, depending on the role or permissions of the user creating them:\n• Shared credentials can be used in multiple sites\n• Site-specific credentials can only be used in the site for in which they are configured\n\nThe range of actions that a user can perform with each type depends on the user’s role or permissions, as indicated in the following table:\n\nThe application uses an expert system at the core of its scanning technology in order to chain multiple actions together to get the best results when scanning. For example, if the application is able to use default configurations to get local access to an asset, then it will trigger additional actions using that access. The Vulnerability Management and Expert Systems blog outlines the benefits of this approach and can be found here: Vulnerability Management and Expert Systems. The effect of the expert system is that you may see scan results beyond those directly expected from the credentials you provided; for example, if some scan targets cannot be accessed with the specified credentials, but can be accessed with a default password, you will also see the results of those checks. This behavior is similar to the approach of a hacker and enables to find vulnerabilities that other scanners may not."
    },
    {
        "link": "http://docs.rapid7.com/nexpose/configuring-scan-credentials",
        "document": "Scanning with credentials allows you to gather information about your network and assets that you could not otherwise access. You can inspect assets for a wider range of vulnerabilities or security policy violations. Additionally, authenticated scans can check for software applications and packages and verify patches. When you scan a site with credentials, target assets in that site authenticate the Scan Engine as they would an authorized user.\n\nTopics in this section explain how to set up and test credentials for a site as well as shared scan credentials, which you can use in multiple sites. Certain authentication options, such as SSH public key and LM/NTLM hash, require additional steps, which are covered in related topics. You can also learn best practices for getting the most out of credentials, such as expanding authentication with elevated permissions.\n\nTwo types of scan credentials can be created in the application, depending on the role or permissions of the user creating them:\n• Shared credentials can be used in multiple sites\n• Site-specific credentials can only be used in the site for in which they are configured\n\nThe range of actions that a user can perform with each type depends on the user’s role or permissions, as indicated in the following table:\n\nThe application uses an expert system at the core of its scanning technology in order to chain multiple actions together to get the best results when scanning. For example, if the application is able to use default configurations to get local access to an asset, then it will trigger additional actions using that access. The Vulnerability Management and Expert Systems blog outlines the benefits of this approach and can be found here: Vulnerability Management and Expert Systems. The effect of the expert system is that you may see scan results beyond those directly expected from the credentials you provided; for example, if some scan targets cannot be accessed with the specified credentials, but can be accessed with a default password, you will also see the results of those checks. This behavior is similar to the approach of a hacker and enables to find vulnerabilities that other scanners may not."
    },
    {
        "link": "https://exclusive-networks.com/ie/wp-content/uploads/sites/19/2021/07/The-Essential-Guide-to-SIEM.pdf",
        "document": ""
    },
    {
        "link": "https://docs.datadoghq.com/getting_started/cloud_siem",
        "document": "Datadog Cloud SIEM detects real-time threats to your application and infrastructure. These threats can include a targeted attack, a threat intel listed IP communicating with your systems, or an insecure configuration. Once detected, a signal is generated and a notification can be sent out to your team.\n\nThis guide walks you through best practices for getting started with Cloud SIEM.\n• None Configure log ingestion to collect logs from your sources. Review Best Practices for Log Management. You can use out-of-the-box integration pipelines to collect logs for more than 850 integrations, or create custom log pipelines to send:\n• None Select and configure Content Packs, which provide out-of-the-box content for critical security log sources.\n• None Select and configure additional log sources you want Cloud SIEM to analyze.\n• None If the Cloud SIEM setup page shows the warning “The Cloud SIEM index is not in the first position”, follow the steps in the Reorder the Cloud SIEM index section.\n• None Confirm the modal title says “Move cloud-siem-xxxx to…” and that the text in the index column is light purple.\n• To select the new placement of your index, click the top line of the index where you want to go. For example, if you want to make the index the first index, click on the line above the current first index. The new position is highlighted with a thick blue line.\n• None The text confirms the position selected: “Select the new placement of your index: Position 1”. Click Move.\n• None Review the warning text. If you are satisfied with the change, click Reorder.\n• None Review the index order and confirm that the index is where you want it. If you want to move the index, click the Move to icon and follow steps 3 to 5.\n\nThe Cloud SIEM index should be in the first index position now. If the setup page still displays a warning about the index position, wait a few minutes and refresh the browser.\n\nAfter the index is moved to the first index position, review the settings and statuses for the Content Packs and other log sources. For each integration that shows a warning or an error, click on the integration and follow the instructions to fix it.\n• None Review the out-of-the-box detection rules that begin detecting threats in your environment immediately. Detection rules apply to all processed logs to maximize detection coverage. See the detection rules documentation for more information.\n• None Explore security signals. When a threat is detected with a detection rule, a security signal is generated. See the security signals documentation for more information.\n• Set up notification rules to alert when signals are generated. You can alert using Slack, Jira, email, webhooks, and other integrations. See the notification rules documentation for more information.\n• Subscribe to the weekly threat digest reports to begin investigation and remediation of the most important security threats discovered in the last seven days.\n• Explore the Investigator for faster remediation. See the Investigator documentation for more information.\n• Use out-of-the-box-dashboards or create your own dashboards for investigations, reporting, and monitoring."
    },
    {
        "link": "https://docs.tenable.com/vulnerability-management/Content/Scans/AddCredentialToScan.htm",
        "document": "In the event that a scan contains multiple instances of a single type of credential (SSH logins, SMB logins, etc.), Tenable Vulnerability Management attempts to use them on a valid target in the order that they were added to the scan configuration.\n\nNote: The first credential that allows successful login is used to perform credentialed checks on the target. After a credential provides successful login, Tenable Vulnerability Management does not try any of the other credentials in the list, even if one of the latter credentials has a greater degree of access or privileges.\n• The Credentials page appears. This page contains a table of credentials configured for the scan.\n• Next to Add Credentials, click the button.\n• Do one of the following: The Managed Credentials section of the Select Credential Type plane contains any credentials where you have Can Use or Can Edit permissions.\n• None (Optional) Search for a managed credential in the list by typing your search criteria in the text box and clicking the button.\n• In the Managed Credentials section, click the button to display all managed credentials.\n• None Click each managed credential you want to add.\n• To close the Select Credential Type plane, click the button in the upper-right corner of the plane.\n• In the Select Credential Type plane, in any section except Managed Credentials, click the button to display the credentials for that type.\n• None Click each credential you want to add. The settings plane for that credential type appears.\n• Configure the settings for the individual credential configuration.\n• In any section of the Select Credential Type plane except the Managed Credentials section, click the button to display the credentials for that type.\n• None Click each credential you want to add. The settings plane for that credential type appears.\n• Configure the settings for the new managed credential.\n• In the first text box, type a name for the managed credential.\n• (Optional) In the second text box, type a brief description of the managed credential.\n• Click Save to save your credential changes. Tenable Vulnerability Management closes the settings plane and adds the credential to the credentials table for the scan. Note: Upon saving, Tenable Vulnerability Management automatically orders the credentials by ascending ID and groups the credentials by type.\n• Do one of the following:\n• If you want to save without launching the scan, click Save.\n• If you want to save and launch the scan immediately, click Save & Launch. Note: If you scheduled the scan to run at a later time, the Save & Launch option is not available. Note: If you are editing an imported scan, the Save & Launch option is not available."
    }
]