[
    {
        "link": "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/route_ws2008",
        "document": "Displays and modifies the entries in the local IP routing table. If used without parameters, route displays help at the command prompt.\n• None Large values in the metric column of the routing table are the result of allowing TCP/IP to automatically determine the metric for routes in the routing table based on the configuration of IP address, subnet mask, and default gateway for each LAN interface. Automatic determination of the interface metric, enabled by default, determines the speed of each interface and adjusts the metrics of routes for each interface so that the fastest interface creates the routes with the lowest metric. To remove the large metrics, disable the automatic determination of the interface metric from the advanced properties of the TCP/IP protocol for each LAN connection.\n• None Names can be used for destination if an appropriate entry exists in the local Networks file stored in the folder. Names can be used for the gateway as long as they can be resolved to an IP address through standard host name resolution techniques such as Domain Name System (DNS) queries, use of the local Hosts file stored in the folder, and NetBIOS name resolution.\n• None if the command is print or delete, the gateway parameter can be omitted and wildcards can be used for the destination and gateway. The destination value can be a wildcard value specified by an asterisk . If the destination specified contains an asterisk or a question mark (?), it's treated as a wildcard, and only matching destination routes are printed or deleted. The asterisk matches any string, and the question mark matches any single character. For example, , , and are all valid uses of the asterisk wildcard.\n• None Using an unsupported combination of a destination and subnet mask (netmask) value displays a \"Route: bad gateway address netmask\" error message. This error message appears when the destination contains one or more bits set to 1 in bit locations where the corresponding subnet mask bit is set to 0. To test this condition, express the destination and subnet mask using binary notation. The subnet mask in binary notation consists of a series of 1 bits, representing the network address portion of the destination, and a series of 0 bits, representing the host address portion of the destination. Check to determine whether there are bits in the destination that are set to 1 for the portion of the destination that is the host address (as defined by the subnet mask).\n\nTo display the entire contents of the IP routing table, type:\n\nTo display the routes in the IP routing table that begin with 10, type:\n\nTo add a default route with the default gateway address of 192.168.12.1, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0 and the next hop address of 10.27.0.1, type:\n\nTo add a persistent route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0 and the next hop address of 10.27.0.1, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, the next hop address of 10.27.0.1, and the cost metric of 7, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, the next hop address of 10.27.0.1, and using the interface index 0x3, type:\n\nTo delete the route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, type:\n\nTo delete all routes in the IP routing table that begin with 10, type:\n\nTo change the next hop address of the route with the destination of 10.41.0.0 and the subnet mask of 255.255.0.0 from 10.27.0.1 to 10.27.0.25, type:"
    },
    {
        "link": "https://howtogeek.com/22/adding-a-tcpip-route-to-the-windows-routing-table",
        "document": "In some specific types of environments, you might find it useful to add a static route to the routing table. Here's how to go about it in Windows 10 and Windows 11.\n\nA routing table dictates where all packets go when they leave a system — whether that system is a physical router or a PC. Most routers — including the one built into your Windows PC — use some form of dynamic routing, where the router is capable of selecting the best place to forward packets based on information it gets from other routers. You can see it at work if you use the traceroute command to watch the connections a packet makes as it reaches it's final destination.\n\nMost routers also allow you to add a static route (one that doesn't get dynamically updated) if you want to always forward certain traffic to a specific router or gateway. Why? Well, most people using Windows in their home or small business probably won't — but this can be useful under certain circumstances, such as:\n• You have two internet connections — maybe one for regular use and one for connecting to a work network — and you want all traffic to a certain IP address range to go out over one of those connections.\n• You have set up multiple subnets on your network and need to direct traffic to a particular subnet. Static routes can be particular useful in testing these types of environments.\n• You're actually using a Windows PC as a router for your network and you want finer control over it.\n\nIf any of those apply to you, read on. You'll need to dive into the Command Prompt to add a static route to the Windows routing table, but it's easy and we'll walk you through the steps.\n\nBefore you get started adding routes, it may be helpful to view the routing table first. Fire up Command Prompt or PowerShell by hitting Windows+X and then selecting \"PowerShell (Admin)\" or \"Command Prompt (Admin) on the Power Users menu.\n\nIn the Command Prompt or PowerShell, type the following command and hit Enter:\n\nYou'll see a long list of network destinations and the gateways to which packets are forwarded when they are headed to that destination. Unless you've already added static routes to the table, everything you see here will be dynamically generated.\n\nTo add a static route to the table, type a command using the following syntax:\n\nThe and components are optional to the command. If you don't specify a subnet mask, 255.255.255.0 will be used automatically. If you don't specify a metric cost, a cost one greater than the 0.0.0.0 destination entry will be used. The metric cost value is just a cost that is relative to other costs in the table and is used when Windows decides between multiple routes that could reach the same destination.\n\nSo, for example, if you wanted to add a route specifying that all traffic bound for the 192.168.35.0 subnet went to a gateway at 192.168.0.2 and you just wanted to use the automatic metric cost, you would use the following command:\n\nIf you were to use the command to look at the table now, you'd see your new static route.\n\nThat's all easy enough, but there is one extra little catch. When you add a static route, by default it only lasts until the next time you start Windows. The reason for this is that many companies use a coordinated list of static routes that gets updated fairly often. Rather than adding and updating all those routes on every machine, they just distribute a batch script file that adds the newest routes during Windows startup. This keeps the routing table relatively uncluttered.\n\nYou could certainly use the batch script method yourself. Writing batch scripts isn't hard. But if you're just adding one or two static routes that you don't expect to change often, you can instead just add the option to the command to make the route persistent. A persistent route stays in place even when Windows starts up. Using the same command we used earlier, you could make that route persistent with the following modification:\n\nOf course, there will come a time you might want to remove a static route from your table. All you have to do is type a command using the following syntax:\n\nSo, to delete the route we created earlier with the destination network 192.168.35.0, all we'd have to do is type this command and hit Enter:\n\nYes, using static routes is a bit esoteric when it comes to managing most home and small business networks. But if you do need to do it, it's a pretty easy process. And if you don't need to do it right now, at least you know it's an option in the future."
    },
    {
        "link": "https://serverfault.com/questions/897327/how-do-i-add-a-static-route-in-windows",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://action1.com/blog/how-to-how-to-add-or-remove-static-route-on-windows-systems",
        "document": "In part 1 of \"Getting the Most Out of Action1 with PSAction1,\" we explored how to interact with Action1 via the API and PSAction1. Now, let’s look even further into how much..."
    },
    {
        "link": "https://learn.microsoft.com/en-us/answers/questions/61541/add-route-on-windows",
        "document": "To add a static route to the table, you’ll type a command using the following syntax:\n\nroute add destination_network MASK subnet_mask gateway_ip metric_cost \n\n So if you wanted to add a route specifying that all traffic bound for the 192.168.151.0 subnet went to a gateway at 192.168.8.1 and you just wanted to use the automatic metric cost, you would use the following command:\n\nThen you could use the route print command to look at the table , you’d see your new static route.\n\nFor more details, you could refer to the following article:\n\nPlease Note: Since the web site is not hosted by Microsoft, the link may change without notice. Microsoft does not guarantee the accuracy of this information.\n\nAfter adding a static route it will be active until the next restart of your Windows PC. To make the route persistent just add the -p option to the command."
    },
    {
        "link": "https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/route_ws2008",
        "document": "Displays and modifies the entries in the local IP routing table. If used without parameters, route displays help at the command prompt.\n• None Large values in the metric column of the routing table are the result of allowing TCP/IP to automatically determine the metric for routes in the routing table based on the configuration of IP address, subnet mask, and default gateway for each LAN interface. Automatic determination of the interface metric, enabled by default, determines the speed of each interface and adjusts the metrics of routes for each interface so that the fastest interface creates the routes with the lowest metric. To remove the large metrics, disable the automatic determination of the interface metric from the advanced properties of the TCP/IP protocol for each LAN connection.\n• None Names can be used for destination if an appropriate entry exists in the local Networks file stored in the folder. Names can be used for the gateway as long as they can be resolved to an IP address through standard host name resolution techniques such as Domain Name System (DNS) queries, use of the local Hosts file stored in the folder, and NetBIOS name resolution.\n• None if the command is print or delete, the gateway parameter can be omitted and wildcards can be used for the destination and gateway. The destination value can be a wildcard value specified by an asterisk . If the destination specified contains an asterisk or a question mark (?), it's treated as a wildcard, and only matching destination routes are printed or deleted. The asterisk matches any string, and the question mark matches any single character. For example, , , and are all valid uses of the asterisk wildcard.\n• None Using an unsupported combination of a destination and subnet mask (netmask) value displays a \"Route: bad gateway address netmask\" error message. This error message appears when the destination contains one or more bits set to 1 in bit locations where the corresponding subnet mask bit is set to 0. To test this condition, express the destination and subnet mask using binary notation. The subnet mask in binary notation consists of a series of 1 bits, representing the network address portion of the destination, and a series of 0 bits, representing the host address portion of the destination. Check to determine whether there are bits in the destination that are set to 1 for the portion of the destination that is the host address (as defined by the subnet mask).\n\nTo display the entire contents of the IP routing table, type:\n\nTo display the routes in the IP routing table that begin with 10, type:\n\nTo add a default route with the default gateway address of 192.168.12.1, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0 and the next hop address of 10.27.0.1, type:\n\nTo add a persistent route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0 and the next hop address of 10.27.0.1, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, the next hop address of 10.27.0.1, and the cost metric of 7, type:\n\nTo add a route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, the next hop address of 10.27.0.1, and using the interface index 0x3, type:\n\nTo delete the route to the destination 10.41.0.0 with the subnet mask of 255.255.0.0, type:\n\nTo delete all routes in the IP routing table that begin with 10, type:\n\nTo change the next hop address of the route with the destination of 10.41.0.0 and the subnet mask of 255.255.0.0 from 10.27.0.1 to 10.27.0.25, type:"
    },
    {
        "link": "https://thesolving.com/server-room/how-to-configure-static-routes-to-route-traffic-through-a-specific-gateway",
        "document": "Sometimes you may need to route traffic through a specific gateway only for destinations matching a group of IPs or a subnet.\n\nStatic routes are usually configured at the router level but you can also configure them locally, from the Windows command prompt.\n\nThe operation is quite easy, you won’t miss the GUI. In our example we are using Windows Server 2012 R2, but you can do the same with any version of Windows.\n\nFirst of all, let’s see our routing table with the command :\n\nWe can see Internet traffic (identified by destination 0.0.0.0 and mask 0.0.0.0) is routed through the gateway 192.168.0.1 while the subnet 192.168.0.0/24 is directly connected (On-Link).\n\nNow it’s time to create a static route. We will send traffic directed to the IP address 1.1.1.1 through the alternative gateway 192.168.0.254.\n\nWe need to use the command of the CMD prompt. Here’s a description of the parameters:\n• Destination: specifies an IP address, a hostname or the host\n• Subnetmask: specifies a subnetmask associated to the route (if not specified the value is 255.255.255.255)\n• Gateaway: specifies the IP address of the gateway\n• Cost: specifies an integer value between 1 and 9,999 for cost measurement (if not specified the value is 1)\n• Interface: specifies the interface used for the route (if not specified it will be based upon the IP address)\n\nIn our example we sent the command as following:\n\nThe -p parameter specifies the configuration is permanent:\n\nWith another we can check if the static route has a metric value lower than the other ones (higher priority):\n\nUsing the command we can check if the static route is working:\n\nYou can delete the route any time with the command :"
    },
    {
        "link": "https://superuser.com/questions/1292126/a-particular-use-of-route-command-in-windows-local-route",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    },
    {
        "link": "https://community.spiceworks.com/t/ip-route-to-one-ip-address/235618",
        "document": "not a spiceworks question but basically instead of adding a route like this example - 10.10.10.0 - is the new network range i want to gain access to 255.255.255.0 - is the mask of the new network range 192.168.1.12 - is the gateway im going out of to get to the new network range but can i add just a specific ip address to the table ie like this 172.1.1.254 - thats the tmg server i want to point traffic to 255.255.255.255 - i think thats right just the one machine 192.168.1.254 - the gateway i want to go out of to access that specfic ip address\n\nYou want all the machines in your subnet to do this or just the one you’re on? Your route statement looks fine for the single machine getting to the destination.\n\nobviously that route add is for the switch to see the tmg in that first question i wrote, i just need to change the gateways for the different vlans (networks) i have - and now for the tmg to point to the switch it will look like this, the tmg has 2 nics one for the LAN and WAN for the LAN network with a gateway address of 172.1.1.253 Network 1 - 192.168.1.0 (Network 1) 255.255.255.0 (mask) 172.1.1.254 or 253 (should this be the gateway of the server range or the TMG IP) really sorry for the long reply just bit confusing thats all thanks alot for your help, your great\n\nThis will only let the PC know how to get to the TMG server. It will not send all internet requests to the TMG server. For this you would need to either ensure the TMG server is the default route or use proxy settings.\n\nobviously that route add is for the switch to see the tmg in that first question i wrote, i just need to change the gateways for the different vlans (networks) i have - For me the most confusing thing is that you seem to be trying to configure your network using a command on the PC. I’m not terribly familiar with IOS commands, but the route command you listed appears to me to be for the workstation you are on, not the switch itself. The switch isn’t really the way to go, either, you need to get into the router and configure it to forward packets from one network to another. If the router isn’t configured to allow this, then your command on the local workstation won’t work, either."
    },
    {
        "link": "https://serverfault.com/questions/144582/static-route-toward-a-dns-address-it-is-possible",
        "document": "Stack Exchange network consists of 183 Q&A communities including Stack Overflow, the largest, most trusted online community for developers to learn, share their knowledge, and build their careers."
    }
]