[
    {
        "link": "https://docs.uipath.com/activities/other/latest/productivity%22/excel-application-scope",
        "document": "Design and create your own automations with UiPath Studio Web, whatever your level of expertise. Start automating now!"
    },
    {
        "link": "https://forum.uipath.com/t/excel-application-scope-name-excel-file/249032",
        "document": "The UiPath Documentation Portal - the home of all our valuable information. Find here everything you need to guide you in your automation journey in the UiPath ecosystem, from complex installation guides to quick tutorials, to practical business..."
    },
    {
        "link": "https://docs.uipath.com/activities/other/latest/productivity%22/excel-process-scope-x",
        "document": "Design and create your own automations with UiPath Studio Web, whatever your level of expertise. Start automating now!"
    },
    {
        "link": "https://forum.uipath.com/t/how-to-keep-excel-file-open-after-excel-application-scope-activity/251324",
        "document": "I have come across a requirement to keep the excel open after Excel Application Scope activity is completed, as per the solution I have created a variable in properties>output>workbook with type WorkbookApplication but it did not work, this is the solution mentioned in the document of this activity as well. Need help, thanks in advance\n\nAfter completion of the excel application scope you could use an “Open Application” activity. Excel application scope is run in the background which is why it doesn’t keep the application open. If you use this activity and supply it the same file path it would open the file you just worked on.\n\n@JosephNehl\n\n Thanks, but how to read the data from excel now? we can’t use the excel activities to read the file, is there any other way to read and use the data?\n\nThere are some read ranges outside of the scope that may work. search for read range, use the one found under:"
    },
    {
        "link": "https://docs.uipath.com/ACTIVITIES/other/latest/productivity/excel-application-card",
        "document": "Design and create your own automations with UiPath Studio Web, whatever your level of expertise. Start automating now!"
    },
    {
        "link": "https://docs.uipath.com/activities/other/latest/workflow/input-dialog",
        "document": "Design and create your own automations with UiPath Studio Web, whatever your level of expertise. Start automating now!"
    },
    {
        "link": "https://forum.uipath.com/t/input-dialog-in-studio-web/538327",
        "document": "Maybe you can use Set Variable value activity at the top and user can enter their value\n\nYou can create an asset and load…instead of dailog as studio web does not have a dialog… If a user interface is needed then you can create a small app with only one input and link the process to it\n\nWould you mind sharing your use case with us? At which point in your process would you like to have user input?\n\nI see! This is unfortunately not yet possible.\n\n For some context - even though Studio Web current focus is on unattended scenarios, we are gathering all the feedback around use cases involving user interaction and we are looking into making it happen. However, if I may ask an additional question. How would you like to ideally be able to interact with your process? Thus, for example - would you see it more like an actual chatbot-like interaction with the process, or would it be more similar to how the UiPath Assistant currently allows you to pass an input argument before running the process with said parameter?\n\nhi @loginerror , for this case it can be a chatbot like interaction as the user may have multiple interactions. However, having said this, for some other processes having the inputs via UiPath Assistant will make sense wherein the process needs an initial input from the user.\n\nfor some other processes having the inputs via UiPath Assistant will make sense wherein the process needs an initial input from the user. Then the good news is that for the UiPath Assistant scenario, it is already possible. You can publish a process from Studio Web and said process will end up published to your personal workspace, and by extension, it will be instantly visible in your UiPath Assistant. Would you mind sharing what processes would you like to automate this way? (it helps us see what we can improve). And as to the second question: for this case it can be a chatbot like interaction as the user may have multiple interactions Are the prompts you would like to make more conversational in nature? If so, what types of scenarios do you foresee such functionality being most helpful with?\n\nHi @loginerror , Thanks for your response. I understand that the process will be available on my UiPath assistant , but will I also be able to take input form the user? As I mentioned I am using this for the Chat GPT interaction process and we may have similar requirement for getting user input for processing by Chat GPT.\n\n For the second point, yes the prompts will be conversational in nature. I might ask , let me know the pending stocks in my inventory. How many of them are of type X or Y , how soon they can be delivered etc."
    },
    {
        "link": "https://forum.uipath.com/t/how-to-take-user-input-through-the-input-dialog-activity-and-then-pass-it-to-a-click-activity/335490",
        "document": "I want a user to select some input through dialog then and get that input locate on the UI element then click on it.\n• Fetch result of this activity under a variable\n• Use click activity, identify selector of that element where this text would show up, modify that selector’s aaname with variable fetched from step 2(or can be another tag, please check in selector, which attribute contains that value).\n• Input Dialog ->After storing the value in the variable(Eg:Demo)\n• open UI Explorer in Click Activity and indicate on screen and check for “text” or “innertext” in the attributes\n• Right click on the value and choose variable as you have created in the starting if not choose create variable and create a new one 4.As you remember this is the variable i have created so choosing this\n• After Selecting it will become like his and works dynamically\n\nThe solution has worked for me.\n\nSo kindly close the topic by marking it as solution\n\nIndeed it will be happy automation with such kind of support\n\nThis topic was automatically closed 3 days after the last reply. New replies are no longer allowed."
    },
    {
        "link": "https://forum.uipath.com/t/input-dialog-box/177725",
        "document": "Hi,\n\n Is there a way to create the drop down options for Input dialog box from a list? For example, I collect all the folder names in a list and the input dialog box enables user to select a folder from the options of all folder names displayed in a dropdown.\n\n Thank you.\n\n Yashasri.\n\nYes, there are ways for create drop down options for an input dialog box.\n\n UiPath has these relatively new Forms Activities - Now in Public Preview!\n\n You can build your own form for an input dialog and specify e.g. a drop-down-menu. You will need the UiPath.Form.Activities package\n\nIt might also be possible with the Custom Input activity, but you’ll have to design the form in HTML yourself. Could be a bit more tricky than the Forms Builder.\n\nThanks Lukas.\n\n The problem is that I don’t have admin rights to my system. Any other way to do so?\n\nThe thing is I would like to collect folder names and display them as options. The options list is dynamic in my use-case I can’t be certain of the options like “Yes”, “No”, etc.\n\nI have used path.getfilenames(“xxx”) to collect file names. I want the file names to be displayed as options. Can I give a variable of Sysytems.String type in the options such that I get a dropdown menu with files names?\n\nYes, In Properties Window of Input Dialog their is an Options which takes list of string as an input. For demo purpose you can follow the link provided below."
    },
    {
        "link": "https://forum.uipath.com/t/for-each-array-and-input-dialog/576315",
        "document": "I have three centers where you can view data with my bot, I need the user to be able to select a center using an input dialog and then have the selection used to hold an array that the bot will iterate through. The center name will hold an array of the employee names for that center. I then am using a for each to iterate through the names to collect the data. Can someone please show an example of successfully completing this or send me in the right direction? Thank you!\n\nyou have 3 centers will there be any data present in that? then use for each activity and pass the output of inputdialog box\n\nThese are the values, but I believe I am doing it incorrectly. When the user selects a center, I need it to be updated for each center (variable of string containing names).\n\n \n\n \n\n\n\nif the user selected option does not have values then flow this if the input selected options having values then use for each repeat the process for other 2 cases aslo\n\nFor some reason, nothing occurs after the input dialog is chosen. The bot just stops. Could you please look at this code and possibly fix my error or instruct me on my error?\n\n Sequence1.xaml (35.8 KB)"
    },
    {
        "link": "https://forum.uipath.com/t/read-excel-and-convert-to-data-table/230562",
        "document": "I would like to read the data from the excel and convert it to data table first, then I would need to read each row of the data table instead of the excel file by using sth as\n\n row(“column name”).ToString.Trim Does anyone know how could I do this?\n\nYou can use Read Range activity for this, there were 2 Read Range activities, one is use for .xls file and Read Range activity in WorkBook will be useful for .xlsx If your excel file is .xlsx then there is no use of application scope, else you need to put Read Range in Excel application Scope You can use For Each Row with and mention you Datatable name\n\n@Srini84\n\n Thanks for the response.\n\n May I confirm after I use read range, does it has been automatically converted to datatable? Do I still need to use activity like build datatable or generate datatable before proceed to using for each row?\n\n As I would like to ensure if the RPA programme lost connnection with the excel file, the programme would still work in that case.\n\nDo I still need to use activity like build datatable or generate datatable before proceed to using for each row? It is not required to use any other activities, Read range will output as a Datatable, all you need to do is just mention the range after that you are fine to use For each Row to iterate inside the Datatable Mark as solution if this helps"
    },
    {
        "link": "https://forum.uipath.com/t/how-to-build-data-table-from-excel-as-it-is-automatic-in-uipath/543975",
        "document": "Explore our comprehensive course on DataTables and Excel automation with Studio and learn common methods of data manipulation for the DataTable type."
    },
    {
        "link": "https://youtube.com/playlist?list=PLXXz88_TPiHp_1N1pRURUpXnEt_quLyag",
        "document": ""
    },
    {
        "link": "https://stackoverflow.com/questions/67459651/uipath-how-to-add-data-from-different-excel-sheets",
        "document": "That depends on what you have and what you need. I assume that those 3, 5, and 9 rows are everything in those sheets and nothing else. This is pretty simple. Here are the steps:\n• \n• Create a new global variable called (in the others and )\n• Just into the\n• None Finally, merge all 3 into one, do that with a\n\nIn case the number of sheets of your workbook(s) is/are unknown, simply use which comes out of the box. The idea is as follows:\n\nExcel Application Scope -> GetSheets -> Use Read Range activity and pass item under sheet name and store output in DataTable -> Use Merge DataTable activity to merge all sheets data and pass output of Read Range activity."
    },
    {
        "link": "https://stackoverflow.com/questions/54435637/uipath-iterating-through-excel-file-to-fill-in-datatable-with-read-range-dyna",
        "document": "my question is in principle the same target as Looping on URLs from Excel file using UiPath (in the sense of reading in an Excel File with ReadRange an Iterating through it)\n\nI want to iterate through the excel file - and would of course do this with an Excel Application Scope.. But when I read in a Excel File into a DataTable - I need to give this a range like \"D2:K30\"..\n\nThe \"K30\" would be the end of my range read in - so how do I manage to get the \"end\" of my specific excel file?\n\nWith VBA I would just iterate through the excel file and say something like\n\n, and then i would know when the first EMPTY row appears.\n\nMaybe my first found empty row would be saved in Variable \"emptyRow\" - then I could say\n\nSo my target is to make this Read Range 'dynamically' in the sense of not copying empty rows into the datatable..\n\nBecause furthermore - when I copy that datatable into another excel file - I want to color specific ranges with different colors, therefore I need the specific length of each range, otherwise I will get empty rows colored as well.."
    }
]