[
    {
        "link": "https://geeksforgeeks.org/extract-text-from-pdf-file-using-python",
        "document": "All of you must be familiar with what PDFs are. In fact, they are one of the most important and widely used digital media. PDF stands for Portable Document Format. It uses .pdf extension. It is used to present and exchange documents reliably, independent of software, hardware, or operating system.\n\nWe will extract text from pdf files using two Python libraries, pypdf and PyMuPDF, in this article.\n\nExtracting text from a PDF file using the pypdf library.\n\nPython package pypdf can be used to achieve what we want (text extraction), although it can do more than what we need. This package can also be used to generate, decrypting and merging PDF files. Note: For more information, refer to Working with PDF files in Python\n\nTo install this package type the below command in the terminal.\n\nLet us try to understand the above code in chunks:\n• None We created an object of PdfReader pypdf\n• PdfReader class takes a required positional argument of the path to the pdf file.\n• pages PageObjects . So, here we can use the in-built len() function of python to get the number of pages in the pdf file.\n• reader.pages PageObjects , we can get a specific Page of the pdf by tapping into the index of the page. In python list indexing starts from 0, so reader.pages[0] gives us the first page of the pdf file.\n• extract_text() to extract text from the pdf page.\n\nExtracting text from a PDF file using the PyMuPDF library.\n\nPyMuPDF is a Python library that supports file formats like XPS, PDF, CBR, and CBZ. But for now, in this article, we are going to concentrate on PDF (Portable Document Format) files.\n\nTo extract the text from the pdf, we need to follow the following steps:\n\nNote: We are using the sample.pdf here; to get the pdf, use the link below.\n\nHere we created an object called “doc,” and filename should be a Python string.\n\nHere, we iterated pages in pdf and used the get_text() method to extract each page from the file.\n\nAll the Code to extract the text\n\nWe have seen two Python libraries, pypdf and PyMuPDF, that can extract text from a PDF file. Comment on your preferred library from the above two libraries.\n\nHow Do I Extract Specific Text from a PDF in Python?\n\nExtracting specific text from a PDF in Python can be accomplished using libraries like , , or . These libraries allow you to read and manipulate PDF files, extracting not only the text but also other data like metadata, images, and more. is particularly effective as it offers more precise extraction capabilities and includes support for tables: This will extract and print all the text from the first page of the PDF.\n\nHow to Extract Data from PDF Programmatically?\n\nTo extract data from a PDF programmatically, you can use the library as an alternative, which provides tools to interact with the text and other contents of PDF files: \n\n\n\n \n\n \n\n page = reader.pages[0] # Get the first page \n\n \n\n This script opens a PDF and extracts text from the first page.\n\nHow Do I Read a Specific Part of a Text File in Python?\n\nTo read a specific part of a text file, you can use Python’s built-in file handling functions along with string methods or regular expressions to find and extract the desired part: # Example: Extract lines that contain 'specific keyword' \n\n \n\n\n\n \n\n This reads each line of the text file and prints lines containing ‘specific keyword’.\n\nHow to Extract Text from PDF Using Pytesseract?\n\n, a Python binding for Google’s Tesseract-OCR Engine, can be used to extract text from images or image-based PDFs. To extract text from an image-based PDF using Pytesseract:\n• None to extract text from these images. \n\n\n\n\n\n\n\n \n\n\n\n # Extract text from the first page \n\n \n\n This converts each page of the PDF to an image at 300 DPI (which is good for text recognition) and then extracts text from the first page."
    },
    {
        "link": "https://stackoverflow.com/questions/34837707/how-to-extract-text-from-a-pdf-file-via-python",
        "document": "How can I extract the text as is in the PDF document?\n\nWhen I run the code, I get the following output which is different from that included in the PDF document:\n\nI'm using the PyPDF2 package (version 1.27.2), and have the following script:\n\nI'm trying to extract the text included in this PDF file using Python .\n\npypdf recently improved a lot. Depending on the data, it is on-par or better than . pymupdf / tika / PDFium are better than pypdf, but the difference became rather small - (mostly when to set a new line). The core part is that they are way faster. But they are not pure-Python which can mean that you cannot execute it. And some might have too restrictive licenses so that you may not use it. Have a look at the benchmark. This benchmark mainly considers English texts, but also German ones. It does not include:\n• Anything special regarding tables (just that the text is there, not about the formatting) That means if your use-case requires those points, you might perceive the quality differently. Having said that, the results from November 2022: I became the maintainer of pypdf and PyPDF2 in 2022! 😁 The community improved the text extraction a lot in 2022. Give it a try :-) from pypdf import PdfReader reader = PdfReader(\"example.pdf\") text = \"\" for page in reader.pages: text += page.extract_text() + \"\n\n\" Please note that those packages are not maintained: import fitz # install using: pip install PyMuPDF with fitz.open(\"my.pdf\") as doc: text = \"\" for page in doc: text += page.get_text() print(text)\n\nAfter trying textract (which seemed to have too many dependencies) and pypdf2 (which could not extract text from the pdfs I tested with) and tika (which was too slow) I ended up using from xpdf (as already suggested in another answer) and just called the binary from python directly (you may need to adapt the path to pdftotext): There is pdftotext which does basically the same but this assumes pdftotext in /usr/local/bin whereas I am using this in AWS lambda and wanted to use it from the current directory. Btw: For using this on lambda you need to put the binary and the dependency to into your lambda function. I personally needed to compile xpdf. As instructions for this would blow up this answer I put them on my personal blog.\n\nThis Question so far has 35 answers and not one seems to mention that\n\n the text extracted is the true text from the Questioners PDF page. Nor explained WHY. For comparison here is the RAW PDF code when decompressed (inflated, under the surface, by the PDF viewer). Thus in some cases this is what is extractable The native \"Literal\" plain text. If you study PDF you know that the body text is the bracketed text from above thus we can expect to extract this raw text coding. Compare that with the OP observation So my bad mistake, In my extraction I missed that final (%) So what was the real problem with \"different from that included in the PDF document:\" When raw page text is placed in the page it is binary encoded as numeric data. Which to our human eyes looks like the above separate ANSI letters, but they are encoded in a PDF for simplicity as single bytes. There is a secondary PDFtoText \"ToUnicode\" process where the extractor has to convert the short codes into conventional CALIBRI UTF-8 screen pixels.\n\n Here is that table Most notable in the longer Unicode is, in this case, fistly one on one with more conventional ANSI codes <0000> to <00FF>. However, there is one odd boy out so we can see that is ANSI and Unicode 2019 is so that single 5 on its own, has been isolated as a separate entry. Also what about that odd on its own at the end that I missed, why might that be ? Well look up and it is hex <25> which in a PDF is counted as a comment but in this case converts to \\U+0009 very oddly that is which is usually discarded when building a PDF. Thus usually has no physical width. So using the ToUnicode values in a PDFtoText conversion we can expect it to be post extraction re-coded into This is a sample PDF document I ’ m using to follow along with the tutorial But there seem to be other issues with that source !! (remember all those % characters have no width ?)\n\n We need to fix the file and one very simple fix is replace the tabs with spaces by change 2 bytes from <0009> to <0020>, then resave to rebuild without error. Now extraction should be improved, but do convert with an ANSI to UTF-8 extraction such as.\n\nI am adding code to accomplish this: It is working fine for me: # This works in python 3 # required python packages # tabula-py==1.0.0 # PyPDF2==1.26.0 # Pillow==4.0.0 # pdfminer.six==20170720 import os import shutil import warnings from io import StringIO import requests import tabula from PIL import Image from PyPDF2 import PdfFileWriter, PdfFileReader from pdfminer.converter import TextConverter from pdfminer.layout import LAParams from pdfminer.pdfinterp import PDFResourceManager, PDFPageInterpreter from pdfminer.pdfpage import PDFPage warnings.filterwarnings(\"ignore\") def download_file(url): local_filename = url.split('/')[-1] local_filename = local_filename.replace(\"%20\", \"_\") r = requests.get(url, stream=True) print(r) with open(local_filename, 'wb') as f: shutil.copyfileobj(r.raw, f) return local_filename class PDFExtractor(): def __init__(self, url): self.url = url # Downloading File in local def break_pdf(self, filename, start_page=-1, end_page=-1): pdf_reader = PdfFileReader(open(filename, \"rb\")) # Reading each pdf one by one total_pages = pdf_reader.numPages if start_page == -1: start_page = 0 elif start_page < 1 or start_page > total_pages: return \"Start Page Selection Is Wrong\" else: start_page = start_page - 1 if end_page == -1: end_page = total_pages elif end_page < 1 or end_page > total_pages - 1: return \"End Page Selection Is Wrong\" else: end_page = end_page for i in range(start_page, end_page): output = PdfFileWriter() output.addPage(pdf_reader.getPage(i)) with open(str(i + 1) + \"_\" + filename, \"wb\") as outputStream: output.write(outputStream) def extract_text_algo_1(self, file): pdf_reader = PdfFileReader(open(file, 'rb')) # creating a page object pageObj = pdf_reader.getPage(0) # extracting extract_text from page text = pageObj.extractText() text = text.replace(\"\n\n\", \"\").replace(\"\\t\", \"\") return text def extract_text_algo_2(self, file): pdfResourceManager = PDFResourceManager() retstr = StringIO() la_params = LAParams() device = TextConverter(pdfResourceManager, retstr, codec='utf-8', laparams=la_params) fp = open(file, 'rb') interpreter = PDFPageInterpreter(pdfResourceManager, device) password = \"\" max_pages = 0 caching = True page_num = set() for page in PDFPage.get_pages(fp, page_num, maxpages=max_pages, password=password, caching=caching, check_extractable=True): interpreter.process_page(page) text = retstr.getvalue() text = text.replace(\"\\t\", \"\").replace(\"\n\n\", \"\") fp.close() device.close() retstr.close() return text def extract_text(self, file): text1 = self.extract_text_algo_1(file) text2 = self.extract_text_algo_2(file) if len(text2) > len(str(text1)): return text2 else: return text1 def extarct_table(self, file): # Read pdf into DataFrame try: df = tabula.read_pdf(file, output_format=\"csv\") except: print(\"Error Reading Table\") return print(\"\n\nPrinting Table Content: \n\n\", df) print(\"\n\nDone Printing Table Content\n\n\") def tiff_header_for_CCITT(self, width, height, img_size, CCITT_group=4): tiff_header_struct = '<' + '2s' + 'h' + 'l' + 'h' + 'hhll' * 8 + 'h' return struct.pack(tiff_header_struct, b'II', # Byte order indication: Little indian 42, # Version number (always 42) 8, # Offset to first IFD 8, # Number of tags in IFD 256, 4, 1, width, # ImageWidth, LONG, 1, width 257, 4, 1, height, # ImageLength, LONG, 1, lenght 258, 3, 1, 1, # BitsPerSample, SHORT, 1, 1 259, 3, 1, CCITT_group, # Compression, SHORT, 1, 4 = CCITT Group 4 fax encoding 262, 3, 1, 0, # Threshholding, SHORT, 1, 0 = WhiteIsZero 273, 4, 1, struct.calcsize(tiff_header_struct), # StripOffsets, LONG, 1, len of header 278, 4, 1, height, # RowsPerStrip, LONG, 1, lenght 279, 4, 1, img_size, # StripByteCounts, LONG, 1, size of extract_image 0 # last IFD ) def extract_image(self, filename): number = 1 pdf_reader = PdfFileReader(open(filename, 'rb')) for i in range(0, pdf_reader.numPages): page = pdf_reader.getPage(i) try: xObject = page['/Resources']['/XObject'].getObject() except: print(\"No XObject Found\") return for obj in xObject: try: if xObject[obj]['/Subtype'] == '/Image': size = (xObject[obj]['/Width'], xObject[obj]['/Height']) data = xObject[obj]._data if xObject[obj]['/ColorSpace'] == '/DeviceRGB': mode = \"RGB\" else: mode = \"P\" image_name = filename.split(\".\")[0] + str(number) print(xObject[obj]['/Filter']) if xObject[obj]['/Filter'] == '/FlateDecode': data = xObject[obj].getData() img = Image.frombytes(mode, size, data) img.save(image_name + \"_Flate.png\") # save_to_s3(imagename + \"_Flate.png\") print(\"Image_Saved\") number += 1 elif xObject[obj]['/Filter'] == '/DCTDecode': img = open(image_name + \"_DCT.jpg\", \"wb\") img.write(data) # save_to_s3(imagename + \"_DCT.jpg\") img.close() number += 1 elif xObject[obj]['/Filter'] == '/JPXDecode': img = open(image_name + \"_JPX.jp2\", \"wb\") img.write(data) # save_to_s3(imagename + \"_JPX.jp2\") img.close() number += 1 elif xObject[obj]['/Filter'] == '/CCITTFaxDecode': if xObject[obj]['/DecodeParms']['/K'] == -1: CCITT_group = 4 else: CCITT_group = 3 width = xObject[obj]['/Width'] height = xObject[obj]['/Height'] data = xObject[obj]._data # sorry, getData() does not work for CCITTFaxDecode img_size = len(data) tiff_header = self.tiff_header_for_CCITT(width, height, img_size, CCITT_group) img_name = image_name + '_CCITT.tiff' with open(img_name, 'wb') as img_file: img_file.write(tiff_header + data) # save_to_s3(img_name) number += 1 except: continue return number def read_pages(self, start_page=-1, end_page=-1): # Downloading file locally downloaded_file = download_file(self.url) print(downloaded_file) # breaking PDF into number of pages in diff pdf files self.break_pdf(downloaded_file, start_page, end_page) # creating a pdf reader object pdf_reader = PdfFileReader(open(downloaded_file, 'rb')) # Reading each pdf one by one total_pages = pdf_reader.numPages if start_page == -1: start_page = 0 elif start_page < 1 or start_page > total_pages: return \"Start Page Selection Is Wrong\" else: start_page = start_page - 1 if end_page == -1: end_page = total_pages elif end_page < 1 or end_page > total_pages - 1: return \"End Page Selection Is Wrong\" else: end_page = end_page for i in range(start_page, end_page): # creating a page based filename file = str(i + 1) + \"_\" + downloaded_file print(\"\n\nStarting to Read Page: \", i + 1, \"\n\n -----------===-------------\") file_text = self.extract_text(file) print(file_text) self.extract_image(file) self.extarct_table(file) os.remove(file) print(\"Stopped Reading Page: \", i + 1, \"\n\n -----------===-------------\") os.remove(downloaded_file) # I have tested on these 3 pdf files # url = \"http://s3.amazonaws.com/NLP_Project/Original_Documents/Healthcare-January-2017.pdf\" url = \"http://s3.amazonaws.com/NLP_Project/Original_Documents/Sample_Test.pdf\" # url = \"http://s3.amazonaws.com/NLP_Project/Original_Documents/Sazerac_FS_2017_06_30%20Annual.pdf\" # creating the instance of class pdf_extractor = PDFExtractor(url) # Getting desired data out pdf_extractor.read_pages(15, 23)"
    },
    {
        "link": "https://stackoverflow.com/questions/55767511/how-to-extract-text-from-pdf-in-python-3-7",
        "document": "I am trying to extract text from a PDF file using Python. My main goal is I am trying to create a program that reads a bank statement and extracts its text to update an excel file to easily record monthly spendings. Right now I am focusing just extracting the text from the pdf file but I don't know how to do so.\n\nWhat is currently the best and easiest way to extract text from a PDF file into a string? What library is best to use today and how can I do it?\n\nI have tried using PyPDF2 but everytime I try to extract text from any page using extractText(), it returns empty strings. I have tried installing textract but I get errors because I need more libraries I think.\n\nThis prints empty strings when it should be printing the contents of the page\n\nedit: This question was asked for a very old PyPDF2 version. New versions of PyPDF2 have improved text extraction a lot"
    },
    {
        "link": "https://reddit.com/r/LangChain/comments/1e7cntq/whats_the_best_python_library_for_extracting_text",
        "document": "Hello everyone, I hope you're all doing well! I’m currently on the lookout for a library that can extract text in paragraph chunks from PDFs. For instance, I need it to pull out the Introduction with all its paragraphs separately, the Conclusion with all its paragraphs separately, and so on, essentially chunking the text by paragraphs. Do you have any suggestions? Thanks!"
    },
    {
        "link": "https://medium.com/analytics-vidhya/how-to-easily-extract-text-from-any-pdf-with-python-fc6efd1dedbe",
        "document": "How To Easily Extract Text From Any PDF With Python\n\nData Scientists often have to deal with information contained in PDF’s, although some of them will just copy and paste the data they need, this is a terrible practice, not to say the slowest and least effective way to work in the longterm and depending on the PDF it may not even be possible to do so.\n\nBefore we start, thanks to Carlos Melo — Sigmoidal for allowing me to use fake PDF reports created for his Data Science course, in which I am a student and love it very much. If you don’t know him I highly encourage you to follow him on Instagram, Blog and YouTube, it’s my favourite source of Data Science knowledge.\n\nIf you want to follow along with this project and not just the functions from PDF Plumber, make sure to take a look at my Google Colab Notebook in which I cover everything that I talk about in this post and you can also see the whole project I am referring to.\n\nThe tool we are using in this tutorial is PDF Plumber, an open-source python package, it’s great, simple and powerful.\n\nClick here if you want to check out the PDF I am using in this example.\n\nNow let’s take a look at the main functions PDF Plumber has:\n\nThis function will open the file that you passed the directory as an argument, imagine you had a variable called ‘‘pdf’’ and it contained the directory to a file:\n\nAfter you opened your file, you want to select the page you want to extract the information you’re looking for, let’s say the information you want is on the first page, the index will be 0 because Python starts counting from 0:\n\nImagine you’re reading a book, the first step is to open the book, then you look for the page you want to read and then you read it (i.e extract information from it), Python works the same way.\n\nNow that you’ve opened a page you need to extract the text from it:\n\nIf you call the variable text in a print() statement you would have an output of something like this:\n\nThe print() function recognizes the ‘\n\n’ as a line breaker and ‘\\t’ as a tab, so your text is formatted. By the way, that’s the extracted text I am using to write this post, your output will be different than mine.\n\nHowever, if you just call the variable your output would be:\n\nAnd that’s how you want to start working with your text. Imagine we want the profit value that this file contains, which is ‘1397,00’, we would have to clean this output until we got to ‘1397.00’ as a string and then we’d have to cast it to a float. If you want to see this process step-by-step you can have look at the notebook I made for this project. Anyways, the code would be:\n\nImagine you have lots of files that follow the same pattern of text, you could make a ``for loop`` and then Python would iterate over all of them and return the profit value of each one.\n\nIf you liked this tutorial please share it with your friends and leave a comment on what you liked the most and what I could have done better, don’t forget to add me on LinkedIn and GitHub and don’t hesitate to reach out if you got any question."
    },
    {
        "link": "https://alexa-cox.medium.com/how-building-a-flashcard-app-transformed-my-javascript-skills-47ad15d473e9",
        "document": "If you told me a year ago that I’d be building web apps instead of answering customer service calls, I would’ve laughed in your face. But here I am, knee-deep in JavaScript, transitioning from the world of hospitality to tech, and it’s been one hell of a ride.\n\nTo make sense of this transition and get real, hands-on experience, I decided to tackle a project that would force me to apply what I’m learning: a flashcard web app. It wasn’t just about building something functional — it was about reinforcing my skills and showcasing how far I’ve come as a developer.\n\nIn this post, I’ll take you through the entire process, from the initial idea to the challenges I faced, and the lessons I learned. I’ll also share why this project is perfect for anyone learning JavaScript.\n\nThe Idea Behind the Flashcard App\n\nLet’s be real — when you’re learning something new, especially programming, repetition isn’t enough. You need to actively engage with the material. That’s where the flashcard app comes in.\n\nThe concept is simple: create digital flashcards that let you test and reinforce your knowledge. But for me, the purpose was much bigger. It was about diving deep into JavaScript and making it stick.\n• Add new cards: Create cards with a front and back to make personalized study decks.\n• Store cards locally: Keep your deck intact in your local storage. So that you don’t have to reenter everything each session.\n• Delete or edit cards: Tweak or remove cards as needed.\n• Assign difficulty levels: Tailor the experience with difficulty ratings, making the app adjust to your learning needs.\n• Weighted deck: Cards with harder difficulty show up more often, ensuring the toughest material gets reviewed more often.\n\nBuilding this app wasn’t just about creating a tool — it was about creating an interactive experience. JavaScript isn’t just code on a screen; it’s a way to make something dynamic that responds to user input. Rather than copying and pasting from tutorials, I was engaging with the code and seeing the results in real-time.\n\nWhen I started brainstorming, I knew I wanted the app to be simple yet functional. So, I began by focusing on features like:\n• A smooth user experience where the app adapts to your progress.\n\nThen came the design. I didn’t have much UI/UX experience, so I made a rough wireframe in Canva to visualize the end result. Once I had a basic layout, I moved to coding. Completing this project not only gave me the opportunity to practice my JavaScript, but also gave me the time to work with the Bootstrap framework for once. I also got to learn SASS to add in additional customizations.It meant a slower start, but it helped me focus on mastering the fundamentals.\n\nOne challenge: figuring out where to begin. Should I focus on functionality first — getting the cards to work? Or should I prioritize a polished design from the start? I quickly realized that functionality came first. Once the core features worked, I could tweak the design.\n\nManaging user input and state was tricky, especially with local storage. I needed the data to persist across sessions and track progress. The hardest part was figuring out how to store and retrieve the weighted deck data without overcomplicating things. But it was rewarding once I found an efficient solution.\n\nBuilding this app tested my understanding of core JavaScript concepts, like DOM manipulation and event handling. These aren’t abstract ideas in textbooks anymore — they’re the building blocks of interactive web apps. I had to connect the dots between theory and practice, using arrays to store cards, and managing events to track user actions.\n\nDebugging was tough. One of the hardest bugs involved the weighted deck. I wrote a function to show harder cards more often, but the results weren’t what I expected. For instance, when it first started working I accidentally broke the functionality for adding a card. I spent hours tweaking the logic, testing different solutions, and learning how to break problems down into manageable pieces. This process made me much more comfortable with debugging and troubleshooting.\n\nI ran into UI/UX challenges, especially with responsiveness. I had never used Bootstrap before, and while it sped up some aspects, I still had to manually tweak CSS for finer control. The app wasn’t always responsive on mobile, so I had to adjust the design to ensure it worked across devices.\n\nWhat I Learned Along the Way\n\nBuilding the app deepened my understanding of JavaScript, especially concepts like loops, arrays, and functions. Instead of reading about them or typing from instructions I was forced to think through the logic of when to use them and how to apply them to my needs. The practice made the concepts tangible. For example, iterating through arrays to dynamically generate cards is something I could only truly understand by doing it myself.\n\nThe biggest takeaway from this project? Problem-solving. Unlike tutorials where the solutions are already laid out, this app forced me to break down complex problems into smaller, manageable tasks. Whether it was fixing a bug or adding a feature, I had to figure it out step by step, which is a skill every developer needs.\n\nDebugging was frustrating at times, but it taught me persistence. Patience became key as I spent hours experimenting and testing new approaches. It wasn’t just about finding errors — it was about staying focused and calm, even when things didn’t work.\n\nThis app went through multiple iterations. Each version improved upon the last, and I learned something new every time I tweaked the design or functionality. This iterative process helped reinforce my JavaScript knowledge, showing that building is a journey, not a one-time event.\n\nWhy This Project is Great for JavaScript Learners\n\nIf you’re learning JavaScript, the flashcard app is an excellent project. It touches on nearly every fundamental concept: DOM manipulation, event handling, state management, and more. You’ll work with interactive elements, which is essential for creating dynamic web apps.\n\nWhat I love about this project is that it’s simple enough to start quickly, but complex enough to keep you engaged as you learn. Once you’ve mastered the basics, you can add backend support, introduce a timer, or allow users to share their cards with others. The potential is huge!\n\nYou can create a Minimum Viable Product (MVP) in just a few days, which is a huge confidence boost. Start by getting the flashcards to display and work, then go back and refine the app, adding new features as you progress. This approach gives you immediate feedback and the satisfaction of seeing a working app early on.\n• Start small: Focus on basic functionality first. Get your flashcards working with HTML, CSS, and JavaScript.\n• Iterate: Once you have a working MVP, you can gradually add more features and polish it over time.\n• Expect mistakes: You will mess up, and that’s fine! Mistakes are learning opportunities.\n\nBringing It All Together: Lessons Learned and Next Steps\n\nBuilding this flashcard app wasn’t just about writing code — it was a pivotal moment in my development journey. I went from theory to real-world application, reinforcing my JavaScript skills and problem-solving abilities along the way.\n\nPro tip: Don’t just consume tutorials — dive into projects that force you to apply what you’re learning. It’s one thing to follow a tutorial, but figuring out solutions on your own is where the real learning happens.\n\nI’d love to hear how you would take this flashcard app further. What features would you add? Drop a comment below, and let’s keep this conversation going!"
    },
    {
        "link": "https://reddit.com/r/reactjs/comments/16jujir/need_guidance_on_building_a_flashcards_website",
        "document": "Sorry, this post was deleted by the person who originally posted it."
    },
    {
        "link": "https://geeksforgeeks.org/design-a-math-flashcards-using-html-css-and-javascript",
        "document": "In this article, we will see how to make a flashcard by using HTML, CSS & JavaScript. Here we will build an interactive Introducing Math Flashcards web application, that will help in enhancing mathematical skills like addition, subtraction, multiplication, and division in a playful manner.\n• None Create an HTML structure with elements such as cards for different math operations, a dialog box for displaying flashcards, buttons, and input fields for user answers.\n• None Style the app using CSS to make the app visually appealing.\n• None Attach the event listeners to the buttons corresponding to addition, subtraction, multiplication, and division. When a user clicks a button, the appropriate math operation is selected, and the dialog box is displayed.\n• None Then, we check if the user's answer is correct or not, and based on that we show \"correct\" or \"incorrect\" text.\n\nExample: In this example, we will see the implementation of a math flashcard using HTML, CSS, and Javascript."
    },
    {
        "link": "https://roadmap.sh/projects/flash-cards",
        "document": "The goal of this project is to help you learn about how to use state management and component-based architecture using JavaScript frameworks. You will build a flash card app with pre-defined JavaScript questions and answers that users can flip through to test their knowledge.\n\nYou are required to develop a flash cards app with the following features:\n• Ability to view flashcards one at a time and flip to reveal the answer\n• Simple navigation to cycle through the flashcards\n\nThis project will help you understand how to manage state and create reusable components. You can use any framework of your choice, such as React, Angular, or Vue.js, to build this project."
    },
    {
        "link": "https://reddit.com/r/Anki/comments/10zm2tb/how_to_make_anki_flashcards_with_js",
        "document": "Im displaying kanji characters in my app(react+ts) and I would like to add a function that would allow the user to turn a choice of those kanji into an anki flashcards. Any tips on how I could achieve this ? Thanks"
    }
]