[
    {
        "link": "https://researchgate.net/figure/Manufacturing-Output-in-Various-Countries-1928-1936-1928100_fig1_227355681",
        "document": ""
    },
    {
        "link": "https://statista.com/statistics/1315085/europe-industrialization-index-interwar-period",
        "document": "Zoomable Statistic: Select the range in the chart you want to zoom in on."
    },
    {
        "link": "https://forum.paradoxplaza.com/forum/threads/attempt-more-historical-industrial-output-in-the-1936-start.1497804",
        "document": "A required part of this site couldn’t load. This may be due to a browser extension, network issues, or browser settings. Please check your connection, disable any ad blockers, or try using a different browser."
    },
    {
        "link": "https://reddit.com/r/victoria3/comments/o930o6/i_made_5_graphs_showing_levels_of",
        "document": "I made 5 graphs showing levels of industrialization of 29 countries from 1820-1936. 1st img: world (sorry, a bit messy). 2nd img: W. Europe. 3rd img: E. Europe. 4th: outside Europe. 5th: major powers. 6th: raw data. See comment for details.\n\nArchived post. New comments cannot be posted and votes cannot be cast."
    },
    {
        "link": "https://researchgate.net/figure/Annual-growth-of-Industrial-Production-between-1925-and-1936-and-initial-industrial_fig2_275018622",
        "document": ""
    },
    {
        "link": "https://reddit.com/r/gamedesign/comments/t2531l/modeling_game_economies",
        "document": "For topics related to the design of games for interactive entertainment systems - video games, board games, tabletop RPGs, or any other type. /r/GameDesign is not a subreddit about general game development, nor is it a programming subreddit. This is a place to talk about Game Design and what it entails. Use this community to network, discuss crafting rulesets and general game design, and share game design tips with other game designers. Designers of all experience levels are welcome!"
    },
    {
        "link": "https://par.nsf.gov/servlets/purl/10185954",
        "document": ""
    },
    {
        "link": "https://strategicreasoning.org/publications/2020-2/economic-reasoning-from-simulation-based-game-models",
        "document": "Simulation modeling in economics has historically been viewed as an alternative to mainstream analytic technique, and as such has generally and intentionally avoided the focus on rational behavior and equilibrium reasoning that is characteristic of game-theoretic approaches. The emerging methodology of empirical game-theoretic analysis (EGTA) attempts to bridge agent-based simulation and game theory, combining the flexibility of simulation with the discipline of rationality criteria. The basic idea is to estimate a restricted game model from data generated by systematic simulation over a space of heuristic strategy profiles. EGTA enables a standard form of strategic analysis for complex economic scenarios previously addressed only in severely stylized form."
    },
    {
        "link": "https://reddit.com/r/gamedev/comments/24fjp9/what_all_is_involved_in_simulating_an_economy_for",
        "document": "Has anyone here ever written a game that attempts to do a reasonable simulation of a large scale economy (say, for space trading sims, etc)?\n\nI'm curious how much work a real economic simulation would take to program, and also how much processor power it would use if you wanted to be as accurate as possible and simulate all of the individual actors in the economy.\n\nTake a game like the X3: Albion Prelude. Mind you, I've never attempted this myself, but I wonder what would happen if I were to build a space station that generates power, and then hire people to destroy every other power generating space station within several hops from the system. Theoretically, the price of power ought to skyrocket if I did that, but honestly I don't think most players ever even attempt something like that.\n\nI don't know offhand how accurately X3's economy is simulated. It appears that there's real trading going on, but I could certainly think of ways that economic activity could be faked on the fly (that is, rather than determining what every ship in every sector is doing at all times, just generate ships at random, and when someone scans their cargo hold, generate some plausible cargo and destination, and make sure that when ships dock at a starbase, plausible changes in the cargo manifest take place).\n\nAt any rate, I suppose what I'm wondering is whether it's possible in a modern game to simulate an economy where thousands of simulated individuals are all trying to make money in some way, and if it is possible, how hard it would be to program it."
    },
    {
        "link": "https://researchgate.net/publication/322845788_Gaming_Simulation_Models_of_Economic_Entities",
        "document": "Abstract — The study is ded icated to the impleme ntation of\n\nsimulation games, which are stud ied today as a useful instrument\n\nof interactive education. The articl e gives a view o f the exist ing\n\neducational modeling tools. The description to the games\n\n“Deposits” and “Business-plan” is given. The first game i s\n\nintended to study deposit operations, the participants should\n\nenvision themselves in the role of depositors and demonstrate the\n\nability t o manage funds . In the second game, a com pany\n\noperation is studied. The games were implemente d to be us ed\n\nduring the educational process of “Basics of business” discipline,\n\nthey were implemen ted in Excel.\n\nSimulation modelling is a useful tool to analyze systems\n\nwith randomized behavior without analytic solution [1]. This\n\nmethod allows to hold the research of real wo rld ob jects in\n\ntime and monetary expenditures. By holding multiple t ests, it\n\nis pos sible to get statistical e stimations, reveal influence of\n\nfactors, estimate various variants aimed to optimize the sy stem\n\nsoftware development and game impleme ntation, as it is based\n\non the reproduction of objec t’s behavior in time and space\n\nwith the help of program algorithms considering influence of\n\nrandom factors, which allow s to model situations close to real\n\nPublic int e rest to the improving the quality of higher\n\neducation has been increasing now [2-3]. The games with\n\nsimulation models in base are now a popular educatio nal to ol\n\n[4-12]. Many authors consider that suc h games increase\n\neducational motivation of students; they show the connection\n\nbetween abstract theoretical categories and real problems and\n\nalso contribute to the a ctive engagement of student s into the\n\nOne of the areas , where s uch games can b e successfully\n\nused is economics, bec ause activity of an eco nomics is\n\nconnected with risks, decision-making in the range of\n\nuncertainty and should consider the existing laws of systems’\n\nAmong the existi ng ga mes, w e c an note Stoc k Po rtfolio\n\n[10], inte nded fo r familiariz ation of students with a notion of\n\nportfolio opti mization, Deal or not Deal [11], used on MBA\n\nimplementa tion of these game s. The study [12] describes a\n\nprogram which i s intended for students’ education on\n\nMarket He ro to model eco nomic process aimed to educa te\n\nIn the paper [13] the aut hors describ e a way to impleme nt a\n\nsimulatio n model of the game of roulet te in sprea dsheets and\n\nuse it to analy ze various stra tegies fo r the game in o rder to help\n\nSome researchers also analy ze the behavior of players in\n\nsuch TV game shows as: “W ho Wants to be a Millio naire?”,\n\nThe stu dy is devoted to the implementatio n of imitatio n\n\ngames to be used during the educ ational process of “Basics of\n\n“Deposits” and “Business -plan” [14] which c onsist of three\n\n playe rs – students taking pa rt in the ga me;\n\n presente r – professor, acting for: game co ntrol, start of\n\nwhitebo ard and a projecti ng device are used to\n\nThese games are developed using Excel spreads heets [15-\n\n18]. Spreadsheets are a widespread too l fo r a variety of tasks.\n\nWe have Excel available on all universi ty computers. The\n\nfollowing useful fe atures are available in that to ol:\n\nSpreadshee t is an attractive platform for gaming, but it has"
    }
]