[
    {
        "link": "https://cs.lmu.edu/~ray/notes/x86assembly",
        "document": ""
    },
    {
        "link": "https://docs.fileformat.com/programming/asm",
        "document": "What is an ASM file?\n\nAn ASM file is a program written in the low level programming language known as assembly language. It is primarily used for writing hardware related code such as for programming micro-controllers. Program is written using simple assembly language syntax that includes operators and operands to carry out different operations. ASM files are written and edited in text editors and are executed using an assembler program such as HLA, MASM, FASM, NASM, or GAS.\n\nASM files consist of a sequence of operations that are executed by an assembler to generate object code. The resultant object code is a translation of combinations of mnemonics and addressing modes into their numerical equivalents.\n\nFollowing is an example of Hello World application for an x86 architecture."
    },
    {
        "link": "https://masm32.com/board/index.php?topic=6920.0",
        "document": ""
    },
    {
        "link": "https://stackoverflow.com/questions/29545056/writing-to-a-file-in-assembler",
        "document": "I'm tasked with creating a program that would write some string to a file. So far, I came up with this:\n\nbut it doesn't do anything. I'm using nasm and dosbox."
    },
    {
        "link": "http://www1.coe.neu.edu/~perry/mim3122",
        "document": "1. A ZIP file containing all necessary files to run MASM 6.11 is available for downloading. Click here.\n\n2. An improved explanation of how to call the procedures in the IRVINE.LIB link library is available. This replaces pp. 626-627 of the book. Click here to view or copy.\n\nfor all homework exercises are available for viewing and downloading. See \" , Homework Programming Exercises\" section below.\n\nfor the DOS interrupts illustrated in class but not contained in the Class Packet are available for downloading. See \" DOS Interrupt Illustrations not in Class Packet\" section below. \n\n\n\nAll homework should be done as an individual effort with no collaboration.\n\nAll coding exercises should be well-docmented with comments in the .ASM file or in the DEBUG script file when using DEBUG.\n\nWhen using a networked printer in a Lab to get screen printouts from DEBUG, use the following approach, rather than the \"Shift-print screen\" keys as suggested in the text.\n\nwhere: \"file.SCR\" is a DEBUG script file and \"file.OUT\" will contain all output sent to the screen by DEBUG. \n\n The file, \"file.OUT \" can then be printed as a file.\n\nRoom 374 SN will have assistance available from 2:00 - 3:00pm on the dates shown for each lab exercise.\n\nDownloadable software for Lab Ex. #3 \n\n gwbasic.exe \n\n key-bits.bas \n\n keyscope.exe \n\n (After downloading, rename this file: keyscope.com using the DOS rename command as: \n\n ) \n\n keyscope.inf\n\nHomework Programming Exercises \n\nc3_pe3 (Arithmetic sums) \n\nc3_pe4 (Upper case conversion) \n\nc4_pe3 (Add a list of 16-bit numbers) \n\nc4_pe4 (Fixing an overflow problem) \n\nc5_pe3 (Stack operations) \n\nc5_pe9 (String input) \n\nc6_pe4 (Alphabetic input) \n\nc6_pe5 (Signed integer input) \n\nc7_pe4 (Room schedule) \n\nc11_pe1 (Set default disk drive) \n\nc11_pe3 (Disk free space) \n\nc11_pe5 (Create a hidden directory) \n\nc5_pe11 (String with attributes) \n\nc5_pe15 (Setting the cursor size) \n\n\n\nIlustrative Problems from the Text and Lecture \n\n \n\nsumintarray (Sum of integer array)\n\n\n\nc5_pe10 (Upper case conversion) \n\nc5_pe12 (Box-drawing program) \n\nsubs (Example of he use of procedures) \n\nbuffinpt (Input from K/B to buffer, Int 21h, 0Ah) \n\nt_cap_lk (Toggles caps-lock key on and off) \n\nset_cplk (Sets the caps-lock key on) \n\nnum_lk (Turns off the num-lock key)\n\n\n\nc6_pe12 (Count the words in a file) \n\nfinite (Finite state machine) \n\nupcase (Convert chars from K/B input) \n\n3small (Find smallest of 3 numbers from K/B) \n\nconvert.asm (Convert hex K/B input ot binary) \n\ndispbin (Display a binary number entered from the K/B) \n\nbin (Display a binary number) \n\nwrint_ex (Illustrates use of Writeint library as a procedure)\n\nDOS Interrupt Illustrations not in Class Packet (shift-click to download) \n\nint10s3.com \n\nint10s6.com \n\nint10sa.com \n\nint10sb.com \n\ni21s3c40.com \n\ni21s3d40.com \n\ni21s3d3f.com \n\ni21r_w.com"
    },
    {
        "link": "https://stackoverflow.com/questions/40532516/assembly-error-handling",
        "document": "On the x86 architecture, the carry flag (CF) has been historically used for such purposes, probably because it is the most convenient to manipulate: the and instructions can be used to set and clear it. The interrupt and direction flags (IF, DF) have similar instructions, but altering these flags tends has a significant impact on other code; the direction flag, in particular, is normally required by various calling conventions to be set one way or another, and the interrupt flag masks interrupts, a visible effect that should not depend on failure to parse an integer (for example).\n\nWhile I wouldn't compare it to proper exception throwing and handling, setting the carry flag before return can indicate an error, and the caller can check the carry flag (using the instruction) on return to handle the error appropriately."
    },
    {
        "link": "https://stackoverflow.com/questions/47768698/assembly-x86-check-for-user-input-error",
        "document": "I'm having trouble with my program. I'm trying to have user input a number between 0-400 and it continues from there. Ive checked the cases of user input and it takes care of them all. The final part I'm missing and need help on is when the user enters something crazy like \"2aaeios\", it registers it as a \"2\" and takes the loop of comparing 2 to 0 and jg into \"Case12\"\n\nHow can I force user to enter a number from 0-400 and push forwards ErrorExit case otherwise?"
    },
    {
        "link": "https://medium.com/@tempmailwithpassword/debugging-a-masm-program-to-read-and-display-user-input-339b4d26f760",
        "document": "Assembly programming can be a thrilling yet challenging journey, especially when it comes to handling user input. 🛠️ New programmers often find themselves wrestling with unexpected errors, as seen in the case of reading strings in a MASM (IA-32) program. This issue often stems from the delicate interplay between memory allocation and operand sizes.\n\nIn this scenario, the programmer is trying to create a simple interaction where the user enters their name, and the program greets them. However, the code skips over the input entirely, and the error message “A2022 instruction operands must be the same size” adds to the confusion. Understanding how the Irvine32 library processes strings and data will be key to solving this.\n\nReal-life coding challenges like this can feel daunting, but they also provide excellent learning opportunities. For example, I once spent hours troubleshooting a similar issue, only to realize I hadn’t properly defined my string buffer size. Situations like these teach us the importance of precision in low-level programming. 🤔\n\nIn the following analysis, we’ll explore what went wrong in this MASM program, clarify the error message, and discuss how to correct the code. By addressing these details, you’ll gain a better understanding of how to manage string input effectively in assembly language.\n\nWhen working with assembly language, particularly with MASM and the Irvine32 library, understanding how commands manage memory and data flow is critical. In the provided scripts, the main challenge revolves around managing string input and addressing operand size mismatches. This is a common pitfall for new programmers, as assembly requires precise handling of data sizes and memory addresses. For example, attempting to store user input into a buffer without ensuring correct size allocation can lead to errors like “instruction operands must be the same size.” 🛠️\n\nThe first script solves this by clearly defining a buffer using BYTE DUP(?), which initializes a memory area large enough to store the user’s input. By setting ECX to the maximum allowed size and using the ReadString command, the program ensures that input is appropriately captured within the allocated buffer. A personal anecdote: I once forgot to set the size limit in ECX, and the program kept overwriting adjacent memory, leading to mysterious crashes. This script avoids such issues by sticking to best practices.\n\nTo improve reliability, the second script incorporates error handling through commands like CMP BYTE PTR and JNE. These commands check for potential buffer overflows by ensuring the last byte of the buffer remains unaltered. If it isn’t, the program gracefully handles the error by jumping to a label and displaying an appropriate message. Real-world coding often involves such safeguards. For example, when designing a login system, I had to validate input lengths to prevent security issues like buffer overflow attacks. Adding these checks in assembly ensures the program behaves predictably under all conditions. 😊\n\nThe scripts also use the CrLf command, which adds new lines for better output readability. This small touch makes a big difference in user experience, turning cryptic outputs into human-friendly displays. Alongside this, the combination of WriteString and OFFSET helps dynamically display messages and user input. By properly loading memory addresses with OFFSET into EDX, the program enables seamless interaction between the user and the program. Mastering these commands not only solves the immediate problem but also builds a solid foundation for more complex assembly tasks.\n\nUsing MASM (Microsoft Macro Assembler) to manage user input in IA-32 assembly programs\n\nUsing MASM with robust input validation and error handling techniques\n\nUnit testing the MASM program for various user inputs and edge cases\n\nOne of the challenges when working with assembly, especially in a MASM (IA-32) environment, is properly handling user input to ensure functionality and efficiency. A frequently overlooked aspect is buffer allocation. In assembly, it’s critical to allocate the exact amount of memory needed for strings, as the processor directly interacts with raw memory. Using directives like BYTE DUP(?), we can define uninitialized buffers, but it’s equally important to implement size checks to avoid overflows or truncation.\n\nAnother vital detail involves the use of registers. Registers like EAX, EDX, and ECX are heavily involved in managing operations. For instance, ECX defines the maximum string length during ReadString, ensuring that user input doesn’t exceed the buffer’s capacity. Balancing registers and memory locations allows seamless data flow between prompts and outputs. For example, a user typing their name can result in personalized messages like, “Hello, John!” provided the string is stored and referenced properly. 😊\n\nAdditionally, the issue of operand size arises due to the mismatch between 32-bit registers (e.g., EAX) and smaller 8-bit or 16-bit memory locations. Addressing these mismatches by ensuring consistent operand sizes or using the appropriate segment registers is crucial. Neglecting this can lead to errors like the infamous “A2022 instruction operands must be the same size.” Such attention to detail ensures that your MASM program functions as intended while maintaining clarity and efficiency. 🛠️\n\nWhat causes the “A2022 instruction operands must be the same size” error?\n\nThis happens when there’s a mismatch between operand sizes, such as attempting to move a 32-bit register (EAX) into an 8-bit memory location.\n\nHow can I allocate memory for user input in MASM?\n\nYou can use BYTE DUP(?) to create a buffer. For instance, BYTE 20 DUP(0) reserves 20 bytes of uninitialized memory.\n\nWhat is the role of ECX in ReadString?\n\nECX sets the maximum number of characters that can be read. For example, setting ECX, 20 limits input to 20 characters.\n\nWhy does my program skip input and move to the next line?\n\nSkipping input often occurs if the buffer or register addresses are incorrect. Verify that EDX correctly points to your buffer before calling ReadString.\n\nHow do I handle errors like buffer overflows in MASM?\n\nUse commands like CMP BYTE PTR and JNE to check buffer boundaries and handle overflow scenarios gracefully.\n\nEnsuring smooth user input handling in assembly programming involves understanding the nuances of memory management and register usage. These insights help address errors like “A2022 instruction operands must be the same size,” which can stump beginners.\n\nBy applying modular programming and error-checking techniques, even new programmers can create efficient and user-friendly MASM programs. Real-world coding challenges like buffer overflow prevention teach essential skills for low-level programming. 🛠️\n\nInsights into the Irvine32 library and its functions: Irvine Assembly Language Help ."
    },
    {
        "link": "https://codehs.com/tutorial/13961",
        "document": "In this tutorial, we take a look at the potential impacts of different types of programming errors that could lead to vulnerabilities in the application."
    },
    {
        "link": "https://quora.com/How-do-you-do-error-checking-in-MIPS-As-in-how-do-I-make-sure-that-the-program-doesn-t-accept-non-integer-user-inputs",
        "document": "Something went wrong. Wait a moment and try again."
    }
]