[
    {
        "link": "https://reddit.com/r/pcgaming/comments/mlfcsc/a_guide_to_dxvk_on_windows",
        "document": "\n• Read this first. I do not recommend trying anything here with any online games. Do so at your own risk. This is technically a guide to modding your game - if your game explicitly bans players for use of mods then do not use this guide\n• DXVK on Windows is not officially supported. Do not expect any official support from the developers if you experience issues. DXVK is primarily aimed at enabling Windows games to be run on non-Windows platforms. If something doesn't work and you can't fix it, either on your own or using any help from me or anyone else, then I suggest you revert back to using native DirectX. Keep track of what steps you followed and reverting shouldn't be an issue. In most cases, it should be as simple as removing a few DLL files that you copied to the game folder.\n• Do not expect any magical performance boosts across all your games. Results will vary from game to game. Some games may not show any improvement and other games may perform worse. Be prepared to do some benchmarking to validate your results.\n• As mentioned by u/Rhed0x, DX11 games will not benefit much from multi-threading but there may be other benefits for AMD users.\n\nDXVK is a set of software libraries that translates DirectX API calls to Vulkan API calls. It supports DirectX versions 9, 10 and 11.[1]\n\nVulkan and APIs similar to it (DX12, Metal) are a a lot better at making use of multi-core/multi-threaded CPUs to batch up work that needs to be done by the GPU thereby making better use of both CPU and GPU.[2] This can lead to significant performance boosts in some games.\n\nI have personally gone from inconsistent ~50-60FPS in Assassin's Creed III and Torment - Tides of Numenera to consistently hitting 60FPS with no drops.[3]\n\nMy hardware specs are as follows:\n\nAs you may see, I'm in dire need of an ugprade so I'll take whatever performance boost I can get hence my experimentation with DXVK.\n\nI didn't find much in the way of good documentation for using DXVK on Windows specifically. All the guides I've found were for gaming on Linux. So I decided to compile my findings here so that others might benefit from it.\n\nDo these steps once:\n• Download the latest release of DXVK from GitHub\n• Use 7-Zip to unzip and untar the folder (where is the version number)\n\nDo these steps for each game:\n\nYou need to know two bits of information about the game you want use DXVK with:\n• which version of DirectX it uses\n• what it's \"bitness\" is, i.e. is it 32-bit or 64-bit\n\nIn most cases, you can find out both of these from a game's API section section on PCGamingWiki. There may be some clues in the file/folder names your game's folder about it's bitness if you're unable to find it otherwise, e.g. if there's a there then it's probably 64-bit or if there's a it's likely to be 32-bit.\n• Open the folder where your game's executable is (.exe file)\n• Open the folder where you extracted DXVK and go the appropriate folder for your game's bitness, for 32-bit, for 64-bit\n• Copy the following files to the folder where the game's executable is depending on the game's DirectX version:\n\nIf your game supports multiple DirectX versions copy all the applicable DLLs.\n\nThat's it! Now cross your fingers and run the game.\n\nUnfortunately, DXVK isn't going to work in all situations. So far I've been unsuccessful in getting it to work in the following scenarios:\n• Xbox Game Pass (and probably Windows Store) games - I've been unable to copy the DXVK files to the game folder as the permissions for the game folder don't allow it. There are ways of taking ownership of the game folder and giving yourself the necessary permissions which is something I tried unsuccessfully. It wasn't worth pursuing for Ori and the Blind Forest since I'd already found another way to fix the stuttering issues I was having. When I'm next playing a Game Pass game that requires a performance boost I'll revisit this issue.\n• Steam In-Home Streaming with exclusive fullscreen games - I found this issue with Assassin's Creed III, where I was trying to stream it using Steam In-Home Streaming to my living room TV and was getting a black screen. I tried to force borderless fullscreen using some workarounds on PCGamingWiki but unfortunately the AC games (or at least the earlier ones) are really stubborn about wanting to be in exclusive fullscreen mode (Ubisoft strikes again). If you want to use DXVK with streaming and the game supports borderless fullscreen mode, switching to it should fix this issue. Otherwise your options are don't use DXVK or don't stream.\n\nNote: I did manage to stream successfully to a laptop with an NVidia Quadro GPU but then after streaming to the TV, streaming to the laptop was broken again. Streaming to an old Macbook Pro with a built in Intel GPU was also unsuccessful so you may find some success depending on the client machine you are streaming to and whether you are changing client machine or not.\n\nThere are likely other scenarios where DXVK won't work. I just haven't experienced them yet. I'll update this post with any future findings.\n\nI hope this guide helps others eke to out some more performance from older or lower end hardware. If you have any questions/issues I'll try my best to help. Happy gaming!\n\n[1] DX12 support is unnecessary as DX12 is similar to Vulkan in terms of software architecture and attempts to solve the same problems that Vulkan is targeted at.\n\n[2] Although I'm a software developer by day I'm not a games/graphics developer so this is my very basic understanding TL;DR version. There are articles and videos out there that can explain things better and more in-depth if you are interested.\n\n[3] I don't have a high refresh rate monitor or TV so don't judge my \"lofty\" FPS goals.\n• Amended to add for DX10 thanks to u/JoshuaAshton\n• Addendum to disclaimers on DX11 as per u/Rhed0x's comments"
    },
    {
        "link": "https://steamcommunity.com/sharedfiles/filedetails?id=2461019058",
        "document": ""
    },
    {
        "link": "https://reddit.com/r/Guildwars2/comments/1fodw1w/windows_guide_how_to_improve_performance_with_dxvk",
        "document": "EDIT: PLEASE USE THIS METHOD NO NEED FOR ADDONS MANAGER https://www.reddit.com/r/Guildwars2/s/aBT79VakgW\n\nFirst i'd like to say i got this tip from the user Elinriel on GW2 forum: https://en-forum.guildwars2.com/topic/137068-stutters-on-amd-gpu/?do=findComment&comment=1986868\n\nRecently a user made a post saying performance was dropping a lot on meta events of PoF, my suggestion was to swap the game render to vulkan using DXVK but as i see people dont know how to do it or think this is a linux thing so i'm writing this guide to help people out there get better performance in the game.\n\nIn my experience, using DX11 the game stutters a lot on cities like Lions Arch / Diviners Reach and doing world bosses mean the fps would drop to 15 sometimes. After changing to DXVK the game runs like butter for me and i did all metas on PoF return event without fps dropping below 60fps (even Serpents Ire that requires tons of people to do).\n\nWhat do you need:\n• Go to your GW2 install folder and create a folder named addon_manager.\n• Start GW2 Addon Manager.exe and select Libimgui and SelectRenderer checkboxes. On path folder select the game install folder and then hit update. (image 1 below)\n• The game folder now should have a folder called addons (if not, create yourself). Go inside this folder and create a new folder called dxvk, inside this new folder extract the DXVK2.3 zip you downloaded (image 2 below)\n• Start the game, on character selection screen you should see a new menu (see image 3 below) asking you to choose the render. Select DX11: DXVK and hit apply. Restart the game and it should be working now\n\nCan i get banned for doing this?\n\nNo, and if they do they will be baning all linux users on steam and that would be a big problem, other than that DXVK doesnt give any advantage on pvp / wvw (outside better fps).\n\nDoes it break ArchDps and Blish?\n\nNo, i use both without a problem.\n\nCan i use reshade with this?\n\nYes, even with a option for DXVK + Reshade, just the DXVK option should work just fine.\n\nEdit: game capture showing that is running on vulkan"
    },
    {
        "link": "https://steamcommunity.com/sharedfiles/filedetails?l=swedish&id=2461019058&wRCE0yflL=GpioN",
        "document": ""
    },
    {
        "link": "https://github.com/doitsujin/dxvk/blob/master/dxvk.conf",
        "document": ""
    },
    {
        "link": "https://reddit.com/r/Amd/comments/1676xo2/what_are_your_goto_or_must_avoid_adrenalin_gfx",
        "document": "Just made the switch to AMD, thing are going (mostly) great so far! I noticed a handful of settings in the Graphics tab of Adrenalin (RSR, Anti-lag, Chill etc.) and was wondering if any cause issues to you longer time AMD users.\n\nI'm a bit new to all of this, I appreciate any information!"
    },
    {
        "link": "https://reddit.com/r/Amd/comments/1f2t9s5/amd_confirms_branch_prediction_optimizations_are",
        "document": "Welcome to /r/AMD — the subreddit for all things AMD; come talk about Ryzen, Radeon, Zen 5, RDNA 3, EPYC, Threadripper, rumors, reviews, news and more. /r/AMD is community run and does not represent AMD in any capacity unless specified."
    },
    {
        "link": "https://amd.com/en/products/software/adrenalin/radeon-boost.html",
        "document": ""
    },
    {
        "link": "https://patreon.com/posts/88124101",
        "document": ""
    }
]