[
    {
        "link": "https://forums.autodesk.com/t5/revit-architecture-forum/revit-to-fbx-export-lose-materials-in-f-e-unity-unreal-engine/td-p/8221692",
        "document": "I have an issue with Fbx export from Revit. I have a Revit file (well prepared, with materials etc.). When I open it in 3ds Max and save it as fbx, after opening, eg in Unity, all materials are preserved.\n\nWhen I open the same file in Revit and export to fbx I get situation in any graphics engine (Unity, Unreal Engine), the project loses materials, and in principle has one, called 'No NAME' and the same for each object. In addition, if Revit object has several materials in Revit, only one is shown after fbx export, also 'NO NAME'.\n\nHave you met this situation before, you can advise me something ... any direct way to do this without losing mats?"
    },
    {
        "link": "https://forums.autodesk.com/t5/revit-api-forum/how-to-export-a-revit-project-to-fbx-format-with-all-the/td-p/6607620",
        "document": "Ah, I see. It's now on the developer to handle writing the output file with assistance from the helper methods. It's more work than I thought it would be, especially after seeing the FBXExportOptions class. That's fine. I'm pretty new to the Revit API, but not to related tools, so thanks for the insight.\n\nJust so I understand the current API a bit better, is this statement true? In Unity and several other apps, you can export a scene/view/etc to an FBX in a couple lines:\n\nThat used to be the case in the Revit API:\n\nBut FBXExportOptions is obsolete, so people now use CustomExporter. The flip side is that this class doesn't understand the output specifics of particular file types, so the developer has to handle that themselves. Löbel's export approach is much more code than using filetype-specific exporters. In short, the Revit API moved away from filetype-specific exporters. The developers now need to understand the specs of the file type to export to. Is that a correct understanding? It's fine if so. It's just a lot more code that I would have thought.\n\nI can see the flexibility in that file-agnostic approach. I can export exactly how I want without being limited to the configuration of the method params. But for this tool, I'd take the old FBXExportOptions or Unity-style approach to FBX-specific exporters if that's available in the current Revit API (with materials working)."
    },
    {
        "link": "https://forums.autodesk.com/t5/revit-architecture-forum/restore-fbx-export-function/td-p/10692192/page/2",
        "document": "Could you please let me know if Autodesk would consider restoring the .fbx export function from Revit?\n\nI did ask this same question a couple of years ago and the answer was to either: purchase FULL REVIT as opposed to REVIT LT, or to purchase 3DMax (as a very expensive file converter). I am already aware that Lumion and D5 Render plug-ins within FULL REVIT work well. Therefore, could you please not suggest this as a solution again. I am asking again in the hope that I may get a more constructive answer from someone else this time around.\n\nI used my perpetual FULL REVIT 2010 license for many years and had no issues exporting to .fbx (with all materials recognised) and importing into LUMION. I was extremely happy with the workflow.\n\nI am now using REVIT LT (from 2019) and cannot export files via .fbx as all of the materials are missing. I have tested REVIT LT 2022 and an educational version of FULL REVIT 2022 and have discovered no improvement.\n\nIdeally, I would like to be able to export .fbx files from REVIT LT (with materials recognised), so that I can import them into LUMION and D5 render. I have tested every kind of alternative export option available, but have not found a good solution. Every other type of file export is problematic for one reason or another. The closest solution would be to either export as:\n\n1. a .dwg file set to 'ACIS Solids' (to allow for smooth curves, however composite walls become one element with one material which is terrible. Exporting as a .dwg 'Polymesh' will split a composite wall into different materials, but all smooth objects like 'cornices' will be segmented which is unacceptable for rendering purposes.). The biggest issue with exporting as a .dwg file, is that the heirarchy of material/family names (eg: WALLS - Exterior-1) will change when a new family element is introduced within the Revit File. Materials in LUMION will shuffle around and have to be re-applied when the Revit model (via .dwg) is refreshed.\n\n2. Exporting REVIT LT as .IFC and converting it into an .fbx file appeared to be the best solution as materials and smooth curves are maintained. (however composite walls are still exported as one element with one material). I thought this was the best solution until I did a 'House Swap test' within LUMION (which is very important for workflow as we don't want to reapply materials every time we want to present an alternative design for the same project). I discovered that the 'House Swap test' failed because numbers were added to the beginning of all material names. For example: For Project 1, '_WALL - Brick', changed to '8083__WALL - Brick'; and for Project 2, '_WALL - Brick' became '10451__WALL - Brick'. Could you please let me know if there is any way to export Revit as an .IFC file while maintaining the original material names. ie: export as an .ifc without the numbers added to the beginning of each material?\n\nI have attached 2 short videos of the 'House Swap test' so that you can see how material names remain unchanged for a .dwg export, but are altered (numbers added) when exported as an .IFC file.\n\nIn short, will Autodesk consider restoring .fbx export function? If not, could you please let me know if there is any way to export as an .IFC file without numbers added to material names?"
    },
    {
        "link": "https://forums.autodesk.com/t5/revit-architecture-forum/export-to-fbx-and-materials-need-to-confirm-things/td-p/11617643",
        "document": "This question is about Native FBX Export from Revit LT - so no plugins involved.\n\nWhen exporting something from Revit to FBX, I was expecting the textures to be embedded.\n\nThis is how it looks in Revit\n\nI used Twinmotion to open the FBX and the material came as default. No proper texture assigned\n\nIn 3dsMax, things look stranger. The material name is intact. Same as in Revit. The texture was missing and pointing to some strange path.\n\nCan you confirm that an FBX-export cannot provide you any textures embedded, nor links to existing textures on your harddrive?"
    },
    {
        "link": "https://bimassociates.com/blog/export-revit-files-ds-max-rendering",
        "document": "Around the world, in 2025, over 5,471 companies have adopted Autodesk 3ds Max as their preferred 3D rendering tool, underscoring its popularity and effectiveness in producing high-quality visualisations. This widespread adoption highlights how 3ds Max has become an essential companion to Revit in architectural and design workflows.\n\nWhile Revit excels at creating detailed building models with its robust BIM capabilities, 3ds Max elevates these models by providing advanced rendering features that transform designs into photorealistic visuals.\n\nExporting Revit files to 3ds Max is more than data transfer; it’s about aligning the method with your project’s needs. The type of export—FBX Export for detailed rendering, DWG Export for geometry-focused workflows, or RVT Import for direct integration—directly impacts how well your model transitions and performs in 3ds Max.\n\nWhile FBX Export preserves materials and cameras, DWG Export focuses on clean geometry, and RVT Import supports seamless updates within Autodesk’s ecosystem.\n\nIn this article, you’ll learn how to export Revit files to 3ds Max through all three methods and achieve stunning rendering results.\n\nExporting Revit files in DWG format are widely used to transfer data between the two platforms, as they effectively retain geometry and material details. This method is particularly advantageous for workflows that involve precise curves and instanced geometry.\n\nDWG exports preserve the integrity of model details, ensuring smooth transitions and compatibility with 3ds Max’s tools. The steps to export Revit files to 3ds Max through this method are as follows:\n\nBefore exporting your Revit model to 3ds Max, thorough preparation is essential to ensure a smooth and efficient workflow. A well-prepared model simplifies the export process and minimises potential errors during import. To prepare the Revit model:\n• Clean the Model: Remove unnecessary elements and eliminate hidden geometry, annotations, and other non-essential items for rendering.\n• Purge unused families: Optimise the file size and reduce complexity by removing unused content.\n• Set the Correct 3D View: Activate or create a 3D view and focus on the specific elements to be exported by setting up an appropriate 3D view.\n• Use section boxes: Limit the export scope to the required parts of the model for better control.\n• Assign Materials and Textures: Ensure materials and textures are properly applied. Correctly assign Revit materials and textures to ensure compatibility with 3ds Max.\n• Use consistent naming conventions: Apply standardised naming to materials for easier refinement and mapping in 3ds Max.\n\nExporting the Revit model to DWG format is a simple yet pivotal step in ensuring compatibility with 3ds Max. A well-executed DWG export is the foundation for smooth integration and precise rendering in 3ds Max. The export of the Revit model to DWG goes as follows:\n• Go to Export Options: Navigate to File > Export > CAD Formats > DWG. Use the built-in DWG export option in Revit to start the process.\n• Configure Export Settings: Use Modify Export Setup to map Revit categories to DWG layers for better organisation. Match the export units to the 3ds Max scene settings (e.g., millimetres or inches).\n• Solids vs. Polymesh: Choose Solids for better geometry fidelity or Polymesh for smaller file sizes.\n• Save the DWG File: Choose the location and filename, select an appropriate folder, and give the file a descriptive name. Ensure all selected elements are included. Also, confirm the scope of the export to include all required components.\n\nImporting the DWG file into 3ds Max is a critical step where the prepared geometry transitions into a rendering environment. The flexibility to control which elements are imported allows for a tailored approach, minimising unnecessary data and optimising performance. To import the DWG file into 3ds Max:\n• Open 3ds Max: Launch 3ds Max and start a new or existing project. Prepare the scene for importing the DWG file.\n• Import the DWG File: Navigate to File > Import > and select the exported DWG file. Use the AutoCAD DWG/DXF Import Options dialog to configure the import settings.\n• Configure Import Settings: Import objects as meshes (preferred for rendering) or solids (for detailed modelling). Match the units of the DWG file with the 3ds Max scene units for accurate scaling. Import by layer for better control over visibility and materials.\n• Material Handling: Enable material translation to retain Revit material assignments (refinement may be needed).\n• Finalise Import: Complete the import and verify geometry positioning and scaling. Ensure all objects are accurately placed and aligned within the 3ds Max workspace.\n\nOnce the DWG file is imported into 3ds Max, refining the model is essential to prepare it for high-quality rendering. Refinement in 3ds Max elevates the model’s visual quality and streamlines the workflow, ensuring a smooth transition from design to photorealistic renders. The refinement process goes as follows:\n\nReplace imported Revit materials with high-resolution materials and textures. Utilise tools like V-Ray or Arnold for photorealistic rendering. Customise material properties for enhanced visual impact. Adjust textures, reflections, and transparency to achieve desired realism.\n\nAdd or refine lighting to suit rendering needs. Ensure correct placement and intensity of lights. Imported Revit lighting may require fine-tuning. Use advanced lighting setups for realistic shadows and highlights. Leverage global illumination and HDR lighting for dynamic effects.\n\nCheck for overlapping geometry, unnecessary polygons, or rendering inefficiencies. Clean up the scene to improve rendering performance and avoid artifacts. Also, organise objects using layers or groups for easier management. Group-related objects for better control during rendering and editing.\n\nPerform test renders to evaluate materials, lighting, and overall geometry. Also, make adjustments based on test results to refine the output. Iterate on materials, lighting, and geometry settings as needed for optimal results.\n\nDWG export is a reliable method for transferring accurate geometry and instanced elements. However, FBX export provides a more versatile solution for workflows that require additional details such as linked files, material data, and textures.\n\nAre you exploring 3ds Max-based tools to optimise your projects and achieve stunning visualisation results?\n\nBIM ASSOCIATES helps you 3D-model your objects, furniture, buildings, and landscapes in high poly or low poly and enables you to create scenic renders and videos.\n\nFBX export is a powerful method for transferring Revit files to 3ds Max. It offers versatility and efficiency while preserving model integrity. Unlike DWG, the FBX format includes linked files, materials, textures, and basic lighting, making it an excellent choice for workflows requiring detailed visualisations.\n\nThis method ensures smoother transitions by maintaining key design elements and enabling quicker adjustments within 3ds Max. The steps to export Revit files to 3ds Max through the FBX export method are as follows:\n\nPreparing a Revit model before exporting it as an FBX file is crucial for a smooth and efficient process. Proper preparation enhances the accuracy of the exported file and simplifies the workflow, enabling quicker adjustments and delivering better-quality visualisations during rendering. To prepare the Revit model:\n• Clean Up the Model: Remove unnecessary elements and eliminate annotations, 2D drawings, and hidden geometry to simplify the model.\n• Use Section Boxes: Limit the exported geometry to only the areas needed for rendering.\n• Review Materials and Textures: Ensure materials are correctly assigned. Assign and name materials consistently to simplify adjustments in 3ds Max.\n• Refine Texture Mapping: Use Revit’s material editor to refine texture mapping for smoother transitions during export.\n• Lighting Configurations: Check lighting configurations and ensure lights are positioned and configured correctly for rendering needs in 3ds Max.\n• Prepare for Adjustments: Be aware that light intensity and other settings may need refinement after importing to 3ds Max.\n\nThe FBX format is specifically designed to retain materials, textures, and linked files, ensuring that essential details from the Revit model are preserved. An accurately exported FBX file sets the stage for efficient refinement and advanced rendering workflows in 3ds Max. To export the model as FBX:\n• Access the Export Function: Navigate to File > Export > FBX in Revit. Locate the FBX export option in Revit’s menu to begin the process.\n• Configure Export Settings: Choose an appropriate folder and provide a descriptive file name for easy identification.\n• Check the Scope: Specify the geometry to export using the active 3D view in Revit, ensuring all necessary elements are visible. Ensure the units in Revit match those of the 3ds Max scene for accurate scaling.\n• Save the FBX File: Complete the export process and confirm that all required geometry, materials, and lighting are included in the exported file.\n\nImporting the FBX file into 3ds Max is crucial in transitioning the Revit model into a rendering environment. A well-organised import process ensures a smooth workflow, combining Revit’s technical accuracy with 3ds Max’s creative potential. The import of the FBX file into 3ds Max goes as follows:\n• Open 3ds Max: Start 3ds Max and create a new project or open an existing one. Prepare the scene to receive the imported FBX file.\n• Import the FBX File: Navigate to File > Import and select the exported FBX file. Ensure you choose Autodesk FBX File as the file type during the import process.\n• Configure Import Settings: Keep the object hierarchy intact to maintain relationships between elements in the model. Ensure all geometry is imported accurately, preserving the original shapes and structures. Enable material and texture import for smoother material transitions.\n\nNote: Further refinement may be required. If lights were exported from Revit, enable their import to carry over lighting data into 3ds Max.\n\nOnce the FBX file is imported into 3ds Max, refining the model is crucial to enhance its visual quality and optimise it for rendering. Refining the model improves realism and ensures it performs efficiently during rendering, resulting in a polished and professional visualisation. To refine the model in 3ds Max:\n• Adjust Materials: Replace imported Revit materials with high-quality materials from 3ds Max (e.g., V-Ray or Arnold). Enhance visual realism by refining texture mapping, adding bump maps, and adjusting reflections. Modify material parameters such as glossiness, transparency, or emissivity to achieve desired results.\n• Optimise Lighting: Revisit the imported lights to ensure correct placement, intensity, and behaviour. Add HDRI environments or additional lights for realistic lighting effects. Use global illumination and dynamic lighting setups for enhanced realism.\n• Organise the Scene: Group related objects or organise them into layers for better management. Simplify scene navigation and make editing more efficient. Check for overlapping geometry or redundant elements.\n• Perform Test Renders: Run test renders to evaluate the accuracy of materials, lighting, and geometry. Make iterative adjustments to improve overall visual quality & adjust based on test results to ensure the final output meets expectations.\n\nWhile FBX export is a versatile option for transferring Revit models to 3DS Max, some workflows benefit from even greater integration. RVT import provides a seamless solution for projects that need direct access to the entire Revit model, including its views and linked files.\n\n3ds Max supports the direct import of Revit project files (.RVT), offering an efficient way to transfer models for rendering. This method preserves geometry, materials, and linked model relationships, eliminating the need for intermediate formats like FBX or DWG.\n\nIt is particularly advantageous for complex projects with multiple linked models, as it streamlines the workflow and ensures that all elements remain synchronised. The steps to import Revit files to 3ds Max through the RVT import method are as follows:\n\nPreparing the Revit model for RVT import into 3DS Max ensures a smooth and efficient workflow. This involves focusing the model on essential elements, such as geometry and materials, required for rendering while hiding or excluding unnecessary components to streamline the process. To prepare the Revit model:\n• Simplify the Model: Eliminate annotations, hidden geometry, and unused components to focus on rendering-specific elements. Isolate areas of interest to export only the required portions of the model.\n• Assign Materials: Apply meaningful material names for easier refinement in 3ds Max. Adjust textures and mappings in Revit to enhance their accuracy during import.\n• Configure Lighting: Set up lighting as needed, considering adjustments may be required in 3ds Max.\n• Save the Revit File: Save the file and store the Revit project file in an accessible location with a clear and descriptive name.\n\nImporting the RVT file into 3ds Max allows a seamless transition from BIM modelling to advanced visualisation. By directly importing the RVT file, you can retain relationships between linked models, preserving the structural integrity and organisation of the original Revit project. The import of the RVT file into 3ds Max goes as follows:\n• Open 3ds Max: Launch 3ds Max and create a new project or open an existing one.\n• Access the Import Function: Navigate to File > Import > Link Revit. Use the built-in Link Revit function for direct import.\n• Select the RVT File: Browse and select the desired RVT file in the Link Revit dialog. Ensure you have the prepared RVT file saved and accessible.\n• Configure Import Settings: Select specific 3D views or elements from the Revit model for import. Enable material and texture import, noting that refinement may be needed in 3ds Max. Ensure the Revit model units match the 3ds Max scene units for accurate scaling.\n• Complete the Import: Confirm the import settings and proceed. The Revit model will now be imported into the 3ds Max scene, ready for refinement.\n\nAfter importing the RVT file into 3DS Max, refining the model is essential to elevate its visual quality and prepare it for rendering. Refining allows for a seamless transition from technical accuracy to creative visualisation, enabling the production of detailed and photorealistic renders. To refine the model in 3ds Max:\n• Adjust Materials: Replace imported Revit materials with high-resolution materials. Use V-Ray, Arnold, or other advanced material systems to achieve photorealistic rendering.\n• Lighting Adjustments: Refine light intensity, positioning, and settings for compatibility with the 3ds Max scene. Add HDRI environments or advanced lighting setups.\n• Organise the Scene: Use layers or grouping tools to manage geometry efficiently. Eliminate redundant geometry or objects that are not required for the final visualisation.\n• Test Render: Perform test renders to evaluate materials, lighting, and geometry. Identify and resolve issues early, ensuring all adjustments align with the desired visual output.\n\nRVT import allows architects to integrate Revit models into 3DS Max while preserving geometry, materials, and linked relationships. However, for a smooth and efficient workflow, it’s essential to follow best practices for exporting and importing processes.\n\nAchieving a seamless workflow when transitioning Revit models to 3ds Max requires more than technical steps; it demands careful planning and strategic execution. Each method, whether DWG, FBX, or RVT, has unique considerations that can impact the final result.\n\nA well-managed workflow minimises errors, saves time and enhances the overall rendering process, enabling architects to bring their visions to life accurately and clearly.\n\nThe key tips to optimise the process and achieve high-quality results are as follows:\n• File Size Management: Simplify the Revit model by eliminating redundant elements and using section boxes to restrict exported geometry, reducing file size and complexity.\n• Material Refinement: Be prepared to replace Revit materials in 3ds Max to achieve higher-quality render outputs.\n• Linked Files: Export linked files in Revit separately and import them into 3ds Max as needed to maintain the model’s structure.\n• Lighting Adjustments: While Revit lighting can be imported, adjustments in 3ds Max are often needed for precise placement, intensity, and overall realism.\n• Test Early: Run test renders at key stages to identify and resolve issues promptly.\n\nImplementing these tips ensures a smoother transition from Revit to 3DS Max, reducing potential errors and optimising the workflow for better results. However, a seamless workflow depends on how the imported data is managed.\n\nUnderstanding the difference between linking and importing in 3DS Max is a critical part of this process, as each method offers unique advantages that can influence model updates and overall project efficiency.\n\nWhen you’re moving Revit models to 3ds Max, deciding between linking and importing is crucial as it can significantly affect your workflow. Each method has distinct advantages based on project requirements.\n\nLinking establishes a dynamic connection between Revit and 3ds Max, enabling easy synchronisation of updates, which is ideal for iterative workflows. In contrast, importing creates a static version of the model in 3ds Max, providing full control and independence from the original Revit file.\n\nThe common differences between linking and importing in 3ds Max are as follows:\n\nUnderstanding the common differences between linking and importing in 3ds Max allows architects to make informed decisions based on their project requirements. By leveraging the strengths of either method, you can optimise your workflow and balance efficiency and control.\n\nExporting Revit files to 3ds Max is crucial for creating high-quality visualisations. Success requires careful preparation, attention to detail, and selecting the right export method—DWG for precision and instancing, FBX for linked files, or RVT for direct integration.\n\nArchitects refine models in Revit, optimise materials, and leverage the advanced tools in 3ds Max to transform their designs into stunning, photorealistic renders. This approach ensures a seamless workflow, bridging the gap between design and visualisation to bring projects to life effectively.\n\nAre you looking for BIM solutions?\n\nBIM ASSOCIATES is your one-stop BIM Solution provider for Architecture and Structure. Their solutions help clients with better decision-making, cost-saving, efficient construction planning, and green earth initiatives.\n\nYou might also like: Importance of Construction Drawings: Types, Details & Regulations.\n\nYes, Revit is compatible with 3ds Max. Models can be transferred seamlessly using different methods, allowing smooth integration of Revit’s BIM data into 3ds Max for advanced rendering and visualization.\n\n2. Is 3ds Max better than Revit?\n\n3ds Max is built on older CAD technology and is primarily used for creating 3D designs and graphics, while Revit is a modern tool focused on Building Information Modelling (BIM). 3ds Max excels in visualisations and detailed graphics, whereas Revit is designed specifically for architectural design and project management.\n\nNo, AutoCAD cannot directly import Revit files. However, you can export Revit models as DWG files, which AutoCAD can open."
    },
    {
        "link": "https://forums.sketchup.com/t/importing-revit-models-into-sketchup-with-materials/10877",
        "document": "rvt2skp | The most accurate Revit to SketchUp exporter\n\nFast and simple Revit to SketchUp plugin. Less model clean-up (conserves geometry, materials, textures). More time to design with the rvt2skp plugin."
    },
    {
        "link": "https://forums.sketchup.com/t/importing-from-revit-to-sketchup-applying-materials-workflow/138593",
        "document": "Hi everyone - Just would like to check if I’m using the best workflow for importing models from Revit to Sketchup.\n\nThe client sends either 3D CAD dwg format files or Sketchup Export files using the Revit Sketchup plugin from Slimlab to export the files.\n\nThe files are normally between 100-700Mb in size when I open in Sketchup.\n\nWhen I import the CAD file I get a list of layers that helps me to separate(delete) the model content I do not need( M&E, terrain or steel structure) depending on what I need to show in my visuals. Applying materials is a little faster because most of the geometry has a color assign to it form Revit. However some geometry for example walls and glass share the same color then the process starts to separate the two and apply new materials.\n\nWhen I get Skecthup export file from Revit there is no layers with geometry grouped separately and I can delete what is not required. But when it comes to apply textures all the geometry is white(default) color material. Then begins the task of separating geometry and opening up each grouped elements and apply materials.\n\nOn a small job this is acceptable but when working on large projects this is very time consuming. So much so that almost more then half the time is spend in preparing and cleaning the models before I can start rendering views.\n\nI do use Cleanup and Material Tools plugins but this can take up to 30-50mins to process sometimes.\n\nIs there perhaps a faster workflow or more productive way to approach this? I would be very interested to get some replies on other users experience on this topic.\n\nPerhaps there is some better work flow methods?"
    },
    {
        "link": "https://blog.sketchup.com/article/six-tips-to-maximize-the-revit-importer",
        "document": "SketchUp’s much-anticipated, native Revit Importer headlined our 2023 Studio update. Now that you’ve had some time to test it out, use these six tips to step up your Revit to SketchUp workflow and save yourself — and your project team — hours or even days.\n\nSpread the word — SketchUp’s Studio subscription now includes an all-new, native Revit Importer. We’re energized by the excitement and feedback we’ve heard from the SketchUp community since the official launch in February. The tips and tricks below will streamline your workflow from Revit to SketchUp and back again.\n\nYou’ll want to try this\n\nThe Revit Importer needs no introduction. Much like it sounds, the importer brings Revit models into SketchUp, converting families and building elements to SketchUp’s native tags and components. It optimizes geometry, creating a lightweight and well-organized SketchUp file that’s ready to use. What’s most exciting is the importer empowers everyone in the AEC industry — not just architects and high-powered Revit users — to very easily bring Revit files into SketchUp at any stage of the design.\n\nBefore we get to the workflow tips, let’s highlight just a few key scenarios where moving from Revit to SketchUp makes sense. These are the moments where the importer really shines.\n\nIn all but the most idyllic of projects, you may come to a point where a design choice doesn’t work exactly as envisioned. Of course, there’s always a deadline, so you need to model and study alternate solutions quickly. SketchUp excels when it comes to conceptualizing and communicating ideas. Jump into SketchUp to make design decisions faster without committing to hours of detailed work in Revit.\n\nEven on the best days, complex geometry can be difficult to build and manipulate in Revit. Import your latest model into SketchUp to add new geometry that might otherwise be too time-consuming to build natively in Revit. 3D Warehouse, a library of millions of pre-built SketchUp models, speeds up your workflow and lets you explore 3D models that Revit doesn’t typically handle, like specific furniture from real-life brands, plants and landscape features, or specialty equipment.\n\nSketchUp’s widespread use across the AEC industry means that the majority of your project partners are familiar with it — and if not, its intuitive tools are easy to pick up. Landscape architects need the latest 3D model to design accurate site context (not to mention SketchUp is great for showing trees and vegetation). General contractors may use SketchUp models for phased workflow planning. For project stakeholders that don’t work in Revit, the importer enables you to widely share up-to-date 3D models with minimal effort.\n\nTake your imported 3D model on-site using SketchUp for iPad, available in all SketchUp subscriptions. Open the model on your iPad for mobile walkthroughs, and use augmented reality to take stakeholders on a virtual tour of their soon-to-be project while you’re on the job site. Lightweight SketchUp models plus iPad make on-the-go show-and-tell easy.\n\nSketchUp helps you more effectively ideate and communicate at any stage of the design process. With no shortage of ways the Revit Importer can both simplify and expedite your workflow — not to mention the ease of the import — you’ll be on the lookout for any excuse to jump into SketchUp.\n\nSubscribed to Go or Pro, but not Studio? Take a look at these three interoperability tips for other ways to move from Revit to SketchUp.\n\nWith a little pre-planning and a few considerations, you can seamlessly transition from Revit to SketchUp.\n\nRevit starting view and levels translated to sections in SketchUp — some of the importer’s default logic\n\nUnderstanding the Revit Importer’s default behavior lets you know what to expect in SketchUp. You can control which elements are imported into SketchUp using view templates, graphic overrides, and hide/unhide in Revit. These are the basics of the default import logic.\n• Everything visible in Revit’s default 3D view will be included in the import. Anything hidden in that 3D view will not transfer.\n• Revit families are converted into components and tagged with the name of the family category (i.e., walls, floors, windows, furniture).\n• Entities in Revit are imported as SketchUp components. Identical entities are preserved as identical components in SketchUp, enabling you to edit all instances of the component when you edit any one of them.\n• Levels from Revit are imported as sections in SketchUp, letting you easily view each floor plan. Each section is given the same name as the associated Revit level.\n• Interior and exterior finishes are converted to colors, not materials. Transparent materials are supported and converted, so glass comes in as a transparent color. All surfaces with the same specified material in Revit will be the same color and transparency in SketchUp (more about materials below).\n• The importer places models at a consistent location based on the origin point. If you re-import an updated model, it will land in the same place as the old model in SketchUp.\n\nSimply put, we designed the importer to create an immediately usable SketchUp model. It’s as though you built it — and organized it really well — natively in SketchUp. No surprises!\n\nFor a more technical dive into the ins and outs of the Revit Importer, check out the Revit to SketchUp help article.\n\nMinimize the number of unique elements, materials, and tags to keep models lighter weight and easy to navigate.\n\nWhat’s good for modeling is typically good for construction. Keep a clean, well-organized Revit file with as few materials and unique families as possible. Before importing, double-check your Revit model. Clean up unnecessary model elements so you don’t end up with unwanted tags, colors, and data bogging down your SketchUp model. You wouldn’t use 50 window types if you can get away with four or five. In SketchUp, this equates to a better-organized, lighter-weight, more usable file. In construction, it means simplified planning, reduced cost, and more efficient installs.\n\nThis clean-model thinking applies to sharing models with consultants too. Landscape architects may only need the building exterior so they can add site context around it — no need to bring in MEP fixtures, HVAC equipment, furniture, etc. Hide those elements in Revit before the import for a more optimized SketchUp file.\n\nConstruction projects often include phases that dictate what work should happen and when. Phases aren’t a standalone feature in SketchUp, but preserving and sharing your Revit phases using Tags is simple.\n\nThe goal here is to separate phases in Revit and bring each in with its own import. Importing each phase without any other geometry will turn that entire phase into a single component. You can then tag it with the name of the phase and hide or show it as needed. Here’s the breakdown.\n• In Revit, hide everything in your model except for the phase you want to import.\n• Import the file into SketchUp. You should see the phase you just saved in Revit, turned into one big component.\n\n Pro tip: You may need to hide certain tags or geometry in your SketchUp model to see what you just imported if there’s overlap between that phase and anything else you’ve already transferred into SketchUp. The importer defaults to the same origin point each time, so as long as you didn’t move things in either model, the phase you just imported will align perfectly with other parts of your SketchUp model. It may just be hidden under other geometry.\n• Create a new tag with the name of the project phase. Select the new component, and assign it the phase tag.\n• That’s it! Your phase is now built as a component and tagged for easy file organization. Toggle the visibility of the tag off or on depending on what you need to show the team.\n• Repeat the process for any other phases you want to preserve in your SketchUp model.\n\nWith a little pre-planning, parse out your imports to bring in phases and tag them so you can toggle them off and on independently. If your Revit model is organized, it likely will have taken you longer to read this section than it will to import your next phase!\n\n4. Replace materials with just a click (or two)\n\nThe importer gives you a solid foundation for materials. It converts interior and exterior finishes from Revit to solid colors in SketchUp and supports transparent materials. If you’re familiar with Revit, the colors in SketchUp match the appearance of the consistent colors option. Depending on your style, you may want to add textures or swap in specific materials.\n\nCreate a material palette to quickly replace colors from Revit with SketchUp’s native materials.\n\nWith the free Material Replacer extension by Thom Thom, quickly replace those defaults with your SketchUp materials in just a couple of clicks.\n• To use the extension, activate the tool and select a surface that has the imported color you want to replace.\n• Next, click a surface that has your target material, i.e., the material you want to replace the imported material with. This replaces that selected material throughout your entire SketchUp model.\n\nThis extension can be used when first importing a model into SketchUp and is helpful when re-importing an updated Revit model. The model will revert back to those default colors each time you import. If you’ve already specified your materials in SketchUp, they’re saved in the model for you. Now it’s just a matter of clicking one instance of the color to replace and one instance of the material you want.\n\nPro tip: create a material palette when you first import your Revit model. This can be as simple as two rows of squares, one with the material you want to use and one with the corresponding colors from Revit. No need to search around the model for each material; you’ve got everything you need right next to each other. You’ll notice as you replace materials, the defaults within the palette are also replaced. You can preserve the palette for future use by saving it in a different file or as a component in another file. With each new import, just copy the palette back into the model to reuse.\n\nScenes in SketchUp let you or anyone you’re sharing a file with click a single button to move to a pre-saved view of your model. Once you save scenes, any level of SketchUp user can quickly navigate your model and see exactly what you need them to see.\n\nWhen you import an updated Revit model into a file you’ve already spent time on, the last thing you want to worry about is updating every scene. Avoid this tedious task by making sure the new model is perfectly aligned with the old one. You can take a few routes to ensure updated models or individual components align perfectly with the original.\n\nDon’t move the model: the importer defaults to the same location based on the model origin. Before importing, delete the parts of the old model you want to replace (maybe you just want the building from Revit, but the site context built in SketchUp is good to go) so you don’t end up with two models sitting on top of one another. Run the importer, and the new model will populate in the same spot as the old one.\n\nThese next two options are different variations on replacing a component. Re-import all or part of your Revit model into the SketchUp file you’ve already created. Both are helpful if you’ve moved parts of the model and when sharing models with consultants. Use the fact that the importer converts geometry into components to your advantage to easily swap old for new.\n\n‘Replace selected’ component to easily place an updated component in the same location.\n\nLet’s say you have an updated structural model from your engineer. Use the importer to bring just the updated structure into your SketchUp model. It will come in as a new component.\n• Select the old component in your model.\n• With that selected, find the new component to replace it with from the “Components” tray\n• Right-click the component in the tray, and choose “Replace selected.” This will replace the old with the new in the same location as the old.\n\nPro tip: this workflow will create duplicate components in your file. Even though you delete the old component from the model, SketchUp saves it in the file so you can use it later. Use the “Purge unused” command to delete the duplicate permanently. “Purge unused” will also remove unused materials and styles and is a great habit to get into to keep your file size down and ensure files are as clean as possible before sharing. From the “Window” dropdown, open “Model Info” to find the “Purge unused” button.\n\n‘Reload’ achieves the same goal as ‘Replace selected’ without creating a duplicate component in your model.\n\nReload quickly replaces all instances of the selected component with a new version. It’s handy for replacing furniture, windows, plantings, etc. — anything repeated in the model where you want to replace every instance. Reloading avoids duplicate components in your model and speeds up processing time by not importing a new component into an already large SketchUp file. We’ll use the same example from above.\n• Start a new SketchUp file and import the updated part of the model into the new file. What you import should be the portion of the model you want to update, again converted into a component.\n• Save the file with only the component you’ll use to replace the old one.\n• Back in your main model, select the component to be replaced.\n• Select the new file you just created from the dialog, and click open, “reloading” a new version of the component.\n\nPro tip: to make some friends on your project team, share the “reload” workflow. Send consultants just the smaller, updated component files instead of the entire model. With the updated component file, they can select the old component in the SketchUp file they’re already working on, hit “Reload,” and replace the old with the new without even opening the updated file you shared. Save them the copy-and-paste and the duplicate components, and you’ll be the MVP.\n\nAfter making design decisions based on your SketchUp model, you likely want to go back to Revit to update a construction documentation (CD) set or finalize permit documentation. People often don’t realize you can bring SketchUp files directly into Revit by linking or importing them. From the “Insert” tab, use the “Link CAD” or “Import CAD” functions. It’s worth noting that you’ll need to have the file type in the dialog set to SketchUp files. The default is CAD file types, so you may not initially see your SketchUp file as an option.\n\nThe Link CAD tools in Revit provide a handful of ways to bring SketchUp models back into Revit\n• Import CAD: there is a handy process for importing SketchUp geometry via IFC. Check out our in-depth Revit Importer demo for that workflow, and skip ahead to the Exporting IFC chapter. While converting your whole SketchUp model to Revit geometry is possible, it’s not generally recommended for well-developed Revit models. It doesn’t preserve everything you’ve already built into your Revit file and can also make for some finicky editing, with the new model often obscuring the old one.\n• Link CAD: linking lets you use your SketchUp model as an overlay in Revit. You can see what edits were made and where new elements were added in SketchUp but make edits directly to the Revit model for precise updates. This keeps your model lighter weight by not adding new geometry and saves you from those overlapping model elements.\n\nNote: if the SketchUp model shows up in Revit at unexpected locations, you may need to play with the “Positioning” and “Place at” controls in the insert menus.\n\nBONUS TIP: take it beyond SketchUp\n\nThe Revit Importer makes it easy to pop in and out of SketchUp at any point in the design process, so you can quickly take your visualization and communication further. And now that it’s easy to move into SketchUp, take advantage of the wider Trimble ecosystem and other SketchUp integrations. Included with your subscription are a handful of Trimble tools that unlock new potential for your SketchUp model.\n\nUse Trimble Connect to share models, gather feedback, and collaborate.\n• Collaborate with stakeholders using Trimble Connect. Clients and consultants can access your shared model from any device, anywhere — no paid subscription needed. Collaborators can view the model, leave feedback, and assign tasks in the Trimble Connect web interface.\n• Set your team up to present a model they didn’t build. Scenes saved in the model can be easily navigated when someone downloads and opens the model, either in their preferred version of SketchUp or in SketchUp for Web, which is free to access. With an intuitive, easy-to-learn interface, partners can easily click from scene to scene for show-and-tell.\n• Access top visualization tools. Give life to your vision with beautiful imagery and real-time rendering with V-Ray® or your favorite visualization engine.\n\nTry out the Revit Importer\n\nTake the Revit Importer for a test drive with a free Studio trial. Don’t have access to a Revit file? Not to worry! You don’t need a Revit license to use the importer. Download this SketchUp HQ Revit model to test the workflows yourself, or watch the in-depth Revit Importer walkthrough to follow along with a live demo of these top tips.\n\nIf you already have a Studio subscription, you can access the all-new Revit Importer by updating to the latest version of SketchUp. Download it here or via your Trimble Account. If you’re ready to upgrade, purchase Studio or upgrade to Studio from your current subscription.\n\nLearn about all the newest Sketchup tools and capabilities in the 2023 release post."
    },
    {
        "link": "https://forums.autodesk.com/t5/revit-architecture-forum/importing-sketchup-file-into-revit-from-interior-designer/td-p/12377795",
        "document": "I am having issues with the best workflow with this. The interior Designer I work with uses Sketchup. I send her an exported 3D view of the house and she models furniture and casework into it. I tried just importing the dwg into my Revit file but some of the furniture is messing up and also it is not cutting in view range.\n\nI looked into it and it said to insert the dwg as a generic model and my revit crashes when trying to import it.\n\nDoes anyone else use this workflow? I would really like it to workout. Thanks!"
    },
    {
        "link": "https://forums.sketchup.com/t/dwg-import/95764",
        "document": "PRO If you're a SketchUp Pro user, you can import or export CAD files, which use the .dwg or .dxf file formats."
    }
]