[
    {
        "link": "https://docs.mql4.com/indicators/ima",
        "document": "Calculates the Moving Average indicator and returns its value.\n\n[in] Symbol name on the data of which the indicator will be calculated. NULL means the current symbol.\n\n[in] Timeframe. It can be any of ENUM_TIMEFRAMES enumeration values. 0 means the current chart timeframe.\n\n[in] MA shift. Indicators line offset relate to the chart by timeframe.\n\n[in] Moving Average method. It can be any of ENUM_MA_METHOD enumeration values.\n\n[in] Applied price. It can be any of ENUM_APPLIED_PRICE enumeration values.\n\n[in] Index of the value taken from the indicator buffer (shift relative to the current bar the given amount of periods ago).\n\nNumerical value of the Moving Average indicator."
    },
    {
        "link": "https://book.mql4.com/samples/indicators",
        "document": "According to belonging to the on-line trading system MetaTrader 4 there are two types of indicators in MQL4 - technical and custom. Technical indicator is an integral part of the on-line trading system MetaTrader, built-in function that allows drawing on the screen a certain dependence. \n\n \n\n \n\n Each technical indicator calculates a certain predefined dependence. To draw this dependence graphically on the screen, a technical indicator should be attached to a chart. This can be done via the system menu Insert >> Indicators or via Navigator window of a client terminal. For attaching a technical indicator to a chart from Navigator window, a very simple method is used - drag-&-drop of the technical indicator name from Navigator window to a chart window. As a result one or several lines calculated in this indicator will appear in the chart window. Indicator lines of a technical indicator may be drawn both in the main chart window and in a separate window in the lower part of a security window. In Fig. 104 technical indicator Alligator is drawn in a chart window. \n\n All technical indicators are built-in, their code is not available for making modifications. So a user is secured from an erroneous modification of built-in technical indicators. However, the source code, upon which a technical indicator is calculated, is available on the software developer website (MetaQuotes Ltd.) in the section Technical Indicators. If needed, a programmer may use the full code or part of it to create custom indicators (see Creation of Custom Indicators). \n\n Graphical representation visible to a user is displayed by a client terminal. Further for convenience we will call such drawings 'indicator lines'. Indicator Line is a graphical display of a certain dependence based on numeric values included in an indicator array. Indicator line type is set up by a user. Indicator line can be displayed in the form of a solid or dashed line, of a specified color, as well as in the form of a chain of certain signs (dots, squares, rings, etc.). During indicator calculations, sets of numeric values are calculated in it; indicator lines will be drawn in accordance with these calculations. These value sets are stored in indicator arrays. Indicator Array is a one-dimensional array containing numeric values, in accordance with which indicator lines are constructed. Numeric values of indicator array elements are dots coordinates, upon which an indicator line is drawn. The Y-coordinate of each dot is the value of an indicator array element, X-coordinate is the index value of the indicator array element. Data storing technology in indicator arrays is the basis of constructing technical and custom indicators. Values of indicator array elements of technical indicators are available from all application programs, including Expert Advisors, scripts and custom indicators. For getting a value of an indicator array element with a certain index in an application program it is necessary to call a built-in function, the name of which is set in accordance with a technical indicator name. For the execution of a technical indicator function the corresponding indicator should not be necessarily attached to a security window. Also technical indicator function call from an application program does not lead to the attachment of a corresponding indicator to a security window. Attachment of a technical indicator to a security window does not result in a technical indicator call in an application program either. \n\n A number of Technical indicators is included into the client terminal of the on-line trading system MetaTrader 4. Let's analyze some of them. Technical indicator Moving Average, MA shows the mean instrument price value for a certain period of time. The indicator reflects the general market trend - can increase, decrease or show some fluctuations near some price. For getting values of MA indicator line at a certain moment, use the standard function: symbol - symbol name of a security, on the data of which the indicator will be calculated. NULL means the current symbol. timeframe - period. Can be one of chart periods. 0 means the period of the current chart. ma_method - method of averaging. Can be one of MA methods values. applied_price - used price. Can be any of price constants. shift - value index acquired from an indicator array (shift back relative to a current bar by a specified number of bars). Below is an example of calling a technical indicator function from the Expert Advisor callindicator.mq4 : In the EA callindicator.mq4 iMA() function call is used (function of the technical indicator Moving Average). Let's analyze this program part in details: NULL denotes that calculation of a moving average is done for a security window, to which the EA is attached (in this case it is EA, in general it can be any application program); 0 - it is calculated for the timeframe set in the security window, to which the EA is attached; Period_MA - averaging period value is set in an external variable; if after attaching EA to a security window a user does not change this value in the settings of the EA external variables, the value is equal to 5; 0 - indicator array is not shifted relative to a chart, i.e. values of indicator array elements contain MA values calculated for bars, on which the indicator line is drawn; MODE_SMA - method of a simple moving average is used for calculations; PRICE_CLOSE - bar closing price is used for calculations; 0 - indicator array element index, for which the value is acquired - in this case it is zero element. Taking into account that indicator array is not shifted relative to the chart, MA value is obtained for the zero bar. Function iMA() returns a value which is assigned to variable MA. In further program lines this value is compared with the the current Bid price. If the current price is higher or lower than the obtained MA value, an alert is displayed. Use of variables Fact_Up and Fact_Dn allows to show the alert only after the first crossing of MA line (note, the blue indicator line in a security window is drawn not because the technical indicator function was called from the program, but because a user has attached the indicator to the chart, Fig. 104). It should be noted here that with the appearance of new bars indexes of history bars increase, the currently being formed bar always has the 0 index. In the Expert Advisor callindicator.mq4 the technical indicator function iMA() returns the value calculated for the zero bar. Though the index value is never changed during the EA execution (i.e. calculations are always conducted for on the current bar), the value returned by iMA() will always correspond to the last calculated, i.e. calculated for the current zero bar. If for some calculations in the program we need to obtain the value of a technical indicator value not for the current bar, bur for a historic one, the necessary indicator array index should be specified in the function call. Let's view an example of EA historybars.mq4, in which MA is calculated on the fourth bar: In the EA historybars.mq4 MA values are calculated for the current bar (index 0) and for the fourth bar (index 4). The indicated indexes 0 and 4 do not change during this program operation and the program can operate infinitely long each time calculating MA values for the zero and the fourth bars. Remember, though calculations are made for MA on bars with the same indexes, MA will be changed, i.e. will correspond to current MA values on the current zero bar and the current fourth bar. In Fig. 106 it is clear that as prices grow on the las bars, MA goes up. The difference between MA values on the zero and the fourth bars also grows which is reflected in the displayed alerts. \n\n Technical indicators may reflect not only one, but also two or more indicator lines Technical indicator Stochastic Oscillator compares the current closing price with the price range for a selected period of time. The indicator is usually represented by two indicator lines. The main one is called %K. The second %D signal line is the moving average of %K. Usually %K is drawn as a solid line, %D - dashed. According to one of the indicator explanation variants, we should buy if %K is higher than %D and sell if %K goes lower than %D. The most favorable moment for executing a trade operation is considered to be the moment of concurrence of lines. symbol symbol name of a security, on the data of which the indicator will be calculated. NULL means the current symbol. timeframe - period. Can be one of chart periods. 0 means the period of the a current chart. method - method of averaging. Can be one of MA methods values. price_field - parameter of choosing prices for calculations. Can be one of the following values: 0 - Low/High or 1 - Close/Close. mode - index of indicator lines. Can be one of the following values: MODE_MAIN or MODE_SIGNAL. shift - index of the obtained value from an indicator buffer (shift back relative to a current bar by a specified number of bars). Using Stochastic Oscillator offers the necessity of analyzing the relative lines positions. For calculating what trade decision should be performed, the value of each line on the current and previous bars must be taken into account (see Fig. 107). When lines cross in the point A (green line crosses the red one upwards), Sell order should be closed and Buy order should be opened. During the part A - B (no lines crossing, green line is higher than the red line) Buy order should be held open. In point B (green line crosses the red one downwards) Buy should be closed and Sell should be opened. Then Sell should stay open till the next crossing (no crossing, green line below the red line). \n\n Fig. 107. Concurrence of the main and the signal lines of Stochastic Oscillator. The next example contains the implementation of a simple algorithm that demonstrates how necessary values of each line can be obtained and trading criteria can be formed. For this purpose values of technical indicator functions iStochastic() are used in the EA callstohastic.mq4: For obtaining %K line value (solid green) on the zero bar, the following calculation line is used: Here parameter MODE_MAIN indicates the line, the value of which is asked, the last parameter 0 is the bar index, for which the line value should be calculated. In the three following program lines other variables are calculated by analogy - for %D line (red dashed line, parameter MODE_SIGNAL) for the zero and the first bar. In the next block the correlation of obtained values is analyzed and the EA reports about the current state on each tick. For example, in lines: the fact of a red line's being crossed by the green one upwards is detected. If on the previous bar the green line was below the red one (i.e. the expression M_1 < S_1 is true), and on the current bar the green line rises above the red one or their values are equal (i.e. the expression M_0 >= S_0 is true), it means that from the previous bar formation to the current moment the green lone crossed the red one upwards. Thus condition calculated in 'if' operator is true, that is why control is passed to 'if' operator body, as a result Alert() is executed to show the corresponding message. In an Expert Advisor intended for trading in 'if' operator body a trading function for opening a Buy order should be indicated. In this case the analyzed variant of indicator lines' crossing will lead to the formation of a trade order and, finally, to the execution of a trade operation. For the variant when the green line crosses the red one downwards, in 'if' body a trade function for opening a Sell order should be indicated. Using functions of technical indicators to create trading Expert Advisors and scripts is very convenient. Amount of technical indicator functions used in one Expert Advisor is unlimited. A trading strategy developer may decide to define different trading criteria based on the combination of technical indicator values. Example of a simple trading Expert Advisor, trading criteria of which are based on technical indicators, is analyzed in the section Simple Expert Advisor."
    },
    {
        "link": "https://docs.mql4.com/indicators/imaonarray",
        "document": "Calculates the Moving Average indicator on data, stored in array, and returns its value.\n\n[in] The number of items to be counted. 0 means the whole array.\n\n[in] MA shift. Indicators line offset relate to the chart by timeframe.\n\n[in] Moving Average method. It can be any of ENUM_MA_METHOD enumeration values.\n\n[in] Index of the value taken from the indicator buffer (shift relative to the current bar the given amount of periods ago).\n\nNumerical value of the Moving Average indicator, calculated on data, stored in array[].\n\nUnlike iMA(...), the iMAOnArray() function does not take data by symbol name, timeframe, the applied price. The price data must be previously prepared. The indicator is calculated from left to right. To access to the array elements as to a series array (i.e., from right to left), one has to use the ArraySetAsSeries() function."
    },
    {
        "link": "https://mql5.com/en/forum/134867",
        "document": "I am trying to chart the of a variable I have called \"eqb\"\n\nCan I use the iMA to say:\n\nWhat is the best way to do this without manually computing this?"
    },
    {
        "link": "https://docs.mql4.com/indicators",
        "document": "A group of functions intended for calculation of standard and custom indicators. For an Expert Advisor (or any other MQL4 program) to take up the value of any indicator, it is not necessary that this indicator is present in the chart. The requested indicator will be loaded and calculated in the thread of the module that has called it. Any indicator can be calculated on the data of not only current chart, but also on the data of any available symbol/period. If data (symbol name and/or timeframe differ from the current ones) are requested from another chart, the situation is possible that the corresponding chart was not opened in the client terminal and the necessary data must be requested from the server. In this case, error ERR_HISTORY_WILL_UPDATED (4066 - the requested history data are under updating) will be placed in the last_error variable, and one will has to re-request (see example of ArrayCopySeries()). All indicator functions have at least 2 parameters - symbol and period. The NULL value of the symbol means the current symbol, the 0 value of the period means the current timeframe. Calculation of Bollinger Bands® indicator on data, stored in a numeric array Calculation of Commodity Channel Index indicator on data, stored in a numeric array Calculation of Envelopes indicator on data, stored in a numeric array Calculation of Momentum indicator on data, stored in a numeric array Calculation of Moving Average indicator on data, stored in a numeric array Calculation of Momentum indicator on data, stored in a numeric array Calculation of Standard Deviation indicator on data, stored in a numeric array In MQL5, the number of built-in technical indicators has been increased from 30 to 38. The indicators are generated and managed using handles to avoid unnecessary copies and reduce memory consumption. For the same purpose, new functions for working with indicators and timeseries are presented  they allow receiving indicator values in entire arrays rather than by a single value. New functions have been added for working with indicators. Among them are ChartIndicatorAdd() and IndicatorRelease() ones for dynamic adding and removal of indicators when creating complex technical analysis tools. Add an indicator with the specified handle into a specified chart window Delete an indicator handle and release its calculation part if unused"
    },
    {
        "link": "https://earnforex.com/guides/how-to-add-alerts-to-metatrader-indicators",
        "document": "Originally, this guide had been intended as a guide on how to add alerts to MetaTrader indicators without knowing how to code at all. But this tutorial had been written, it became clear that if you know nothing about MQL language and coding, you would need to learn some basics through this guide because adding alerts does require deep understanding of how MetaTrader code works.\n\nOne important thing to understand is that it isn't possible to add alerts to indicator without at least some coding. The good thing is that what you will require is so simple that even a 5-year old could do it after reading this post. You have to do three things to add an alert to an indicator:\n• Add input parameters for turning alerts on/off and adjusting some alert settings — all entirely optional but it is better to have some easy way of configuring things than to everything each time your needs shift.\n• Identify indicator buffers that are used by an indicator and contain the data you want to be alerted about.\n• Formulate conditions for alerts to fire up. For example, a classic condition for MACD buy alert could be formulated as: current MACD Signal below current MACD Main and previous MACD Signal above previous MACD Main and both current MACD Signal and MACD Main are below zero. Conditions can be simpler or more complex, but you should already know what you want to be alerted about if you are looking to add alerts to an indicator.\n\nBefore you proceed, make sure that the prerequisites listed below are met:\n• You will need an access to the indicator's source code — .mq4 file for MetaTrader 4 and .mq5 file for MetaTrader 5. Sometimes indicators use more than one file for their source code. In such case, you would need .mqh files as well. You will not be able to add alerts to an indicator if you lack its source code. You can ask the indicator's author for the source code if you only have a compiled file (.ex4 or .ex5).\n• Although you do not need to have prior coding experience to follow this tutorial, you still need to have some understanding of coding basics, for example: how to compile an indicator or what a variable is.\n• You need to pay attention to every step listed in this tutorial. Thoughtless copy/paste will not work here at all.\n\nYou are probably familiar with the different types alerts that exist in MetaTrader:\n\nMost of the time, traders want the plain native alerts but it is a good practice to implement all four at once and to give a choice (via input parameters) to enable and disable certain types of alert. You will learn to add four input parameters: , , , .\n\nAnother important input parameter is the candle to use for triggering the alert. Normally, you want the alert to be triggered on the close of the candle #1 when the latest candle (#0) has just started forming — that way you get a final and true alert (unless your indicator repaints itself). Sometimes, traders want to receive their alerts as fast as possible, then looking for alert conditions on candle #0 can be a better choice. Of course, the alert may turn out to be false as the indicator values on candle #0 a susceptible to changes with each new tick. The input parameter that controls the number of trigger candle will be called . It will be equal to by default, but a trader will be able to change it to .\n\nIf you plan using email alerts, adding an input parameter for an email subject is also a must. can be set to some fixed string or it can be modified by the alert code during . The former case is much simpler of course. Do not forget to enable and configure email alerts in your platform via menu Tools->Options->Email.\n\nIf you plan using push notifications to your phone or other mobile device, you need to enable and configure them in your platform via menu Tools->Options->Notifications.\n\nAll types of alerts need some text to display or send. parameter can contain some preset text, which will also be modified according to the particular alert's parameters.\n\nOne additional parameter is useful when using sound alerts — . It can be used to set the name of the audio file for the platform to play during alert.\n\nFind the last line starting with (older MT4 indicators) or (MT5 and newer MT4 indicators) statement. Insert the following code after that line:\n\nThis code uses empty initial alert text and email subject. They will be filled during alert evaluation.\n\nIndicator buffers are the vital part of almost any MetaTrader indicator. They contain the data, which is displayed on the chart or is used in calculations. Finding indicator buffers is very easy. Search for call. You will see one or more lines that look like this (in old MT4 indicators):\n\nor like this (in newer MT4 or MT5 indicators):\n\nWhere is the buffer's number (you do not need it for alerts) and is the buffer's name, which you need to formulate the alert conditions.\n\nNow, the tricky part is to find the right buffers if there are more than one. In MT5 and newer MT4 indicators, you will see this parameter in call, which can help determining the right buffers for alert - you will want those with (they produce the actual display on the chart).\n\nIn some cases, determining the right buffer is easy - there might be only one, or it is called appropriately, or you know how the indicator works. In other cases, I would recommend some trial and error work if you do not want to study the code.\n\nLooking at some real life examples of calls might help you finding the buffer names in the indicators you work on.\n\nLines 40-41 of the default MACD indicator in MetaTrader 4 show two buffers:\n\nObviously, is the main line buffer and is the signal line buffer.\n\nIf you look at the lines 29-31 of the .mq4 source of the CCI Arrows indicator, you will see three buffers there:\n\nNaturally, you would think that is for Up-arrows and is for Down-arrows. But what is ? The thing is that if you search the code for it, you will find that it is not used anywhere at all. It means that you can safely ignore it and base all your alerts on the former two buffers.\n\nThe MT5 version of the Aroon Up & Down indicator contains the following lines:\n\nBoth function calls have parameters, which means that both buffers ( and ) contain values plotted on the chart. Clearly, is used for calculation of the Up-line and is used for the Down-line.\n\nLines 46-47 of the MT5 Coppock indicator also show two buffers:\n\nThe parameter tells us that is not an indicator buffer used for display but rather a buffer used for intermediate calculations. is the only buffer that can be used for alerts here - unsurprisingly so because Coppock indicator is represented by a single histogram.\n\nNow after you have successfully identified the names of the indicator buffers that you plan using in your alerts, it is time to add the actual alert conditions.\n\nAll alerts are appended to the end of the indicator's main calculation function. In older MetaTrader 4 indicators, it is called . The alert conditions code should be inserted just above the last statement inside that function. In newer MT4 and in MT5 indicators, the function is called and its declaration can vary from one indicator to another. You have to insert the alert conditions code just above the last statement inside that function.\n\nThe actual conditions will differ depending on the alert type you wish to add to the given indicator. This guide will cover the three most popular cases: signal, level, and cross.\n\nSignal is a type of alert that is triggered when some indicator buffer assumes some non-zero level. Arrow indicators would use this kind of alert normally. Adding alert to the aforementioned MT4 CCI Arrows indicator would look like this:\n\nThe code should be added just before the latest statement inside the function.\n\nAdding the same alerts to MT5 version of CCI Arrows is only marginally different:\n\nThat code should be inserted just above the latest statement inside the function. It assumes that the time and buffer arrays are not set as series. If they are, you would need to substitute for and for .\n\nLevel alerts are also very simple. If an indicator reaches a certain value (from above or from below), the alert is triggered. Single-line indicators shown in separate window use this kind of alert normally. Here is how the alert conditions for crossing of zero level would look in the MT4 version of Coppock indicator:\n\nThe same for the MT5 version would look like this:\n\nAs is the case with the previously discussed signal alert for MT5, you would need to substitute for and for if the indicator sets its buffers as series. Also, would have to be changed to .\n\nCross alerts are more complex than the previous two types. They are triggered when some indicator buffer crosses the price line or when two lines of an indicator cross each other, or when several lines cross each other. Let's look at the cross alert implementation for MT4 Aroon Up & Down indicator. We will look for the Up-line crossing the Down-line from below and from above as two distinct alerts:\n\nThe same code for MT5 Aroon Up & Down looks like this:\n\nSame as before, substitute for and for if the indicator uses buffers that are set as series. Again, would have to be changed to in that case too.\n\nLet's illustrate the alert generated with these conditions with this screenshot:\n\nOf course, the variety of alerts is not limited by the three types described above. Some alerts can have multiple dependencies (e.g. one line crossing the price while two other lines cross each other), other alerts might depend on time, volume, additional calculations, or a combination of various factors. It is even possible to add alerts to indicators that do not use buffers or plot anything on chart.\n\nSuch cases are not covered by this DIY guide. Some basic cases can be easily derived from the code snippets offered above while difficult cases are nontrivial ones and demand special approach and extra attention. However, you will certainly learn to add such complex alerts after some practice with the elementary ones.\n\nIn the end, I would like to summarize the process with a simple list of steps:\n• Add the predefined input parameters just below the latest or statement in the indicator's source code.\n• Identify the buffer names that represent the indicator's plot on chart.\n• Insert the appropriate alert conditions code just above the latest inside function or inside function.\n• Replace the buffer names with those that you identified in the second step.\n\nHow do I include the chart's timeframe in the alert's text?\n\nYou can do that by appending to your alert text. Like this:\n\nHow do I add alerts to an indicator that changes colors (e.g., a colored MA)?\n\nIf it is an MT5 indicator, then most likely the indicator plot is of type and there is a separate buffer for the color index of the plot (marked with ). You can check that buffer in conditions for alerts. It contains color numbers, so you can issue alerts, for example, if the value was 0 at previous candle and is 1 at the current candle or something like that, depending on the indicator's logic.\n\nIf it is an MT4 indicator, then there is a separate indicator buffer for each color of the MA and you just check if a given buffer is non-zero.\n\nI am trying to add an alert to an indicator when it reaches a particular level, but that level must be variable — I want to be able to change its value. How do I do that?\n\nThat variable name would have to be declared as an input parameter at the top of the code and then used in indicator level comparison (see examples for Levels above).\n\nI understand your steps, but how do I access the code on the indicator so as to add the alerts?\n\nRight-click the indicator in the Navigator panel of your platform and select Modify:\n\nIf you there is a source code file available for that indicator in your platform, it will open it. Otherwise, you have only an executable (.ex4 or .ex5) and you have to ask the author of the indicator for the source code file (.mq4 or .mq5).\n\nHow do I change alert sounds in my indicator?\n\nFor to work with your custom .wav file, the file has to be located in the /Sounds/ subfolder of your platform’s program folder (not data folder) — it is usually under C:\\Program Files (x86)\\\n\nTo change what sound is used when the function is called, go to Tools->Options->Events and change the sound file near Alert:\n\n\n\nMy alert code executes only once or doesn't execute at all even though my conditions are correct, why?\n\nMake sure you are inserting your alert code inside the function ( in older versions of MT4) and not inside , , or any other function.\n\nIf you still have some general question about adding alerts to custom MetaTrader indicators, if you want to share your own tips for doing it, or if you want help with adding alerts to a specific indicator, please post about it in the forum."
    },
    {
        "link": "https://wemastertrade.com/how-to-set-up-mt4-alerts",
        "document": "In trading, timing is key, and MT4 alerts can help you stay ahead of market movements without constantly monitoring the charts. With these alerts, you’ll be notified instantly when important price levels are hit, allowing you to act quickly. In this quick guide, we’ll show you how to set up MT4 alerts on both desktop and mobile, so don’t miss out on key market changes!\n\nIn the highly dynamic world of trading, staying informed about key market movements is crucial. MT4 alerts play an essential role in helping traders keep up with price changes, market trends, and trading opportunities without needing to constantly monitor their screens. Here’s why MT4 alerts are so important:\n• Real-Time Market Updates: MT4 alerts notify you instantly when a specific price level, indicator condition, or market event is triggered. This allows you to make timely decisions, even when you’re not actively watching the market.\n• Time-Saving: By setting alerts, traders can focus on other tasks while staying informed. Instead of constantly tracking the market, MT4 alerts enable you to manage your time more effectively, ensuring that you’re only alerted when it matters.\n• Reduced Risk: Alerts help you stay ahead of sudden market shifts, allowing you to take action quickly to protect your investments. Whether it’s closing a position or entering a trade at the right time, alerts can reduce the risk of missing critical opportunities.\n• None MT4 For Mobile Trading Platform – How to Download MT4\n• None Detailed instructions on how to install MT4 just 3 minutes\n• None All Truths About MetaTrader 4 – Is MT4 safe to use\n\nHere are the main types of MT4 alerts:\n\nPrice alerts notify you when a specific asset reaches a predetermined price level. This is especially useful for setting entry or exit points in your trading strategy.\n• Example: You set an alert to notify you when EUR/USD reaches 1.1500.\n\nThese alerts are triggered by technical indicators, such as moving averages, RSI, or MACD. You can set alerts to notify you when certain indicator conditions are met, like when an RSI crosses a threshold.\n• Example: An alert goes off when RSI crosses below 30, indicating a potential oversold condition.\n\nTime alerts notify you at specific times or intervals, which can be useful for time-based trading strategies or reminders to check the market.\n• Example: You receive an alert every hour to check the price action of a particular asset.\n\nMT4 can be configured to send alerts when important market news is released. This helps traders stay informed about key economic events that could impact their trades.\n• Example: An alert triggers when a scheduled news event, like a GDP report, is about to be released.\n\nEmail alerts send notifications directly to your email inbox when the conditions you set are met. This can be helpful if you’re away from the platform and need updates on important price movements or market conditions.\n\nHow to Set Up MT4 Alerts on Desktop\n\nSetting up alerts on MetaTrader 4 (MT4) is an easy process that helps you stay up to date with important market events without having to constantly monitor your charts. Here is a step-by-step guide how to set up MT4 alerts on your desktop:\n• First, open the MT4 platform and start your platform.\n• Next, log in to your trading account. Make sure the asset you want to set an alert for is open in your chart window.\n• At the bottom of the MT4 interface, look for the Terminal window.\n• If you don’t see it, you can open it by clicking View in the top menu and then selecting Terminal (or pressing Ctrl + T).\n\nStep 3: Go to the “Alerts” Tab\n\nIn the Terminal window, click the Alerts tab. This is where you will manage and create your alerts.\n• Right-click anywhere in the Alerts tab and select Create.\n• This will open the Alert Editor window, where you can customize the conditions for your alert.\n\nIn the Alert Editor, you can customize the items in the following order:\n• Select the asset (e.g. EUR/USD) you want to set up an alert for.\n• Select when the alert will be triggered. Conditions include Bid greater than or Bid less than a specific price.\n• Enter the price at which you want the alert to be triggered.\n• Source: You can choose the alert type, audio alert, email, or push notification.\n• Specify how many times the alert will be triggered.\n• If you want to receive alerts via email or push notification, go to Tools > Options and select the Alerts or Email tab.\n• Here you can set up push notifications via email or mobile.\n• After setting up the conditions, click OK to create the alert.\n• The alert will now be active and listed in the Alerts tab.\n\nHow to Set Up MT4 Alerts on Mobile\n\nSetting up alerts on the MetaTrader 4 mobile app is a great way to stay updated on important price movements while you are on the go. Here is a simple guide to help you how to set up MT4 alerts on your mobile device:\n\nLaunch the MT4 mobile app on your smartphone including iOS and Android operating systems. Make sure you are logged in to your trading account.\n\nStep 2: Go to the Chart or Quotes Screen\n\nNavigate to the Quotes or Charts screen to find the asset you want to set an alert for. You can choose from any currency pair, commodity or instrument available in your account.\n\nTap on the instrument you want to set an alert for (e.g. EUR/USD) from the Quotes list. This will open an options menu.\n• After selecting the instrument, tap the “Alerts” option in the menu.\n• If you don’t see the option directly, you may need to tap the three dots to open more options.\n• In Alert Settings, customize the following:\n• Set the specific price level you want to be alerted to. You can choose to be notified when the price reaches a higher or lower level.\n• Choose how you want to be notified (vibration, sound alert, etc.).\n• To ensure you receive alerts when you are not using the app, enable Push Notifications in your app settings:\n• Go to Settings in the MT4 app. Navigate to Messages or Notifications and enable Push Notifications.\n\nFAQ about some ways to set up MT4 alerts\n\nHere are some frequently asked questions regarding how to set up MT4 alerts:\n\nCan I set up alerts for multiple instruments?\n• Yes, you can set up alerts for as many instruments as you like. Simply repeat the alert setup process for each instrument you want to monitor.\n• Yes, you can set alerts based on custom indicators, provided that the indicator has built-in alert functionality. Check the settings for the specific custom indicator to set up alerts.\n\nAre there any limitations to the number of alerts I can set?\n• There is no strict limit on the number of alerts you can set in MT4; however, excessive alerts may make it challenging to manage them effectively. It’s best to prioritize the alerts that are most important to your trading strategy.\n\nIn conclusion, learning how to set up MT4 alerts is essential for effective trading. These alerts allow you to stay informed about critical market movements without constant monitoring, enhancing your trading efficiency and decision-making. Don’t miss out on important opportunities, start configuring your MT4 alerts today and take your trading to the next level!\n• None What is the difference between MT4 vs MT5 trading platform\n• None What is MT4? What types of MT4 charting tools are there?"
    },
    {
        "link": "https://quora.com/How-do-I-use-alerts-with-a-custom-indicator-or-EA-in-MT4",
        "document": "Something went wrong. Wait a moment and try again."
    },
    {
        "link": "https://earnforex.com/metatrader-indicators/alert-indicator-template",
        "document": "When traders start studying Forex trading, they soon come to a decision that it is better to automate the trading process as much as possible. In our days, computers can provide a great help in trading system development and implementation.\n\nWhen you are developing a trading system and looking for possible entry and exit rules it is very useful to see a visual representation of when these rules would be applied.\n\nAt the same time, if you already have a working trading system, you don't want to miss any trades and you want to get alerts when your entry or exit signals appear.\n\nAlert Indicator Template is the basic template that was used for the development of our MT4 alert indicators.\n\nIt includes the basic workflow and functions of an indicator without entry and exit signals.\n\nYou can add your own entry and exit signals and run it.\n\nThis source code will significantly reduce the time you spend developing an alert indicator.\n\nMT4 Alert Indicator Template is 400+ lines of commented source code that you can use to build your own indicator with alerts.\n\nThe code is thoroughly explained so that you could easily understand its logic.\n\nYou can customize portions of the code to achieve your entry and exit signals and have an indicator ready to use.\n• Comments for each function to understand the code's logic.\n\nWhat MT4 Alert Indicator Template Is Not?\n\nAlthough it includes some finished examples to download with this template, they are only to show the potential of the code.\n\nYou will need to add your own entry or exit signals code to the template in order to have it do something useful.\n• Alert notifications — you can easily create your custom indicator to get alerts on screen, mobile, and email.\n• Save time — save many hours of research and coding using ready-made functions.\n• Visual representation — you can quickly see if your entries and exits have an edge in the market.\n• Easy-to-edit — with only a few lines of code, you can develop your own indicator and have a fully automated generation of trading signals.\n\nWhat Is the Indicator's Logic?\n\nAll indicators are divided into three main functions:\n• is the initialization of the indicator, the first function that runs when you load it.\n• runs every time MT4 receives a new quote for the current instrument.\n• runs just before the indicator is removed from the chart or the chart is changed.\n\nMT4 Alert Indicator Template is written in a modular way so that all the functions are separate. This allows you to have a source code that is easy to read and to understand and also makes it easier to customize the code.\n\nWhat Do You Need to Use MT4 Alert Indicator Template?\n\nBasic knowledge of MQL4 programming — although most of the code is provided and commented, you need to be able to add your own code for entry and exit signals.\n\nMT4 platform — the files included in the download are for MetaTrader 4 and will only work in the MT4 platform.\n\nUnderstanding of compiling — it is advisable to be familiar with compilation, which is understanding that this product is source code to be edited in the MetaEditor and compiled into a working indicator through it.\n\nWillingness to experiment — this is not a fully working trading strategy and requires some creative work to become a usable indicator. You will have to include your own entry and exit signals and strategy.\n\nThese are some extracts from the code. This is a good way to understand if this template is suitable for you.\n\nIf what you see makes sense then I am sure it will significantly help you. If it doesn't make sense but you are interested in seeing how the code for an alert indicator works, then this can help you.\n\nIf you are not the coding type of person and all this doesn't interest you, then probably this template isn't something you need.\n\n/* CUSTOMIZE THE FOLLOWING TO GET YOUR OWN INDICATOR UP AND RUNNING 1) Add to the INPUT PARAMETERS the parameters you need for your signal, this can be a period for the RSI or Moving Average, the step for a PSAR and so on 2) Add some requirement checks in OnInitPreChecksPass if it is necessary to check the consistency of the parameters 3) Define in the IsSignal function at the end of the code the rule for your signal */ //Properties help the software look better when you load it in MT4 //This is what you see in the About tab when you load an Indicator or an Expert Advisor \"So You Can Create Your Own Indicator And Alerts\" \"WARNING : You use this software at your own risk.\" \"The creator of these plugins cannot be held responsible for any damage or loss.\" //You can set an icon for the indicator to show when loading it on chart //Icon must have an ico extension and be located in the MQL4/Files folder, the following commented line is an example of icon\n\n//The input parameters are the ones that can be set by the user when launching the Indicator //If you place a comment following the input variable this will be shown as description of the field //This is likely the only section you need to edit to adapt the indicator to your goal //For example if you are using RSI in you indicator you can add here the input for the period and the relevant levels ENUM_CANDLE_TO_CHECK CURRENT_CANDLE //Candle To Use For Analysis //Arrow Style can be chosen between Wingdings and preset arrows, see following URLs for all the codes ENUM_CANDLE_SIZE CANDLE_SIZE_MEDIUM ENUM_CANDLE_DISTANCE CANDLE_DISTANCE_NEAR\n\nHow to Use Template?\n\nCustomize the following functions in order to complete the development of the signals:\n• Add the input parameters for your entry or exit.\n• function contains the code to check the validity of the input parameters — you can add your checks here.\n• Add your data to evaluate and the entry/exit rules to the IsSignal() function.\n\n//The IsSignal function is where you check if the candle of index i has a signal //This functions is where you define your signal rules ENUM_TRADE_SIGNAL IsSignal i //Define a variable j which is the index of the candle to check, this is to consider if you are checking the current candle or the closed one j i Shift //Initialize the Signal to a neutral/stop one ENUM_TRADE_SIGNAL Signal SIGNAL_NEUTRAL //Define all the values that you are going to need to check your signal rules first //Define the condition for your buy signal and assign SIGNAL_BUY value to the Signal variable if the condition is true //Define the condition for your sell signal and assign SIGNAL_SELL value to the Signal variable if the condition is true //Define the condition for your stop/neutral signal and assign SIGNAL_NEUTRAL value to the Signal variable if the condition is true //Defining a stop/neutral condition is not always necessary, many systems work with only Buy and Sell //Return the Signal and exit the function Signal\n\nTogether with the template, you also download seven fully functional alert indicators built upon the code, so you would see how the template can been customized in practice.\n\nCurrently, the following examples are included:\n• Box Breakout Alert — to alert if the price breaks out of the recent highs or lows.\n• MA Crossover — to alert if two moving averages cross.\n• MACD Cross — to alert if the MACD line crosses the zero line.\n• RSI Overbought/Oversold — to alert if RSI reached an overbought or oversold state.\n• RSI Reversal to Range — to alert if RSI returns to the middle.\n• Stochastic + MA — a composite indicator that alerts a compound alert based on MA and Stochastic.\n• Bollinger Bands Breakout — to alert if the price breaks out of the bands.\n\nTo install MT4 Alert Template Indicator, please follow the instructions below:\n• Copy all the folders from the archive directly to the MQL4 folder.\n• Restart MetaTrader 4 or refresh the indicators list by right-clicking the Navigator subwindow of the platform and choosing Refresh.\n\nFor more detailed instructions on how to perform the installation please visit this article."
    },
    {
        "link": "https://fxssi.com/what-are-alerts-and-how-to-use-them",
        "document": "What are Alerts in MT4, and How to Use Them?\n\nIn this article, we are going to tell you about Alerts in MT4 terminal, their creation and customization in full details, and we will also mention an example of when you can effectively use alerts in practice.\n\nTrade alerts in MT4 is a feature that allows to notify users of several events happening in the market. MT4 sounds alerts (alarm) meaning: traders can use this feature, to get sound alerts in Metatrader 4 upon hitting a certain price level – it enables them to always keep their fingers on the pulse of the market.\n\nAlerts are displayed on the chart and look something like this:\n\nAll the features available to ordinary orders – for example, color change, drag-and-drop by mouse or calling a customization menu by double-clicking – can be applied to alerts.\n\nYou can set three conditions under which an alert will trigger:\n\nNotice that there are Expert Advisors and indicators using their own built-in alerts which cannot be found in the list under the \"Alerts\" tab. For example, we often use alerts in our indicators to send sound notifications when trading signals are generated and up-to-date data come from our server to the user’s terminal.\n\n\n\nCreation and Customization of Alerts for MT4\n\nBtw, if you are looking to upgrade your terminal with pro indicators and different utilities you can browse from variety of resources available at FXSSI Product manager.\n\nSo, how to set alerts on MT4? You can create alerts in two ways (see the picture below for more details):\n• Right-click on the chart, then select Trading → Alert. The alert will be immediately created. It is convenient because it can be created exactly at the required price level.\n• You can do this directly on the \"Alerts\" tab as shown in the picture above.\n\nNow you know how to add sound alert to MT4 and you can go to the alert customization menu (\"Alert Editor\") by double-clicking it on the chart. See an example of an already customized notification (the actions required are listed below the picture):\n• Action. The following actions can be performed after an alert has been triggered:\n• Sending email notification (Mail). You need to configure mail settings in MT4 to send written notifications.\n• Symbol. It’s all clear here – select the financial instrument that you are willing to receive notifications for.\n• Source. Here you need to select which signal/file must be run or enter subject and text of the letter to be send.\n• Expiration. Data and time when alert is automatically removed can be specified here, if necessary.\n• Condition. Specify the condition under which alert must be triggered: notification will be sent when Ask/Bid price hits a certain level or when the specified time comes (time should be specified as hh:mm).\n• Value. It is a continuation of the item 4. I suppose that won’t be a problem.\n• Timeout. It means a delay between alerts to be triggered (in seconds).\n• Maximum iterations. It is a continuation of the item 7. Here you should enter the maximum number of times that the action specified in item 3 must be triggered.\n\nNow we have finished with the settings, so let’s talk about when you can use alerts.\n\n\n\nMany traders disregard this feature. However, its usage pays it off in practice, so we’re going to list several situations where alerts should be used:\n• Sometimes it doesn’t pay to open a trade at the current price – this is why one has to sit in front of the computer looking at the trading terminal and waiting for a good price (Limit order is not always a good idea). In such situations, you can safely set an MT4 alarm and go to watch the TV. When the alert is triggered, you should go back to your terminal, analyze the market and open a trade.\n• If you dislike trading in a range or wait for level breakout, you can set an alert to be triggered when price exits from a range.\n• If you trade at the market opening (the London, New York, etc. session), it will be comfortable for you to use alerts to notify you about the opening. Although in this case you should make use of Trading Sessions indicator (\"FXSSI.TradingSessions\").\n• Forgetful investors can also set notifying alerts before news releases. As in the previous case, it’s better to move this feature to the specialized News indicator (\"FXSSI.Calendar\").\n\nThe following picture shows a practical example where entry point has been defined based on \"Three Indians\" pattern.\n\nArea of successful market entry is marked in gray, and the alert has been set next to it.\n\nIn any case, you shouldn’t put a lot of time into setting alerts – set only those alerts that really matters. The tool must be used as intended.\n\nMany readers who visit this page begin to look for sound signals that can be added into their trading terminals to those already in place. This is why we collected some interesting sounds.\n\nYou can download and add them into your terminal.\n\nThe downloaded file should be placed in the \"Sounds\" folder located in the root directory of your terminal."
    }
]