[
    {
        "link": "https://doc.comsol.com/6.0/doc/com.comsol.help.comsol/COMSOL_ReferenceManual.pdf",
        "document": ""
    },
    {
        "link": "https://doc.comsol.com/5.5/doc/com.comsol.help.comsol/COMSOL_ReferenceManual.pdf",
        "document": ""
    },
    {
        "link": "https://doc.comsol.com/5.5/doc/com.comsol.help.comsol/comsol_ref_results.28.164.html",
        "document": "From the list, you can choose from predefined and user-defined sets of image snapshot settings: , , (the default), or , which are tailored settings for image snapshots suitable for a web page, for printing, or for a PowerPoint presentation. The option uses the current size on the screen (which is displayed), so only the and check boxes are available under . If you have modified the image snapshot, you can save those settings as another preset option. To do so, click the button ( ) and provide a name for the user-defined preset option in the field of the dialog box that opens. If you do not want to keep an added user-defined preset option, click the button ( ). If you have made changes to a preset option and want to return to its default values, click the button ( ). list, you can choose from predefined and user-defined sets of image snapshot settings:(the default), or, which are tailored settings for image snapshots suitable for a web page, for printing, or for a PowerPoint presentation. Theoption uses the current size on the screen (which is displayed), so only theandcheck boxes are available under. If you have modified the image snapshot, you can save those settings as another preset option. To do so, click thebutton () and provide a name for the user-defined preset option in thefield of thedialog box that opens. If you do not want to keep an added user-defined preset option, click thebutton (). If you have made changes to a preset option and want to return to its default values, click thebutton ().\n\nSelect an image source. The tree of nodes contains the 1D, 2D, or 3D plot groups previously defined. It also contains component nodes that are associated with an image such as selections, the geometry (including individual geometry features and work planes in 3D), materials, physics features, and meshes. Click the button ( ) underneath the tree to define the selected node as the source for the image export. The selected node gets a source overlay ( ) in the tree above and is added to the field below. Click the button ( ) as needed to remove the source. If you have added an image from a plot group, that plot group is set as the selected source. button () underneath the tree to define the selected node as the source for the image export. The selected node gets a source overlay () in the tree above and is added to thefield below. Click thebutton () as needed to remove the source. If you have added an image from a plot group, that plot group is set as the selected source.\n\nSelect a : or (the defaults, depending on the selected node) to use the view from the plot group settings or from the component’s geometry, respectively, or select another view from the list (if available and previously defined). It is also possible to choose . The image then uses that new view, which appears as a 2D or 3D ( or ( ) node under (or under if the nodes are grouped by type). or(the defaults, depending on the selected node) to use the view from the plot group settings or from the component’s geometry, respectively, or select another view from the list (if available and previously defined). It is also possible to choose. The image then uses that new view, which appears as a 2D or 3Dor () node under(or underif the nodes are grouped by type).\n\nOn the window toolbar, click the button ( ) to refresh the window to get a preview of the image to export. Refreshing can be useful if you have changed the scene or view. window toolbar, click thebutton () to refresh thewindow to get a preview of the image to export. Refreshing can be useful if you have changed the scene or view.\n\nClick the button ( ) in the window or right-click the node and select to export an image to a file. The window confirms where the file is exported as specified in the section. button () in thewindow or right-click the node and selectto export an image to a file. Thewindow confirms where the file is exported as specified in thesection.\n\nIf is set , choose an image file : PNG (the default), BMP, JPEG, TIFF, GIF, glTF (GL Transmission Format; 3D only, saved as binary GLB files), or EPS (1D only). If you choose the JPEG format, you can also control the quality of the image using a quality measure (scalar number) between 1 and 100 (a higher number represents a higher quality). The default value is 92. Select the check box next to to enter another quality number. is set, choose an image file: PNG (the default), BMP, JPEG, TIFF, GIF, glTF (GL Transmission Format; 3D only, saved as binary GLB files), or EPS (1D only). If you choose the JPEG format, you can also control the quality of the image using a quality measure (scalar number) between 1 and 100 (a higher number represents a higher quality). The default value is 92. Select the check box next toto enter another quality number.\n\nSelect the check box if you want the program to always display a dialog box for specifying where to store the image. check box if you want the program to always display a dialog box for specifying where to store the image.\n\nSelect the check box if you want to lock the view in PowerPoint. Saved camera settings are then used when you update the image from PowerPoint. If this check box is cleared, the current camera settings are used when updating the image. check box if you want to lock the view in PowerPoint. Saved camera settings are then used when you update the image from PowerPoint. If this check box is cleared, the current camera settings are used when updating the image.\n\nOne additional option is available for the Image export when using a PNG file format: . Otherwise, see for the rest of the settings. For 1D nodes, the check box is selected by default. option is available for the Image export when using a PNG file format:. Otherwise, seefor the rest of the settings. For 1Dnodes, thecheck box is selected by default."
    },
    {
        "link": "https://comsol.com/model/download/978101/COMSOL_MeshImportExportGuide.pdf",
        "document": ""
    },
    {
        "link": "https://comsol.fr/forum/thread/14525/how-to-export-data-from-comsol",
        "document": "I was using COMSOL to simulate how fluid flow is affected by nanostructures. Now I'd like to export the velocity magnitudes from a constant x value and varying y value. I just can't find a way to do it and the help section was no help at all. Any help's appreciated. Thanks."
    },
    {
        "link": "https://comsol.com/blogs/how-to-create-high-quality-model-images-in-comsol-multiphysics",
        "document": "Exporting high-quality images from the COMSOL Multiphysics® software just takes a bit of know-how. Familiarizing yourself with the image export settings can help you produce images that are appropriate for your particular use, whether that is in a presentation, article, or paper — or on the web. Plus, once you get started, you may find a creative side you didn’t know was there.\n\n\n\n Take your exported images to new heights.\n\nAt any point in your modeling process, you have the ability to export an image snapshot of the Graphics window contents. In the Graphics toolbar, there is an Image Snapshot button with a camera icon. When clicked, a dialog box will appear with a host of settings for the image itself, as well as the layout. Depending on the settings you select, the settings you will want to use will vary. If you’re just interested in exporting a high-resolution model results image without any text, the settings shown below will suffice.\n\nBefore getting into what settings to use for different purposes, let’s go over the settings themselves.\n\nThe Width, Height, Font size, and Background settings are self-explanatory.\n\nFor the Unit, we recommend using Manual (web) for the size and Pixels (px), unless you are printing the image for a poster or other hard copy resource. The number of pixels is the limiting factor, a maximum of 4096 for both height and width.\n\nThe Resolution setting affects multiple aspects of the exported image, including the edges of the model geometry, the title, legend, and grid. The higher the DPI, or PPI (pixels per inch) for web, the thicker the lines, text, and legend will be. When exporting images for print, a resolution of 300 DPI is standard, and you can enter a width/height of up to 346.8 mm or 13.65 inches (before exceeding the maximum of 4096 pixels). A general best practice for exporting images for web is to use the preset, Manual (web), and to increase the resolution at the same ratio as the width of the image.\n\nFor the export format, note that EPS applies only to 1D plots, glTF™ applies only to 3D images, and the GIF format here is a single image as opposed to an animation.\n\nWhen it comes to the finer details of exporting images, there is a key decision to make. Are you exporting the image for aesthetics or clarity? That is, do you simply want your image to look good, or do you want the image to convey valuable information?\n\nAs previously mentioned, if you are exporting an image for aesthetics (without any text), the best settings are a height and width of 4096 x 4096 and 300 DPI, with the antialiasing check box selected. Whether you want to zoom extents, focus on a specific part of the geometry, or use a transparent background depends on your preferences. Of course, you may want to adjust the aspect ratio (width and height) depending on the model geometry shape, such that the image fills the container.\n\nWe often include text in our images to convey information about the plot. Text will appear when adding a title or color legend (3D, 2D) or information legend (1D), as well as when employing the Annotation feature. There are two settings that will affect the size of the text: Font size and Resolution. As an example, the image below has a width of 690 pixels, which matches the width of the blog’s frame (the blog you’re reading right now), so the image is not resized, and the 96 DPI and 9 font size match that of COMSOL Multiphysics, ensuring clear text.\n\n\n\n The turbine stator model image exported at 640 x 360 pixels with 96 DPI and a font size of 9, shows the von Mises stress on the surface of the model, as well as the maximum and minimum stress values.\n\nAs images get larger, so must the values for the resolution and font. Slide decks, webpages, and Microsoft® Word documents, for example, require images with higher resolutions. The image below has settings meant for someone to see in a full screen. While it doesn’t look as nice in this blog post, it looks much better if you click to enlarge.\n\n\n\n The solar panel model image exported at 1920 x 1200 pixels with 150 DPI and a font size of 12, showing the velocity streamlines of the flow and displacement of the panels.\n\nUnderstanding how the image export settings function is crucial to producing high-quality images. With a little bit of practice and tinkering, exporting images can be a breeze. If you have further questions about exporting images for various uses, feel free to comment below!\n\ngITF is a trademark of The Khronos Group Inc.\n\nMicrosoft is either a registered trademark or trademark of Microsoft Corporation in the United States and/or other countries."
    },
    {
        "link": "https://comsol.com/forum/thread/339771/issue-with-image-resolution-when-exporting-from-comsol",
        "document": "I'm currently working on my thesis and need to export high quality images of my COMSOL model. However, whenever I save the images, the resolution seems too low, and the details are not clear enough for publication. I've tried adjusting the settings and I used some online application such as Jpeg compressor and others but haven't had much success.\n\nHas anyone encountered this issue before, and can you suggest the best way to export high-resolution images from COMSOL?"
    },
    {
        "link": "https://doc.comsol.com/6.1/doc/com.comsol.help.comsol/comsol_api_results.51.064.html",
        "document": "creates an image feature with the name\n\ncreates am image feature with the namefor the plot group\n\nchanges the source of the image to the plot group named\n\nAlways ask for filename when saving if is set to . This property is ignored when running without a GUI. is set to. This property is ignored when running without a GUI.\n\nThe type of image to export if is set to . can only be used for 1D plots. can only be used for 3D plots. is set tocan only be used for 1D plots.can only be used for 3D plots.\n\nIf is : enable or disable display of the legend in 1D. is: enable or disable display of the legend in 1D.\n\nIf is : enable or disable display of the legend in 2D. is: enable or disable display of the legend in 2D.\n\nIf is : enable or disable display of the legend in 3D. is: enable or disable display of the legend in 3D.\n\nIf , then the aspect ratio of the image is preserved when the width or the height is changed. , then the aspect ratio of the image is preserved when the width or the height is changed.\n\nLock the view in PowerPoint or Word if is set to . Saved camera settings are then used when you update the image from PowerPoint or Word. is set to. Saved camera settings are then used when you update the image from PowerPoint or Word.\n\nIf is : enable or disable display of the logo in 1D. is: enable or disable display of the logo in 1D.\n\nIf is : enable or disable display of the logo in 2D. is: enable or disable display of the logo in 2D.\n\nIf is : enable or disable display of the logo in 3D. is: enable or disable display of the logo in 3D.\n\nIf is : enable or disable display of the title in 1D. is: enable or disable display of the title in 1D.\n\nIf is : enable or disable display of the title in 2D. is: enable or disable display of the title in 2D.\n\nIf is : enable or disable display of the title in 3D. is: enable or disable display of the title in 3D.\n\nThe view for the image: with it is typically taken from the plot group or from the geometry. it is typically taken from the plot group or from the geometry."
    },
    {
        "link": "https://comsol.com/forum/thread/140682/how-to-properly-export-and-import-data",
        "document": "Please login with a confirmed email address before reporting spam \n\n I export the results of model one to a spreadsheet of 4000x4000 points (regular grid)\n\n ...\n\n \n\n Is there a better way for me to export/import data between models?\n\n \n\n \n\n What data format are you using - Spreadsheet or Grid? The Spreadsheet format gives a file that is easy to process in external software, but the Grid data format gives a smaller file which is processed much faster when you use it in an interpolation function in COMSOL Multiphysics.\n\n \n\n What data format are you using - Spreadsheet or Grid? The Spreadsheet format gives a file that is easy to process in external software, but the Grid data format gives a smaller file which is processed much faster when you use it in an interpolation function in COMSOL Multiphysics. [QUOTE] I export the results of model one to a spreadsheet of 4000x4000 points (regular grid) ... Is there a better way for me to export/import data between models? [/QUOTE] What data format are you using - Spreadsheet or Grid? The Spreadsheet format gives a file that is easy to process in external software, but the Grid data format gives a smaller file which is processed much faster when you use it in an interpolation function in COMSOL Multiphysics.\n\nPlease login with a confirmed email address before reporting spam \n\n Hi, I have two models where the second one uses results of the first one.\n\n \n\n I export the results of model one to a spreadsheet of 4000x4000 points (regular grid), corresponding to a resolution of 0.5 nm. This results in a huge csv-file of almost 1 GB. I then import and plot this file into the model two via an interpolation function, but this can take up to 15 minutes. This is all done on a dedicated Linux server with 128 GB memory, which is normally very fast.\n\n \n\n Is there a better way for me to export/import data between models?\n\n \n\n I think that if it's absolutely necessary for you to have that kind of resolution then there probably isn't a way around how long it's going to take for the import. You can always specify the step-size of your grid and cut down the number of data points. Also, when you say that you take data from one model and import it in to another are you talking about two separate model files or two components?\n\n \n\n Edit: I wrote my response before reading Gunnar's comment - I have only ever imported data using the Grid format and although I don't have 4000X4000 data points, I can tell you that importing with something around 500x500 in grid format is almost instant on a machine with 32 GB memory.\n\n I think that if it's absolutely necessary for you to have that kind of resolution then there probably isn't a way around how long it's going to take for the import. You can always specify the step-size of your grid and cut down the number of data points. Also, when you say that you take data from one model and import it in to another are you talking about two separate model files or two components?Edit: I wrote my response before reading Gunnar's comment - I have only ever imported data using the Grid format and although I don't have 4000X4000 data points, I can tell you that importing with something around 500x500 in grid format is almost instant on a machine with 32 GB memory. [QUOTE] Hi, I have two models where the second one uses results of the first one. I export the results of model one to a spreadsheet of 4000x4000 points (regular grid), corresponding to a resolution of 0.5 nm. This results in a huge csv-file of almost 1 GB. I then import and plot this file into the model two via an interpolation function, but this can take up to 15 minutes. This is all done on a dedicated Linux server with 128 GB memory, which is normally very fast. Is there a better way for me to export/import data between models? [/QUOTE] I think that if it's absolutely necessary for you to have that kind of resolution then there probably isn't a way around how long it's going to take for the import. You can always specify the step-size of your grid and cut down the number of data points. Also, when you say that you take data from one model and import it in to another are you talking about two separate model files or two components? Edit: I wrote my response before reading Gunnar's comment - I have only ever imported data using the Grid format and although I don't have 4000X4000 data points, I can tell you that importing with something around 500x500 in grid format is almost instant on a machine with 32 GB memory.\n\nPlease login with a confirmed email address before reporting spam \n\n \n\n I export the results of model one to a spreadsheet of 4000x4000 points (regular grid)\n\n ...\n\n \n\n Is there a better way for me to export/import data between models?\n\n \n\n \n\n What data format are you using - Spreadsheet or Grid? The Spreadsheet format gives a file that is easy to process in external software, but the Grid data format gives a smaller file which is processed much faster when you use it in an interpolation function in COMSOL Multiphysics.\n\n \n\n \n\n Thanks, that did the trick! I was using Spreadsheet before, but Grid is significantly faster to the point that loading and plotting is almost instant.\n\n Thanks, that did the trick! I was using Spreadsheet before, but Grid is significantly faster to the point that loading and plotting is almost instant. [QUOTE] [QUOTE] I export the results of model one to a spreadsheet of 4000x4000 points (regular grid) ... Is there a better way for me to export/import data between models? [/QUOTE] What data format are you using - Spreadsheet or Grid? The Spreadsheet format gives a file that is easy to process in external software, but the Grid data format gives a smaller file which is processed much faster when you use it in an interpolation function in COMSOL Multiphysics. [/QUOTE] Thanks, that did the trick! I was using Spreadsheet before, but Grid is significantly faster to the point that loading and plotting is almost instant."
    },
    {
        "link": "https://comsol.com/forum/thread/105332/how-to-export-geometrys-picture",
        "document": "Hi,\n\n If I want to show my model geometry in my paper, how can I export my geomertry's picture from comsol? I need the picture to be of high resolution enough for paper's requirements ?.png and .jpg are acceptable, and .tiff format will be better.\n\n Can you tell me the detailed operation to get the picture?\n\n Thank you."
    }
]