[
    {
        "link": "https://api.highcharts.com/gantt/series.gantt.point.events.unselect",
        "document": "These pages outline the chart configuration options, and the methods and properties of Highcharts objects.\n\nFeel free to search this API through the search bar or the navigation tree in the sidebar."
    },
    {
        "link": "https://api.highcharts.com/gantt/plotOptions.series.point.events.unselect",
        "document": "These pages outline the chart configuration options, and the methods and properties of Highcharts objects.\n\nFeel free to search this API through the search bar or the navigation tree in the sidebar."
    },
    {
        "link": "https://api.highcharts.com/gantt/series.gantt.point.events.select",
        "document": "These pages outline the chart configuration options, and the methods and properties of Highcharts objects.\n\nFeel free to search this API through the search bar or the navigation tree in the sidebar."
    },
    {
        "link": "https://api.highcharts.com/highcharts/plotOptions.line.point.events.unselect",
        "document": "These pages outline the chart configuration options, and the methods and properties of Highcharts objects.\n\nFeel free to search this API through the search bar or the navigation tree in the sidebar."
    },
    {
        "link": "https://highcharts.com/forum/viewtopic.php?t=21686",
        "document": ""
    },
    {
        "link": "https://highcharts.com/docs/gantt/getting-started-gantt",
        "document": "Gantt chart visualizes the work breakdown structure for projects. It illustrates the time intervals of the project tasks and their dependencies. The breakdown of the project is described in tasks which are listed on the vertical axis where the duration of the tasks is offset against the horizontal axis.\n\nFind demos of Gantt charts here to quickly get an overview of Highcharts Gantt’s capabilities.\n\nLoad Highcharts Gantt as a standalone library when there is no need for other Highcharts dependencies.\n\nExample of loading Highcharts Gantt into a webpage\n\nLoad Highcharts Gantt as a module when a project needs both Highcharts and Gantt loaded at the same time. Place the script tag or import statement after loading the main library, Highcharts or Highcharts Stock.\n\nExample of loading both libraries in a webpage\n\nFor alternative loading and bundling patterns, for UMD, AMD, CommonJS or ES6 modules, find more information here. Highcharts Gantt follows the same patterns as described for Highcharts.\n\nRun the constructor for initializing a Gantt chart visualization. The constructor takes two required parameters and a third optional parameter.\n• The of the HTML element used for rendering the chart.\n• : An object with configuration options for defining the Gantt chart.\n• : Optional, a callback for getting a handle on the chart, after rendering.\n\nSee also explained here in Gantt API\n\nSee below the simple live example of a Gantt chart"
    },
    {
        "link": "https://api.highcharts.com/gantt/series.gantt.selected",
        "document": "Welcome to the Highcharts Gantt JS (gantt) Options Reference\n\nThese pages outline the chart configuration options, and the methods and properties of Highcharts objects.\n\nFeel free to search this API through the search bar or the navigation tree in the sidebar."
    },
    {
        "link": "https://stackoverflow.com/questions/67614055/in-highchart-gantt-chart-inside-highcharts-point-how-can-i-create-custom-shapes",
        "document": "You can use class to add the custom shapes. Please remember that the below example is only a draft, you probably will need to reposition the elements on chart redraw."
    },
    {
        "link": "https://stackoverflow.com/questions/68632585/gantt-chart-in-highchart/68649385",
        "document": "I am using a high chart (Gantt Chart)in my application below are the code\n\nNow i like to Loop on Data it show the error Uncaught SyntaxError: Unexpected token 'for' if i loop above the series same , how to loop my activities array here in gantt chat using highcharts\n\nor you can suggest me another method to use the loop thanks"
    },
    {
        "link": "https://gantt-docs.highchartspython.com/en/latest/glossary.html",
        "document": "A JavaScript function which is passed to Highcharts JS in the configuration which performs an action which affects the chart. Typically, callback functions are used to define event handlers or to define Highcharts formatters.\n\nCartesian charts are charts that typically feature two or more axes, by common convention referred to as the X axis (classically represented as the horizontal axis) and the Y axis (classically represented as the vertical axis). If the chart features a third axis (for example in a three dimensional chart), it is commonly called the Z axis. The location of a data point on a Cartesian chart is the intersection of its metric on one axis (typically the Y axis) and its dimension on the other axis (typically the X axis).\n\nA multiple inheritance pattern that is considered an anti-pattern by the Python community because it creates difficult-to-maintain-and-debug complexity. The pattern involves the creation of one ancestor class (we’ll call this class ), two child classes (we’ll call them and , respectively), and a third grand-child class that inherits from both and . This pattern is considered an anti-pattern because - absent a deep understanding of Python’s :iabbr`MRO (Method Resolution Order)` - it is perceived as introducing ambiguity as to which ancestors methods will be executed when hoisting from the grand-child class. Highcharts for Python - to minimize repetition of code and to keep the code base maintainable - does use this anti-pattern extensively, as discussed in greater detail in the contributors guidance.\n• None Multiple Inheritance, DRY, and the Diamond of Death\n\nA server application which can receive requests to generate charts, produces those charts headlessly (without a UI), and returns a static export of the charts to the process that requested them. The Highcharts Export Server is an application written and maintained by Highsoft, creators of Highcharts JS. It is available as a NodeJS application which can be deployed by organizations that license Highcharts. In addition to the deployable Node Export Server, Highsoft also provides a Highsoft-hosted version of the export server. This Highsoft-provided server imposes rate limiting and other limitations, but can be used by licensees of Highcharts JS to programmatically generate downloadable static versions of their charts.\n\nA way of representing data in JavaScript as native JavaScript objects which is necessary to maximize value from Highcharts JS. It is easiest to compare JavaScript object literal notation to the closely-related JSON (JavaScript Object Notation), though they are very different and serve very different purposes. JavaScript Object Literal Notation is JavaScript source code. JSON is not. JSON is a way of encoding data into a text form that JavaScript is able to parse and deserialize. Because Highcharts JS relies heavily on JavaScriot object literal notation to support the definition of event handlers and callback functions, Highcharts for Python is designed to serialize and deserialize Python representations to/from their JavaScript object literal form. Below is a comparison of a (similar) object represented in both JavaScript object literal notation and JSON, with further commentary: As you can see, the two forms are very similar. However, the JavaScript object literal notation has its keys directly accessible as properties of the object, while the JSON version has them represented as strings. Furthermore, because JSON is inherently a way of encoding data into strings, it is not wise to use it to transport functions which will then be executed by some other code (doing so is a dangerous security hole). Typically, JSON can be converted to JavaScript object literal notation easily…but the opposite does not hold true.\n\nTechnical indicators are only available in Highcharts Stock for Python. chnical indicators are analyses performed on another series that can provide ditional insights. For example, by looking at a linear regression of a time series u can gain insight into the overarching trend of the data. Highcharts Stock for Python** supports over 50 different technical indicators. dicators differ from typical series in that they do not accept data of their n. They do not have a property, and do not receive their own data points. stead, they are automatically calculated by ighcharts Stock <https://www.highcharts.com/products/stock/>`__ by linking the dicator series to a main series on the chart itself.\n• None Using Highcharts Stock for Python > Using Technical Indicators\n\nThis is a term that relates to Highcharts for Python’s internal operations. If you are not Contributing to Highcharts for Python to the library, you don’t need to worry about it. An untrimmed representation of a Highcharts for Python object includes those properties that have values. In order to minimize data on the wire and maintain consistency with Highcharts JS, properties that have values of will be removed when serializing objects to JavaScript object literal notation or to JSON. The untrimmed object is the representation of the object before those properties are removed, where values of are still explicitly present."
    }
]